[
{"role": "Junior React Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Our client a digital transformation technology company with a proven track record in solving complex problems for the finance, telecommunications, and construction industries is actively seeking to hire a fulltime permanent Junior React Developer to work in a hybrid role.Role OverviewWe are seeking a skilled and motivated Front-End React Developer to join our team and help us build engaging and intuitive web applications. As a Front-End React Developer, you will collaborate closely with our design and back-end teams to implement user interfaces that meet our clients' needs and elevate the overall user experience. You will play a crucial role in translating design mockups and wireframes into responsive and functional web interfaces.What Will You DoDevelop and implement user interfaces for web applications using React.js and related technologies.Collaborate with designers and back-end developers to ensure seamless integration of front-end and back-end components.Optimize web applications for maximum speed and scalability.Ensure the technical feasibility of UI/UX designs and provide input on design feasibility and potential enhancements.Participate in code reviews and provide constructive feedback to team members.Stay up-to-date with the latest industry trends and technologies to continually improve our development processes and outcomes.Troubleshoot and debug issues as they arise and propose solutions to maintain application quality.Actively participate in brainstorming sessions and contribute creative ideas to enhance the user experience. What Will You BringBachelors Degree in Computer Science with 1-2 years of industry experience Proficient in React.js and its core principles.Strong understanding of JavaScript (ES6+), HTML5, and CSS3.Experience with responsive and mobile-first web development.Familiarity with RESTful APIs and asynchronous request handling.Solid understanding of version control systems, preferably Git.Experience with front-end build tools and preprocessors such as Webpack, Babel, SASS/LESS.Ability to work collaboratively in a team environment.Excellent problem-solving skills and attention to detail.Strong communication skills and the ability to explain technical concepts to non-technical team members.Experience with testing and debugging tools.Bonus: Knowledge of UX/UI design principles and practices.Bonus: Familiarity with back-end technologies and frameworks.\n      "},
{"role": "Software Engineering, New Grad", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Who we areAbout StripeStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.About The TeamStripe offers an interesting middle ground between joining a small startup and going to work for a multinational company. We have systems and processes optimized for early-career professionals. You will be in an environment that prizes rigor, discipline, and reliability—from our products, from our ways of working, and from our colleagues. You will learn how the best teams put together extremely reliable systems, and you will be responsible for operating these systems, with adequate backup when things get tough.What you’ll doAs a company, we believe in end-to-end ownership of projects. For any given project, we have one person on point. While they don't necessarily have to do all the work themselves, it's their job to make sure all the work gets done. We launch betas and prototypes as early as we can. This helps ensure that we're building what users actually want. We contribute back to the community, often by building things we think are cool and by releasing open-source software.ResponsibilitiesWork on cross-functional projects, directly collaborating with other engineersGive meaningful feedback on code reviews and technical designsEnsure that the systems your team operates continue running well and can scale to meet the needs of our usersBuild the skills to own a project from beginning to end, learning project management and technical leadership skillsWho you areWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.Minimum RequirementsA Bachelor’s, Master’s, or PhD degree in computer science or a directly related field, obtained by summer 2024, or equivalent work experienceSome experience and familiarity with programming, either through side projects or classwork. We work mostly in Java, Ruby, JavaScript, Scala, and Go. We believe new programming languages can be learned if the fundamentals and general knowledge are presentExperience from either previous internships or working collaboratively on multi-person coding projects (in a university or professional setting)Ability to learn unfamiliar systems and form an understanding of those systems, through independent research and working with a mentor and subject matter expertsPreferred QualificationsOne or more areas of specialized knowledge balanced with general skills and knowledge, such as knowing more frontend technologies and, at a high level, how a service handles an HTTP requestExperience in code review practices, and an understanding of how to safely update production systemsFamiliarity with navigating and managing work in large code bases\n      "},
{"role": "Software Engineer ( All Levels)", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Job DescriptionAt Warner Music Group, we’re a global collective of music makers and music lovers, tech innovators and inspired entrepreneurs, game-changing creatives and passionate team members. Here, we know that each talent makes our collective bolder and brighter. We are guided by four core principles that underpin everything we do across all our diverse businesses:Music is Everything: Music is our passion, and we can never get enough. Tastes, trends, and tech will change, but great artists and songwriters will always be our driving force.Global Growth, Local Expertise: Music is a global language. Through communication and collaboration, our success can come from anywhere and translate everywhere.Innovation and Insight: Pushing the boundaries requires the best information and the boldest imagination. We use both to create the future.Empowered by People: Like the artists we serve and the music they make, our differences make us stronger. This is a place where every talent can belong and build a career.Technology is one of the most important parts of our business. Whether it’s signing up new artists; ensuring we provide the right data to Spotify, YouTube, and other digital service providers; or helping artists use the latest AI tools and make thoughtful decisions with data-driven insights – technology plays an invaluable role in our success. The engineering team at Warner Music Group makes all of it a reality.We are actively hiring for multiple engineering positions in Toronto, which include:Junior Engineers Senior Engineers Staff+ EngineersWe remain committed to Diversity, Equity, and Inclusion. We know it fosters a culture where you can truly belong, contribute, and grow. We encourage applications from people of any age, gender identity, sexual orientation, race, religion, ethnicity, disability, veteran status, and any other characteristic or identity.Job Title: Software Engineer (all levels) Your RoleOwning, defining the technical vision, and driving innovation for key technical systemsMentoring for junior engineers and mentorship opportunities for senior engineersCollaborating closely with key music industry stakeholders as well as colleagues in NYC, Los Angeles, and LondonHere You’ll Get ToReimagine and implement the future of tech for the music industry Work as part of a dynamic and highly effective team Own the creation and delivery of highly innovative products Learn and grow as a professional through close collaboration with your team members and engineering leaders, and by being part of culture of continuous improvement and learningAbout YouYou’re a curious learner with a desire to grow and contribute to a positive team environment You have a high sense of ownershipYou’re able to deal with ambiguity and working in a fast-paced, evolving environmentYour bias is towards action, and you always find ways to deliver better solutions more efficientlyYou’re an empathetic team member who works well in a team environment and communicates effectivelyYou’re excited about the music business: helping artists and songwriters grow and helping the world hear more great musicYou have a Bachelor’s degree in a relevant discipline or equivalent professional experienceAbout UsWith a legacy extending back over 200 years, Warner Music Group (WMG) today brings together artists, songwriters and entrepreneurs that are moving entertainment culture across the globe. Operating in more than 70 countries through a network of affiliates and licensees, WMG’s Recorded Music division includes renowned labels such as Atlantic, Elektra, and Warner Records. WMG’s music publishing arm, Warner Chappell Music, has a catalog of more than 1.4 million musical compositions spanning every musical genre, from the standards of the Great American Songbook to the biggest hits of the 21st century.Together, we are Warner Music Group: Music With Vision &amp; Voice.Love this job and want to apply?Click the “Apply” link at the top of the page, or apply directly with your LinkedIn. Applying with LinkedIn will import all of the information you put in your profile, but will still allow you to upload a resume and cover letter.Don’t be discouraged if you don’t hear from us right away. We’re taking our time to review all resumes, and to find the best people for WMG.Thanks for your interest in working for WMG. We love it here, and think you will, too.\n      "},
{"role": "Software Developer (All Levels Welcome)", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Description                            As a Software Developer at CBN you play an integral part in making the world a more secure place as you develop customized solutions that we design for governments around the globe. Problem solvers will thrive in this role as you will be continually challenged by the complexity and uniqueness of each customer’s system and its inherent requirements.  If you are looking for a challenge, you will find it at CBN as you work on high-profile, complex immigration, identity management and motor vehicle information systems. You’ll get to work on a variety of leading-edge secure technologies as well as be exposed to variety of contemporary languages and other development tools.  What We Can Offer You Compensation: We seek long term relationships with our employees and recognize and reward them with a competitive total compensation package that includes:An industry leading defined contribution pension plan with company matching contributions (up to 5%) and payment of service fees,Best-in-class health, medical and life insurance benefits.Access to virtual and telehealth services and apps; andVery progressive fertility, adoption, and surrogacy benefits to support all definitions of family. Career: As a knowledge-based organization we will provide you with a wealth of learning opportunities and challenging work that will grow your knowledge, skills and abilities. At CBN, we encourage and empower our employees to chart their own career path, putting you in control of your future. Culture: Personal character is the foundation of our culture. CBN’s 7 Core Principles shape and guide our behaviours and underpin the sense of community you will experience at CBN. Equality, diversity, and inclusivity are important to us as an organization, and we are committed to fostering and developing a work environment where every employee is treated with dignity and respect. What You Will DoAs part of a cross-functional team (DBA’s, Testers, Developers and Project Managers), you will participate in the creation of desktop and web application systems from conception to launch. Taking direction from a Project Lead, you will:         Participate and or design in the functionality (remember our customized systems) based on a systems requirement document.        Write code! Following design CBN coding standards during the development lifecycle.        Write automated unit tests to validate the code is doing what it’s designed for and saving effort for subsequent manual testing.        integrate code with 3rd party software or legacy systems, deploying components to a shared environment to ensure system interoperability.        Support and maintain release code by fixing bugs, as part of the long-term support of the systems Minimum Qualifications Skills and AbilitiesExperience developing on at least one of Windows or Linux (and both is preferable)Experience developing software systems using at least one of Java, C++, or C# (and all    three is preferable)Experience interacting with RDBMS environments using SQLKnowledge of SOAP, xmlrpc, and/or Spring frameworksExperience with source control and build tools, especially Git, Subversion, Maven, and the Atlassian suite (Bamboo, Jira, Confluence)Experience with Oracle and/or PostgreSQL RDBMSExperience with web UI frameworks, especially Angular and/or Vaadin Soft Skills        Self-directed learner        Attention to detail, with a flare of creativity        A passion for helping people        Expert organizational skills        Good judgement to know what is important Mandatory RequirementsTravel to some customer sites to install hardware and infrastructure (Of course only when it’s safe!)About Us CBN designs and develops industry leading solutions for the following domains: Border Security, Civil Identity, Driver Identification and Vehicle Information, Currency and Excise Control, and Lottery and Charitable Gaming. To learn more, visit www.cbnco.com. As an Equal Opportunity Employer, Canadian Bank Note Company, Limited is committed to achieving a skilled workforce that reflects the diversity of the Canadian population. We encourage applications from women, visible minorities, people with disabilities and Aboriginal people. Canadian Bank Note Company Limited is committed to developing inclusive, barrier-free selection processes and work environments. If contacted regarding this competition, please advise the interview coordinator of any accommodation measures you may require.   \n      "},
{"role": "Frontend Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        What we're looking forWe are looking for a front end developer! Phoenix is a Y Combinator backed startup based in downtown Toronto. You’ll work closely with the cofounders to continue to build out the patient side of our platform. We are looking for a passionate, mission-driven developer who takes pride in the products they build.QualificationsHave 3+ years of professional programming experienceCreating software features that are robust, reliable, and user-friendly for our customersExperience developing software for the Web platform, including cross-browser compatibilityCreating software features that are robust, reliable, and user-friendly for both internal teams and our customersExperience with modern tools like ES6, React, Redux, Apollo, Flux &amp; WebpackGood eye for design and ability to make product decisions.You care about men’s health and have a personal connection to the spaceWhy work with Phoenix?Impact &amp; autonomy. You’ll report directly to the founders who are both senior devs and you'll have a real opportunity to build Phoenix's productCool tools! We use some great software and platforms to deliver the best in care. Need something to make your job easier? We'll work with you to make it happen!Rewarding Mission. We're delivering the best healthcare experience to Canadians across the country.Fun team, local in Toronto! We are a small elite team in Downtown Toronto. Candidates must be located in the Toronto area.\n      "},
{"role": "Jr. Full Stack JavaScript developer (Ontario Branch)", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Position Title: Jr. Full Stack JavaScript developerReports to: Director, R&amp;DJob Type: Full time, permanentLocation: Brampton, ONAll successful candidates are required to reside within commuting distance of our Brampton, ON office location. Plexxis does not offer remote work opportunities.Salary Range: $61,500 - $148,500SummaryWe're looking for Junior Full Stack developers to mentor and grow into superstars.What You Will DoAs part of the Plexxis web development team, you will…use react + node/express to create user interfaces and backend API calls as part of the ongoing effort to modernize our primary product offeringlearn from more senior team members who direct your day-to-day activitiesmake meaningful contributions to a product that people rely on in their day-to-day business operationsgrow into a strong developer as you build your lifelong career at PlexxisRequirementsYou like peopleYou are focusedYou are supportiveYou are drivenYou like to work in a team but are fine working on your own when the occasion calls for itYou love coding and you love a good challengeYou know some JavaScript basicsYou know some ReactJS basics, AngularJS basics, or VueJS basicsYou know some NodeJS basicsNice to HavePersonal projects that demonstrate your love of developmentDeveloper training of some kind (boot-camp, college, university, etc.)TypescriptOracleDB or any relational database exposure (sql)What's it like working at Plexxis?As Such, We Make It a Point To Provide Each Of Our Employees With The Tools Needed To Do Their Job Well, IncludingThe dress is casual, but our commitment to quality is not. At Plexxis, the working environment is a social one - built on mutual respect and collaboration. We are a team of extremely hard-working individuals who have a steadfast dedication to delivering amazing results to our clients.Competitive SalaryBenefitsCompany gymA games roomPaid after hoursOur team genuinely appreciates each other and there is an authentic camaraderie and support network.About Plexxis SoftwareThe Plexxis Drywall Enterprise Resource Planning (ERP) software maximizes the profit and efficiency of wall &amp; ceiling contractors through expert consulting and a drywall estimating software that unites digital takeoff, costing, construction management, mobile applications and accounting solutions into a single, sophisticated - yet simple system.Since 1999, our sole focus has been dedicated to the wall and ceiling trade – a focus that has brought together an extraordinary wealth of knowledge, experience and expertise. From technology engineers, trainers and consultants, we have assembled the “right” people, the “right” product and the “right” service to deliver solutions unmatched in quality and customer focus.Are you the perfect fit? Do you wish to …Work with a small, tight-knit group of hard-working, dedicated and fun individualsEnjoy the atmosphere of a rapidly growing, high energy company with an entrepreneurial spiritBe on the winning team - poised to emerge as the global leaderBe challenged in the workspace, in the fitness room or even the billiards CaféLose the stuffy environment (and politics) of “big corporate” and focus on delivering what the competition calls “impossible”If you're ready for an exciting career with an industry leader, give us a call to explore your future. Growth. Learning. Opportunity.Disclaimer for all posting locations: We thank all applicants in advance for their interest but advise that only those selected for an interview will be contacted.Plexxis is committed to the principles of diversity and inclusion; encouraging applications from all well qualified applicants. Accommodation is available for applicants, including those with disabilities, throughout the recruitment process.Please Note: If you are offered a position at Plexxis Software, you may be required to agree to a background check.PLEXXIS IS AN EQUAL OPPORTUNITY EMPLOYER\n      "},
{"role": "Backend Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Our company is a rapidly growing technology firm that specializes in developing innovative software solutions for clients across various industries. We take pride in building software that is efficient, scalable, secure, and user-friendly. Our goal is to make a significant impact in the market through cutting-edge technology.We are looking for a Backend Developer to join our team. As a Backend Developer, you will be responsible for designing, developing, and maintaining applications using Nods.js and Google Cloud. The ideal candidate will have a strong background in software development, a solid understanding of web development principles, and a proven track record of working with Node.js / Typescript.Note: Only candidates located within a 3-hour time zone from Toronto, Canada will be considered for this role.What You’ll OwnWriting clean, maintainable, and well-documented code using Node.js/Typescript with express for API’s.Working with google cloud platform to integrate with Cloud services such as cloudSQL (postgres), cloud storage, and appengine. Design and develop new applications and features, ensuring scalability, performance, and security. Demonstrate high-quality software development practices. This includes participation in all aspects of the design and development of the applications: research, ideation, and strategy.Work closely with leadership to understand system requirements and find well-optimized software development solutions in alignment with the production deadlines and goals.Experience And Skills You’ll HaveProven work history of software development with Node.js/Typescript and Express.Strong understanding of Google Cloud Platform.Good understanding of API specifications and documentation.Strong understanding of web development principles, practices, and design patterns. Familiarity with databases and data modeling specifically postgreSQL with Prisma.Capability to write clean, correct, and efficient code.High-quality verbal and written communication skills.Sense of ownership, urgency, and pride in your work.\n      "},
{"role": "Full Stack Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Gadget is making development fun again. We’re building a best-in-class tool for developers to build, deploy, and scale backend applications wildly fast. There’s too much accidental complexity in software development, which means too much time is spent on boring, repetitive, or wasteful tasks. Our mission is to give devs that time back so they can use it to solve real world problems instead .To do this, we need amazing teammates. We're hiring truly incredible people and surrounding them with the right tools, processes, and culture to build, thrive and grow.Our product is different. We’re looking for a Full Stack Engineer who has a bit of experience, is eager to learn, and is drawn to complicated, technical challenges. We also need to be able to rely on each other as we grow this company together.You would:Be an early member of the Gadget team, which means lots of opportunity for helping define the vision and direction of the productPrimarily work with React, Node.js, TypeScript and PostgreSQLBe involved in the development of many core primitives as well as high level features to build out the platformReport directly to the foundersWork with and learn from a team of talented engineers who make developer experience their first priorityFrequently give and accept meaningful feedbackOwn solutions from end to end, managing complexity and engaging directly with stakeholdersDebug production issues across services and multiple levels of the stackUphold Gadget’s high standards for engineering and product qualityWe’re looking for someone who:Has a few years of software development experienceAlready knows or wants to learn deep skills across the entire stackTakes delight in crafting ergonomic abstractions that can scale to meet the needs of most developersWants to work with people who encourage you to do your best work and are invested in your growth and developmentTakes pride in working on projects from ideation to delivery, and enjoy seeing your products being used by customersThrives in an evolving, collaborative environment that values impact over outputWe're excited to meet you!This role is located on-site in Ottawa, Ontario.At Gadget, we value diversity and equity in everything we do. We strongly encourage applications from Indigenous peoples, racialized people, people with disabilities, members of the 2SLGBTQIA+ community, and/or people with intersectional identities. We believe that different perspectives make us better, so please consider applying even if your experience doesn't exactly match the job description. Gadget is committed to fostering an inclusive environment for everyone on our team, and we are happy to discuss any accommodations you may need throughout the hiring process.\n      "},
{"role": "Full Stack Developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Job DescriptionSpringbig is the leading SaaS marketing technology platform serving retailers and brands in the rapidly growing cannabis industry throughout the U.S. and Canada. We serve in excess of 1,000 clients across 2,300 locations and our clients communications using the Springbig platform access more than 37 million consumers making Springbig the leading company in our sector. We have been ranked in the top 100 fastest growing companies in the prestigious Inc.5000 list for two consecutive years, ranking 69th in the recently released 2021 list.Springbig also has its Brands platform - this is also a SaaS platform, and it allows cannabis brands to collaborate with our dispensary clients to send engaging SMS campaigns to the dispensary’s database of consumers. A brand can use this platform to place an advertisement on top of hundreds of thousands of text messages and drive their products’ sell-through like never before! This gives brands direct access to consumers in a way they’ve never had before and an unprecedented reporting on campaign attribution.Our headquarters are in Boca Raton, FL where the majority of our 130 employees are located, and we have additional office locations in Seattle, WA and Toronto, Canada.Position Overview:The Full Stack Developer’s job duties will include producing scalable software solutions as part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. You should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. You should also be a team player with a knack for visual design and utility. If you’re also familiar with Agile methodologies, we’d like to meet you.Roles and Responsibilities:Work with development teams and product managers to ideate software solutionsDesign client-side and server-side architectureBuild the front-end of applications through appealing visual designDevelop and manage well-functioning databases and applicationsWrite effective APIsTest software to ensure responsiveness and efficiencyTroubleshoot, debug and upgrade softwareCreate security and data protection settingsBuild features and applications with a mobile responsive designWrite technical documentationWork with data scientists and analysts to improve softwareRequirements:Proven experience as a Full Stack Developer or similar roleExperience developing web and mobile applicationsExpert knowledge of HTML, CSS, and JavaScript.Expert knowledge of a modern JavaScript Front-End Framework (Vue.JS or React.JS)Expert knowledge of Ruby on Rails or Node.JSExpert knowledge of GIT version control.Solid understanding of databases and fluent in SQL (we use PostgreSQL)Proficient with unit testing (experience with JS frameworks such as Jest or Mocha is preferred)Excellent communication and teamwork skillsGreat attention to detailOrganizational skillsAn analytical mindDegree in Computer Science, Statistics or relevant field preferredOur current stack: Rails, Backbone.js, RSpec, AWSWhat are we looking for in a team member?Your specialization is just as important as your ability to learn fast, communicate and adapt to shifting priorities.We’re especially fond of people who:Communicate well and articulate ideas clearly.Focus on project goals!Contribute ideas.Take initiative. What’s it like to work at springbig?It’s awesome! We’re a driven, passionate, responsible group who values professional growth and work life balance. Why you should work with us:We are a fun start-up, with a start-up culture.Our company is continually growing and always innovating and creating new features for ourselves and our clients.Company atmosphere is collaborative, passionate and fun.Casual dress codeWork with some of the best &amp; brightest technical minds in the industry! We learn from and share knowledge with each other every day.And infuse lightness and creativity into our days:Stocked coffee, snacks and candy “bar”Pizza parties and team lunchesLaser Tag in the officeSpontaneous games of tabletop cornhole or NERF warsCompany sponsored Fantasy Football league and March Madness bracket challenge.Ready to apply?Apply online atPowered by JazzHRjElEBD0tDg\n      "},
{"role": "Web Developer", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        Hey there! We’re Relish, and we create high quality, high value games, websites, and web applications, with a human touch. Check out some our recent projects here: https://reli.shWe’re looking for a Web Developer with full-time availability to support ongoing projects.Who are you?You have four (4) or more years of paid experience (i.e. not side-projects or school projects) as an Intermediate Web Developer building websites and/or web applications from the ground upYou have the ability to take an idea from inception to delivery, writing efficient, readable, well-tested code to accomplish tasks and solve technical problems. You have a proven track record of focusing on hitting deadlines and resolving customer concernsYou’re confident in your creativity and ability, willing to have your ideas built upon, and are pumped to work with design and product teams to create web experiences our clients will loveYou help increase the quality of our code through attention to detail in pull requests and refactoring, and you are a constant learningYou are primarily focused on front-end development (HTML, CSS, Javascript), but are comfortable working with PHP templates, getting into the database a little bit, working with or even creating basic REST api’s. You are full-stack, with a slant towards the presentation layerYou’ve worked extensively with React or Vue.js, you’ve build static websites, worked with a variety of CMS’, are comfortable with Node.jsYou’ve worked on Wordpress websites and know the in’s and out’s of building them - maybe you’ve even regularly used Advanced Custom Fields to build all kinds of custom post typesExperience with any of these is a bonus: Laravel, Typescript, Firebase, Next.js, Cypress/PlaywrightWhat would my day look like?You’ll report to a Project Producer, and work on all aspects of development from the frontend to the backend, in collaboration with designers, DevOps, and QAYou’ll work closely with Senior Web Developers and an Associate Technical Director to bring designs to life using the appropriate tech stack for the projectFrom concept through launch, you’ll dive in and support product development including task time estimation, coding, asset management, testing, and debuggingYou’ll support and help grow our people, processes, and frameworks in ways that benefit everyoneYou’ll participate in code reviews, pair-programming, project reviews, API design reviews, technical reviews of product stories with in-depth yet constructive criticism; and give and take feedbackYeah, I want in! How do we get started?We thought you would. We need to see or read some evidence of your development experience and how you’ve made an impact on other teams. Apply today and your application will be reviewed by a member of our team! Please be sure to include a link to your demo reel in your application!Important to know: This opportunity is only available to those eligible to work in Canada. Our entire team is working fully remotely, but we do have an office space in Toronto, ON &amp; Duncan, BC that you're able to work at if its preferred.\n      "},
{"role": "Full-Stack Software Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        This could be either a remote or hybrid position.eCapital supports small and mid-sized companies throughout the United States, Canada, and the United Kingdom by providing alternative financial solutions like invoice factoring, factoring lines of credit, and asset-based lending to accelerate their access to capital. Through its Commercial Finance and Freight Factoring divisions and its portfolio company Gerber Finance, Inc., eCapital offers capital solutions to 80+ industries. eCapital is an innovative leader in providing flexible, customized cash flow to businesses. We truly love to help our clients grow and this is a position where you can grow too!The Opportunity:eCapital is looking for aFull-Stack Software Developerto design, build and support cloud-native enterprise and consumer solutions. This is an excellent opportunity to be part of acollaborative, creative, and metrics-based team whose goal is to increase performance and revenue for the company.What you will do:Participate in a cross-functional Agile teamDesign system and software architecturesDevelop visually appealing front-end apps by translating UI/UX designs into front-end codeDevelop APIs and servicesDevelop large-scale solutions for data processing and storageDevelop and maintain CI/CD pipelinesAssist with the training and leveraging of custom AI modelsWhat you need:University Degree in Computer Science or Computer EngineeringExperience with end-to-end development of full-stack solutionsExperience with cloud servicesExperience with database technologies such as MSSQL, MySQL, or MongoDBExperience with back-end frameworks such as .NET Core or ExpressExcellent problem-solving skillsExcellent written and verbal communication skillsAbility to work under pressure while meeting deadlinesStrong organizational skillsExceptional attention to detailMust be a team player!What you will get:We are a growing organization that thrives on delivering trusted financial services to help our clients succeed. Joining us will allow you to:Work in a dynamic, collaborative, progressive, and high-performing teamOpportunities to do challenging work and growMake a difference and lasting impact\n      "},
{"role": "Full Stack Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        About SnapliiThe Digital Wallet Snaplii has architected a deep bond between Users and Merchants for more efficient communication. The value-added features include making payments with credit cards and exploring favourite merchants and cash-back cards along with the data-driven marketing solutions that allow us to deliver the best in-store and online shopping experience to Users. The interactive platform also benefits the Merchants with a higher level of brand loyalty. In order to serve more merchants and users, we are expanding our business and adding more new functions, so that Snaplii can become a digital wallet commonly used by people in North America.About The RoleWe are looking for Full Stack Developers to join our development team. You will be responsible for the development of the new product as well as the maintenance of and enhancements to the existing product. The role will effectively communicate with the team to uncover immediate/future needs, will convey those results to our clients in a meaningful way, and will deliver solutions in a proactive, fast-paced, client-service driven development environment.Job LocationOnsite job in MississaugaYou Will:Help execute the product development vision, and assist with the technical landscape for a large-scale constructionWrite maintainable, testable, and performant software in creating the entire platform, end-to-endBuild reusable code and libraries for future useParticipate in code review and performing extensive testing to ensure high-quality softwareImplement services using security mechanism such as OAuth, Single Sign On.Implement data security processes and methods.Clearly document the artifacts to ensure proper knowledge transfer within the team.Build and launch products rapidly and iteratively. We ship to production frequently and have a large, active user base.Integration of the front-end and back-end aspects of the applicationCommunicate clearly and effectively with all members of our teamQualifications And SkillsBachelor’s degree in Computer Science or Computer engineering.3+ years of software development experience, with a focus on NodeJS(Server-side), ReactJS(Client-side) and HTMLExperience both authoring and consuming RESTful APIsExperience with SQL and database designExperience with extensive unit testing experience (preferably using Mocha and Chai)Experience with Git/GitHub and GitHub ActionsExperience with unit/integration/end-to-end/performance testing.Experienced in Agile methodologies.Strong debugging and troubleshooting skillsHas a strong working ethic and obeys the code of conduct. Strictly follow the security and quality assurance procedure.Must be performance-driven and able to work in a fast-paced environment with tight deadlines.Nice to haveExperience with CSS3, SCSS, Flex Box, Bootstrap, Material UIExperience with Next.jsExperience with TypescriptExperience with in-memory cache (Redis)Experience building API using Microservices &amp; Serverless ArchitectureExperience in server management and AWS knowledgeExperience with Java/Spring BootA Fintech background is an asset\n      "},
{"role": "Software Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        There are people who say some ideas are impossible, unattainable, or unrealistic. Then there are those of us who work at Martin Rotary and Mission Systems. As a part of the Martin community, we take on the biggest, baddest challenges in the world and find solutions using creativity and collaboration. And where the solutions don’t exist? We invent them.So, if you’re looking for the challenge of a lifetime and a team of the brightest minds in the world, Rotary and Mission Systems Rotary and Mission Systems, is the place for you. If you’re looking for a place where learning is a way of life, Rotary and Mission Systems is the place for you. And if you’re looking for a career that’s just as fun as it is hard work, well…you know.Join us today and let’s make a difference together.Only here are you Mission Critical!These are just some of the exciting Software Engineering roles available: and/orFull Stack Engineer/Cloud InfrastructureSoftwareSoftware Test EngineerRMS Locations:Moorestown/Mt. Laurel, NJKing of Prussia, PALiverpool/Syracuse, NYOwego, NYOrlando/Palm Beach, FLHuntsville, ALLittleton/Colorado Springs, COManassas, VAAnnapolis Junction/Hanover, MDConnecticutBothell, WAWe Offer 4-Day Work Week Generous relocation packages to help with the move With locations across the US, Martin has endless career growth and development opportunities and your expertise can support the most important work in the nation Comprehensive benefits package that includes health, dental, vision, etc. starting Day 1 Lucrative 401k program Work/ Life Balance with a generous PTO program\n      "},
{"role": "Software Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        By applying for this role you will be considered for enterprise wide opportunities within Lockheed Martin for the same or similar skill set.There are people who say some ideas are impossible, unattainable, or unrealistic. Then there are those of us who work at Lockheed Martin Rotary and Mission Systems. As a part of the Lockheed Martin community, we take on the biggest, baddest challenges in the world and find solutions using creativity and collaboration. And where the solutions don’t exist? We invent them.So, if you’re looking for the challenge of a lifetime and a team of the brightest minds in the world, Rotary and Mission Systems Rotary and Mission Systems, is the place for you. If you’re looking for a place where learning is a way of life, Rotary and Mission Systems is the place for you. And if you’re looking for a career that’s just as fun as it is hard work, well…you know.Join us today and let’s make a difference together.Only here are you Mission Critical!These are just some of the exciting Software Engineering roles available: Java and/or C++ Developer Full Stack Engineer DevOps/DevSecOps Cloud Infrastructure Software Architect Software Test EngineerRMS Locations may include:Moorestown/Mt. Laurel, NJKing of Prussia, PALiverpool/Syracuse, NYOwego, NYOrlando/Palm Beach, FLHuntsville, ALLittleton/Colorado Springs, COManassas, VAAnnapolis Junction/Hanover, MDConnecticutBothel, WAWe Offer 4 Day Work Week Generous Relocation packages to help with the move With locations across the US, Lockheed Martin has endless career growth and development opportunities and your expertise can support the most important work in the nation Comprehensive benefits package that includes health, dental, vision, etc. starting Day 1 Lucrative 401k program Work/ Life Balance with generous PTO program\n      "},
{"role": "Web Developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Design Match is searching for a skilled Web Developer to join our team. As a Web Developer, you will play a crucial role in designing, developing, and maintaining our web presence, ensuring a seamless user experience and delivering high-quality web solutions.ResponsibilitiesCollaborate with cross-functional teams to gather requirements and understand project objectives.Design and implement user interfaces with a focus on aesthetics and functionality.Develop and maintain web applications with a strong emphasis on responsiveness and compatibility.Conduct rigorous testing to ensure optimal performance and identify areas for improvement.Stay updated with the latest web development trends and technologies.RequirementsProven experience as a Web Developer or related role.Proficiency in web development technologies such as HTML, CSS, JavaScript, and front-end frameworks.Understanding of back-end technologies and server-side development (e.g., Node.js, PHP, ASP.NET).Familiarity with content management systems (CMS) is a plus.Excellent problem-solving and communication skills.If you are enthusiastic about creating visually appealing and functional web experiences, we'd love to have you on our team!\n      "},
{"role": "Full stack Developer (React JS, Redux)-Canada", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Role: Full stack Developer (React JS, Redux)Location: Remote/CanadaDuration: 12+ MonthsThey're looking for Frontend heavy with backend experienceFront end: React JS, Redux, GraphQLBackend: Java, Spring bootDatabase: PostgreSQLConcepts: design systems, widgets, plugin, composition patterns, react hooks, caching, infrastructure, error handling, standards on error codes, performance, user interactionsNice to have: React Context (state management).\n      "},
{"role": "Software Engineer - Front End", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        We believe small businesses are at the heart of our communities, and championing them is worth fighting for. We empower small business owners to manage their finances fearlessly, by offering the simplest, all-in-one financial management solution they can't live without.About the Engineering Team:We aim to meaningfully improve the lives of small business owners, who are traditionally under-served and often struggle because of this. At Wave, you won’t just write code—you’ll build high-quality systems at scale. This means being involved in the research, design, and organizational and maintenance practices behind our wide range of applications, which are relied upon by tens of thousands of small business owners. You won’t find many hardcore specialists here. Most Wave engineers are willing and able to dive into different technologies to get the job done. This requires curiosity, openness to new ideas and perspectives, and a genuine interest in what makes software products tick.About The Role:As a Software Engineer in the Front-end domain, you will join one of the many cross-functional engineering teams to work alongside Product, Design and other developers to build software to solve exciting business challenges. You will work with some fantastic engineers to solve tough problems in delivering world-class financial products to our customers at scale. You will bring your front-end skills to bear on making our React and ReactNative apps scale better and stay ahead of these quickly evolving ecosystem, helping the teams around also contribute better code by laying good React/ReactNative standards and building solid interfaces and reusable utilities and libraries that make everyone's lives better. You will be exposed to a wide variety of technologies and help investigate new ones as we are constantly striving to keep our technology choices up to date. As an engineering team, we deeply care about being the best in our craft - Performance, Reliability, Reusability, Code Quality, Test Coverage, and Observability. You will help maintain the current bar we have but will hopefully go on to raise it to the next level.Here’s What You Should Know About Engineering at Wave:Our Technology: Wave is powered by several key technologies. Our web/mobile toolkit where you'll be working is primarily React and ReactNative with Typescript and Javascript. Our APIs are GraphQL and REST powered by services written in Python and Django, as well as Rails and Golang. We expect software developers working on the front-end to have enough familiarity with API development to be able to collaborate with back-end developers to devise solutions to product challenges, and to contribute to code on the API layer when neededYour Work Will Matter: Every engineer at Wave is tasked with solving meaty, meaningful challenges for a really important end-user - our small business owners. The code you write will make a difference, guaranteedWe Are a Community: Wave is about the size of a small neighbourhood. It is possible to get to know everyone on a personal basis. If you’re trying to solve a hard problem that has roots in some other part of the company, odds are pretty good that you’ll find someone close by who can help you outYou Will be Stretched: We’re big on transparency and we know Wave isn’t for everyone. However, if you’re ready to flex your creativity, excel at your craft, fuel your curiosity, and thrive in a dynamic environment, we’re confident you’ll love being a WaverWorking at Wave:Work From Where You Work Best: We will always have a welcoming, energizing, and world-class office (in Toronto) with a space for you. Or, if you’re more comfortable working from home, the choice is yoursWe Care About Future You: You will stretch yourself and you will grow at Wave. You will also be supported on this journey with diverse learning experiences, educational allowances, mentorship, and so much moreWe Support the Full You: We make a serious investment in your health &amp; wellness. When we think about benefits we think about body, mind, &amp; soul and we take this stuff very seriously. We Take Care of the Fundamentals: Fair compensation, all the office perks you’d want, and the various goodies you’d expect from a growing tech company. This is the obvious stuff, but we don’t want you to think we forgot!At Wave, you’re treated like the incredible human being you are.Work From Where You Work Best: We will always have a welcoming, energizing, and world-class office (in Toronto) with a space for you. Or, if you’re more comfortable working from home, the choice is yours.We Care About Future You: You will stretch yourself and you will grow at Wave. You will also be supported on this journey with diverse learning experiences, educational allowances, mentorship, and so much more.We Support the Full You: We make a serious investment in your health &amp; wellness. When we think about benefits we think about body, mind, &amp; soul and we take this stuff very seriously.We Take Care of the Fundamentals: Fair compensation, all the office perks you’d want, and the various goodies you’d expect from a growing tech company. This is the obvious stuff, but we don’t want you to think we forgot!We believe that a diverse and inclusive culture creates the best workplace. We embrace our differences, value individuality, and the broad spectrum of every Waver's skills and abilities. We challenge each other from a place of respect and pursuit of continuous growth. We trust each other and encourage everyone to bring their authentic selves to work, everyday. As Wavers, our voices matter, our opinions are met with an open mind. The best ideas win, no matter whose they are. Contributing to an inclusive culture is a part of all of our job descriptions.We’ve been continuously recognized as one of Canada's Top Ten Most Admired Corporate Cultures and one of Canada’s Great Places to Work in categories including Technology, Millennials, Mental Health, Inclusion and Women.Are you ready to be a Waver? Join us!\n      "},
{"role": "Full-stack developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Our client is looking for a Full-stack developer (front-end &amp; back-end) to join our digital team for designing user interactions on websites, developing servers and databases for website functionality and coding for mobile platforms.The primary responsibility of a Full Stack Developer includes designing user interactions on websites, developing servers and databases for website functionality and coding for mobile platforms.ResponsibilitiesDesign overall architecture of the web applicationDeveloping front end website architectureTranslate Wireframe responsive HTML/CSSBuild interactive web pagesIntegrate with App backendDesigning user interactions on web pagesDeveloping back-end website applicationsImplement authentication and authorizationSet-up backend storage (DynamoDB, RDS) to store user settingsDesign and implement API requests to Data science modelsEnsuring cross-platform optimization for mobile phonesWorking alongside graphic designers for web design featuresEnsuring responsiveness of applicationsExperience working with graphic designers and converting designs to visual elementsUnderstanding and implementation of security and data protection\n      "},
{"role": "Front-end Developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Are you a creative Front-end Developer with a passion for crafting captivating user interfaces? Design Match is searching for a talented individual to join our team. As a Front-end Developer, you will be instrumental in designing and implementing user interfaces for our web applications, ensuring seamless and delightful user experiences.ResponsibilitiesCollaborate with UX designers to translate wireframes and prototypes into interactive web interfaces.Implement responsive and intuitive designs that work seamlessly across various devices.Optimize front-end code for performance and efficiency.Stay updated with the latest front-end technologies and best practices.Conduct code reviews and provide valuable feedback to team members.RequirementsProven experience as a Front-end Developer or related role.Proficiency in HTML, CSS, JavaScript, and front-end frameworks (e.g., React, Angular, or Vue.js).Familiarity with design tools such as Sketch or Adobe XD.Strong understanding of responsive design principles.Excellent problem-solving and communication skills.If you are passionate about creating stunning user interfaces and want to be part of a dynamic team, we encourage you to apply at Design Match!\n      "},
{"role": "Full Stack Engineer", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        Greetings! I'm Bryan, the Chief Technology Officer at Boxhub, where we're building an exciting new online platform for shipping containers. As an engineer at heart, I relish the challenge of tackling complex technical problems. But as a seasoned leader, I also know that the best solutions are often the product of collaborative teamwork. That's why I'm focused on assembling a team of top-notch product squads who will work together to create a suite of innovative products that our customers will adore. And that's where you come in! We're currently seeking a passionate Full Stack Engineer to join our team and help us shape the future of shipping – one container at a time. Together, we can make a meaningful difference in creating a more sustainable world.Our Mission:Boxhub is an e-commerce &amp; logistics startup on a mission to revolutionize the way shipping containers are traded, transported, and used. Shipping containers are becoming the most sustainable and cheapest solution for many storage and building projects. We believe that by giving our customers better access to containers, while improving the inherently broken supply chain, we can generate a substantial positive impact and help save thousands of tons of CO2 per year.Boxhub is well funded by some of the most successful investors in the tech industry, founded by long-term shipping industry experts, and led by award-winning entrepreneurs. We were recently listed by VCs as one of the most promising marketplaces of 2022 and are looking for new team members who are equally passionate about changing an entire industry.Your MissionBuilding web applications using ReactJS, NextJS, NodeJS, Typescript and a MariaDB database on an AWS infrastructureCollaborating closely with Engineers, CTO and Product Management to integrate different systems through APIs and provide a coherent user experience across our sites and tools, adapting to each type of user we work withDesigning and developing back-end services using an API-first approach and REST, following clean code and hexagonal architecture principlesProducing reusable components, playbooks and libraries for future useParticipating in code reviews, sprint planning and retrospectives to develop and maintain a quality codebaseTranslating designs into beautiful user interfaces that offer a coherent and valuable experience for our customers and internal usersMentoring and knowledge sharing with other team members, learning from them tooWhat You Bring to the TableYou’re a Full Stack Engineer with experience shipping multiple features and productsYou have solid Javascript knowledge and are excited to adapt to new frameworks, technologies and toolsYou have the ability to work with distributed systems, APIs, and Relational DatabasesYou understand engineering principles and coding best practices, and you’re able to write clean code with scalability in mindYour communication style is concise, and you’re able to break down technical concepts to non-technical team membersThe Interview Process1: 30-minute Phone screen with Emma Hunt (Head of People and Culture)2: 60-minute Virtual Interview with Bryan McEire (CTO)3: Technical take-home exercise4: 60-minute exercise walkthrough and Q&amp;A with Alejandro Castillo (Head of Engineering) and Nick Chinsen (Senior Full Stack Engineer)5. 30-minute Cultural interview with Max Birner (CEO)5: Reference Check &amp; Offer 🥳 What Boxhub OffersHighly competitive salary depending on experienceStock OptionsFantastic opportunity to help build and grow with a funded company at an early stage4 weeks of annual vacationComprehensive healthcare benefits plan, including dental &amp; vision &amp; spending accountFree access to Maple and Headspace appsA monthly transportation allowanceFlexible working hours in a hybrid environment - we work remotely 2 days a weekJoin a multicultural team that has built successful startups around the worldBoxhub’s Commitment to Diversity, Equity and InclusionAt Boxhub, we believe diversity and representation are key to creating an exciting product and an amazing customer and employee experience. We strongly encourage applications from candidates of all backgrounds, experiences, and perspectives regardless of race, colour, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, Veteran status or any other aspect that makes you, you.Boxhub’s commitment to accessibilityBoxhub is committed to developing an inclusive, barrier-free recruitment process and work environment. Please inform us if you require any accommodation, and we will work with you to meet your accessibility needs. For any accessibility-related assistance, requests for information in accessible alternative formats, or to report any accessibility problems, don't hesitate to get in touch with us at accessibility@boxhub.com\n      "},
{"role": "React Front End Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        As one of Canada’s largest and fastest growing cryptocurrency trading platforms, NDAX has set the bar high for the country’s fintech industry and is constantly leading the way in terms of security and innovation. We are on a mission to empower more Canadians to unlock the full potential of digital finance. To address the various needs in the Canadian cryptocurrency space, NDAX has assembled a multidisciplinary team with diverse backgrounds, including finance, technology, engineering, compliance, marketing, and more.We are proud to have been recognized as one of Canada’s Best Workplaces by Great Place to Work®.We are looking for a React front end developer with headless CMS experience.Position Type: Full Time – PermanentKey Responsibilities (job Description)Developing new user-facing features using React and Headless CMS tools Building reusable components and front-end libraries for future use Translating designs and wireframes into high quality code Optimizing components for maximum performance across a vast array of web capable devices and browsers Creating, installing, and maintaining WP sites as a headless CMS Working closely with designers to push the boundaries of what is possible and help define best practices Integrating with a headless CMS and various APIs to deliver a combination of static and dynamic web experiences RequirementsA proven experience of scaling up products to hundreds of thousands of users while maintaining costs and security of infrastructureThorough understanding of React and its core principles Extensive experience in different web protocols RESTful, WSS, FIX, etc. Experience with different caching mechanisms Experience with different messaging systems/protocols Experience with Jamstack, nextjsAbility to work with common CMS systems and frameworks depending on the need – common platforms like WordPress or Squarespace Familiarity with the WordPress API and GraphQL plugins Knowledge of modern authorization mechanisms, such as JSON Web Token Experience with common front-end development tools such as Babel, Webpack, NPM Ability to understand business requirements and translate them into technical requirements Expert in the life cycle of web page/request Deep understanding of web concepts, requests, responses, headers, security, etc. Degree in computer science or equivalentBenefitsExtended Healthcare Plan (Medical, Disability, Dental &amp; Vision) Life Insurance Paid Time Off Training &amp; Development Opportunities Stock Option Plan Bonus – Awards – Gifts Work From Home – Flexible hour Free snacks and drinks at the office\n      "},
{"role": "Software Developer, New Graduate, 12 month Contract", "seniority_level": "Associate", "employment_type": "\n            Associate\n          ", "job_description": "\n        Change the future with us.Experience@Siemens is an exciting opportunity for new Graduates from college or university to transition from academic to the workplace. Siemens Canada will provide you with practical and meaningful work experience as you start your career journey and help you build business skills. Recent graduates enrolled in this program will be partnered with a mentor and receive one on one coaching and guidance in support of their development and to help navigate their early career. In addition, this program will help students establish contacts and widen their network to excel in their career journey.Why you’ll love working for Siemens!Freedom and a healthy work- life balance– Embrace our flexible work environment with flex hours, telecommuting and digital workspaces.Solve the world’s most significant problems – Be part of exciting and innovative projects.Engaging, challenging, and fast evolving, cutting edge technological environment.Opportunities to advance your career and mentorship programs on a local and global scale.Competitive total rewards package.Profit sharing available.Rewarding vacation entitlement with the opportunity to buy and sell your vacation depending on your lifestyle.Contribute to our social responsibility initiatives focused on access to education, access to technology and sustaining communities and make a positive impact on the community.Participate in our celebrations, social events and offsite business events.Opportunities to contribute your innovative ideas and get paid for them!Employee perks and discounts.Diversity and inclusivity focused.Siemens is proud to be an eight-time award winner of Canada’s Top 100 Employers, Canada’s Greenest Employers 2022, Canada’s Top Employers for Young People 2023 and Greater Toronto's Top Employers 2022.About Siemens RuggedcomRuggedcom is a leader in the development of rugged communication networking solutions designed for mission critical applications in harsh environments. We are an innovative, rapidly growing company where you'll find an exciting, dynamic work environment and significant opportunity for personal growth.What You Will DoWe are currently looking for a Software Developer/Engineer for our Concord office who would report directly to the Manager of Software Engineering; someone with good analytical skills, can multi-task on various projects, a good problem solver and has good organizational skills.More specifically you will:Contribute to the entire life cycle of product development including specifications, design, coding, test, production and maintenanceDevelop software codes in C/C++Participate actively in development projects, both hardware and software component selection and developing technology for future productsBe a part of a team that brings advanced telecommunications products to marketWhat You Will BringDegree in Computer Science/ Engineering/ Mathematics or related disciplinesExperience with Linux operating system and environmentProgramming skills in C / C++ and Bash programming in a Linux environment (user and kernel space)Experience in developing or modifying and integrating open-source projects (OSS)Experience developing with POSIX threadsExperience with TCP/IP and socket programmingSoftware source control tools such as Git, Subversion, etc.Assets:Experience working on Linux for embedded devicesExperience with AngularExposure to Databases/data modellingAbout Siemens Canada:We share our ideas and champion the people behind them.For over 110 years, Siemens Canada has stood for engineering excellence, innovation, quality and reliability. Siemens Canada is a technology leader providing comprehensive solutions for Smart Infrastructure and Digital Industries. We make real what matters by setting the benchmark in the way we electrify, automate and digitalize the world around us. Ingenuity drives us and what we create together in yours.Making a difference together we raised $$385,000 towards charitable contributions, support over 38 non-profit organizations and planted 660 trees in our local communities. Siemens Canada has 2,500 employees from coast-to-coast and 24 office and production facilities across Canada. Join our team of approximately 293,000 talented professionals in more than 190 countries/regions and help us tackle the most exciting challenges to build a successful future together. So, what are you waiting for? Take your next career step with us.To learn more about Siemens Canada, visit our website at www.siemens.caWhile we appreciate all applications we receive, we advise that only candidates under consideration will be contacted.Siemens is committed to creating a diverse environment and is proud to be an equal opportunity employer. Upon request, Siemens Canada will provide reasonable accommodation for disabilities to support participation of candidates in all aspects of the recruitment process. All qualified applicants will receive consideration for employment.By submitting personal information to Siemens Canada Limited or its affiliates, service providers and agents, you consent to our collection, use and disclosure of such information for the purposes described in our Privacy Code available at www.siemens.ca.Siemens s’engage à créer un environnement diversifié et est fière d’être un employeur souscrivant au principe de l’égalité d’accès à l’emploi. Sur demande, Siemens Canada prendra des mesures d’accommodement raisonnables pour les personnes handicapées, dans le but de soutenir la participation des candidats dans tous les aspects du processus de recrutement. Tous les candidats qualifiés seront pris en considération pour ce poste.En transmettant des renseignements personnels à Siemens Canada limitée ou à ses sociétés affiliées, à ses fournisseurs de services ou à ses agents, vous nous autorisez à recueillir, à utiliser et à divulguer ces renseignements aux fins prévues dans notre Code de protection de la confidentialité, que vous pouvez consulter au www.siemens.ca.\n      "},
{"role": "Software Developer", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        In the role of Software Developer, you’ll help create and build beautiful software that matters using modern JavaScript and software development best practices. As a developer for Rangle.io, you’ll be joining a diverse community of people who are passionate about modern software development and its ability to change the world. You’ll get to work on a wide range of projects, using the latest JavaScript frameworks and cloud solutions building for the web &amp; mobile, working with a tight-knit team of talented and passionate individuals.Your ImpactOpportunity to work with one of the most exciting modern software development companies in the worldPlay a big part in the success of Rangle.io. We’re helping shape the Tech scene in Toronto and Amsterdam ; modern web and mobile development across the worldYour GrowthIn the role of Software Developer, you’ll help create and build beautiful software that matters using modern software development best practices (Agile, TDD, Continuous Delivery). As a developer for Rangle.io, you’ll be joining a diverse community of people who are passionate about modern JavaScript and its ability to change the world. You’ll get to work on projects, using the latest JavaScript frameworks building for the web &amp; mobile, working with a tight-knit team of talented individualsHow We WorkWe work with modern JavaScript across a range of frameworks and technologies, on the client as well as on the server: Angular, React, Vue, NodeJS, TypeScript, ES6, Babel, ReduxOur approach to making software stresses teamwork and close interaction with our clients. We rely on a well thought-out process based on Scrum, continuous delivery, and test-driven development. This process allows us to build software in a way that sets you up for success, allowing you to exercise your creativity and building software that matters without all the red tape, hierarchy and politicsWe avoid sharply defined roles: everyone gets to partake in all aspects of their project and to try their hand at new things. Our developers do not just develop: they also help our clients think through product features, contribute to design, and testWe work for many clients in an exciting range of industries: social media, e-commerce, manufacturing, transportation, alternative energy, wellness. Any company that we feel helps make the world a better placeDetails About Your RoleSolid understanding of JavaScript. (Alternatively: really solid backend experience + some JavaScript + ability to learn JavaScript really fast.)5+ years experience in web application development, bonus points if you have experience working directly with clients or a product ownerExperience with Angular is preferred Bonus points if you have previous experience building apps in VueGreat interpersonal skills - we are a close knit team and work together to solve problemsA desire to follow a software development process that helps you sleep better at nightBonus points if you have server side experienceBonus points if you have an eye for design. (BTW, all our designers can code.)Great problem solver and ability to reinvent oneself - We are always looking at ways we can do things better, sometimes there is no path to followProactive and self starter - we hire folks that have a deep desire to do better and be better, you won’t be micromanaged in this role. (We want to hear your voice.)Passionate about learning - You’ll help identify new technologies and approaches to problems. (Web development and especially JS is always evolving.)Headquartered in Toronto, Canada, Rangle.io is changing how our clients innovate. We take great ideas and apply strategy, design, and technology to bring them to life. Rangle is a scale-up that began as a leading modern JavaScript shop, and has transformed into a digital consultancy that partners with enterprises to create modern digital experiences AND the digital engine to efficiently evolve and scale them. Working directly with clients’ teams, Rangle’s experts help shape the way leading companies deliver and evolve their digital products and experiences.While focusing on doing the right thing, we adopt an atmosphere of creativity, belonging, and fun. Ranglers are curious, brave, kind, and innovative. Together we build experiences that make an impact on the world. Come join us.Rangle is an equal opportunity employer committed to creating a safe, diverse and inclusive environment. We encourage qualified applicants of all backgrounds including ethnicity, religion, disability status, gender identity, sexual orientation, family status, age, nationality, and education levels to apply. If you are contacted for an interview and require accommodation during the interviewing process, please let us know.\n      "},
{"role": "Software Developer – JavaScript & Python", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        About Us:Messagepoint is a privately-owned, PE-funded software company headquartered in Toronto, Ontario. We enable large enterprises to deliver enhanced customer experiences and achieve a better bottom line by optimizing their omni-channel customer communications.Our award-winning platform gives non-technical business users such as marketers, CX teams and product owners intelligent control over the content in customer communications to achieve unparalleled personalization, relevancy, brand consistency, and compliance. Only Messagepoint harnesses AI-powered Content Intelligence to automate and simplify the process of migrating, optimizing, authoring and managing business-critical on-demand, interactive and batch communications across all platforms and channels.Founded in 1998 as Prinova, Messagepoint has grown from its beginnings as a top global Customer Communications Management (CCM) integrator, to become a leader in the space due to our unique ability to intelligently manage content.SummaryWe are currently looking for a highly skilled and motivated Software Developer to join our Healthcare team. As a key member of the team, you will be responsible for creating innovative solutions and working with data at scale. In addition to JavaScript and Python development, this role requires the ability to gather requirements, design and architect solutions, and take ownership of projects. You will collaborate with a highly technical team to deliver cutting-edge solutions in the Healthcare industry.Responsibilities:Gather requirements from stakeholders and translate them into technical specifications.Design and architect scalable and fault-tolerant solutions using AWS distributed computing and storage components.Develop new components and enhance existing functionality for our Healthcare Touchpoint Exchange.Design and implement software solutions using JavaScript and Python.Model and develop data structures using JSON, XML, and databases.Take ownership of projects, ensuring timely delivery and meeting project requirements.Collaborate with cross-functional teams to define overall concepts for new product features and components.Continuously optimize and improve the performance and scalability of the software solutions.Qualifications: Bachelor’s Degree in Computer Science, Computer Engineering, or a related field.3+ years of experience in JavaScript and Python development.Experience with other programming languages is a plus.Strong experience in gathering requirements, designing, and architecting software solutions.Proficient in using GitHub/Gitlab for project collaboration and managing source code.Experience with distributed computing and storage systems is required.Demonstrated ability to solve complex problems in fast-paced environments.Excellent communication skills and the ability to articulate complex ideas and concepts.Strong time management skills with a proven ability to prioritize and meet strict deadlines.Self-driven and motivated to learn and improve.Prior experience with Medicare Advantage benefits is a plus.Messagepoint is an Equal Opportunity Employer and encourages diversity and inclusion in the workplace.We thank you for your interest, however, only those who qualify for an interview will be contacted.Powered by JazzHRkoUHVECX2C\n      "},
{"role": "Frontend Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Nightfall makes safeguarding sensitive data for every application simple and seamless. Organizations, from startups to global brands, trust Nightfall's software platform and APIs to discover, classify, and protect sensitive data.As a Frontend Engineer at Nightfall, you will be leading interesting UI and visualization projects that are critical to the company and its mission to protect personal data.ResponsibilitiesBuild reliable, scalable and performant user experiences using modern tools like React, TypeScript, Jest and WebpackHelp define a scalable front-end architecture, advise other teams internally and also encourage best practicesProvide technical leadership to more junior engineers on your teamGet problem statements from designers and product managers, break projects into substantial tasks, and deliver the project with metrics and data with fellow engineersQualifications3+ years of industry web frontend development experience with modern JavaScript tooling (React, Redux or equivalent, and so on)Strong understanding of HTML, CSS, JavaScript, and related web technologiesExperience working with react or node.js applicationsExperience with unit and integration testingGood written, verbal communication skillsGreat team playerTools We UseGoGraphQLNode.jsReactPythonCassandraRedisTerraformDockerKubernetesAWSKafkaEnvoyAbout Nightfall:Nightfall is a cybersecurity startup dedicated to helping organizations secure and manage their sensitive data. As a leading enterprise technology company, our product affects the personal data that people entrust businesses to store &amp; process with care every day. Critical data in modern organizations is often sprayed across a broad set of cloud data silos, and it's a herculean task for security &amp; compliance teams to monitor, manage, and protect this highly sensitive data. Via machine learning, our product makes it easy for organizations to discover, classify, and protect this sensitive data across their cloud footprint - such as their corporate SaaS, data infrastructure, and even their own apps. In doing so, we prevent data leakage, provide unprecedented data visibility &amp; protection across the cloud, and enable compliance. We're a technology startup founded in San Francisco, well-funded by leading institutional investors like Bain and Venrock, and a cadre of security &amp; IT leaders from Okta, Salesforce, Atlassian, Splunk, FireEye, and more. Learn more on our website www.nightfall.ai or by reaching out via email at careers@nightfall.ai.\n      "},
{"role": "Junior React Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Our client a digital transformation technology company with a proven track record in solving complex problems for the finance, telecommunications, and construction industries is actively seeking to hire a fulltime permanent Junior React Developer to work in a hybrid role.Role OverviewWe are seeking a skilled and motivated Front-End React Developer to join our team and help us build engaging and intuitive web applications. As a Front-End React Developer, you will collaborate closely with our design and back-end teams to implement user interfaces that meet our clients' needs and elevate the overall user experience. You will play a crucial role in translating design mockups and wireframes into responsive and functional web interfaces.What Will You DoDevelop and implement user interfaces for web applications using React.js and related technologies.Collaborate with designers and back-end developers to ensure seamless integration of front-end and back-end components.Optimize web applications for maximum speed and scalability.Ensure the technical feasibility of UI/UX designs and provide input on design feasibility and potential enhancements.Participate in code reviews and provide constructive feedback to team members.Stay up-to-date with the latest industry trends and technologies to continually improve our development processes and outcomes.Troubleshoot and debug issues as they arise and propose solutions to maintain application quality.Actively participate in brainstorming sessions and contribute creative ideas to enhance the user experience. What Will You BringBachelors Degree in Computer Science with 1-2 years of industry experience Proficient in React.js and its core principles.Strong understanding of JavaScript (ES6+), HTML5, and CSS3.Experience with responsive and mobile-first web development.Familiarity with RESTful APIs and asynchronous request handling.Solid understanding of version control systems, preferably Git.Experience with front-end build tools and preprocessors such as Webpack, Babel, SASS/LESS.Ability to work collaboratively in a team environment.Excellent problem-solving skills and attention to detail.Strong communication skills and the ability to explain technical concepts to non-technical team members.Experience with testing and debugging tools.Bonus: Knowledge of UX/UI design principles and practices.Bonus: Familiarity with back-end technologies and frameworks.\n      "},
{"role": "Software Engineering, New Grad", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Who we areAbout StripeStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.About The TeamStripe offers an interesting middle ground between joining a small startup and going to work for a multinational company. We have systems and processes optimized for early-career professionals. You will be in an environment that prizes rigor, discipline, and reliability—from our products, from our ways of working, and from our colleagues. You will learn how the best teams put together extremely reliable systems, and you will be responsible for operating these systems, with adequate backup when things get tough.What you’ll doAs a company, we believe in end-to-end ownership of projects. For any given project, we have one person on point. While they don't necessarily have to do all the work themselves, it's their job to make sure all the work gets done. We launch betas and prototypes as early as we can. This helps ensure that we're building what users actually want. We contribute back to the community, often by building things we think are cool and by releasing open-source software.ResponsibilitiesWork on cross-functional projects, directly collaborating with other engineersGive meaningful feedback on code reviews and technical designsEnsure that the systems your team operates continue running well and can scale to meet the needs of our usersBuild the skills to own a project from beginning to end, learning project management and technical leadership skillsWho you areWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.Minimum RequirementsA Bachelor’s, Master’s, or PhD degree in computer science or a directly related field, obtained by summer 2024, or equivalent work experienceSome experience and familiarity with programming, either through side projects or classwork. We work mostly in Java, Ruby, JavaScript, Scala, and Go. We believe new programming languages can be learned if the fundamentals and general knowledge are presentExperience from either previous internships or working collaboratively on multi-person coding projects (in a university or professional setting)Ability to learn unfamiliar systems and form an understanding of those systems, through independent research and working with a mentor and subject matter expertsPreferred QualificationsOne or more areas of specialized knowledge balanced with general skills and knowledge, such as knowing more frontend technologies and, at a high level, how a service handles an HTTP requestExperience in code review practices, and an understanding of how to safely update production systemsFamiliarity with navigating and managing work in large code bases\n      "},
{"role": "Software Engineer ( All Levels)", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Job DescriptionAt Warner Music Group, we’re a global collective of music makers and music lovers, tech innovators and inspired entrepreneurs, game-changing creatives and passionate team members. Here, we know that each talent makes our collective bolder and brighter. We are guided by four core principles that underpin everything we do across all our diverse businesses:Music is Everything: Music is our passion, and we can never get enough. Tastes, trends, and tech will change, but great artists and songwriters will always be our driving force.Global Growth, Local Expertise: Music is a global language. Through communication and collaboration, our success can come from anywhere and translate everywhere.Innovation and Insight: Pushing the boundaries requires the best information and the boldest imagination. We use both to create the future.Empowered by People: Like the artists we serve and the music they make, our differences make us stronger. This is a place where every talent can belong and build a career.Technology is one of the most important parts of our business. Whether it’s signing up new artists; ensuring we provide the right data to Spotify, YouTube, and other digital service providers; or helping artists use the latest AI tools and make thoughtful decisions with data-driven insights – technology plays an invaluable role in our success. The engineering team at Warner Music Group makes all of it a reality.We are actively hiring for multiple engineering positions in Toronto, which include:Junior Engineers Senior Engineers Staff+ EngineersWe remain committed to Diversity, Equity, and Inclusion. We know it fosters a culture where you can truly belong, contribute, and grow. We encourage applications from people of any age, gender identity, sexual orientation, race, religion, ethnicity, disability, veteran status, and any other characteristic or identity.Job Title: Software Engineer (all levels) Your RoleOwning, defining the technical vision, and driving innovation for key technical systemsMentoring for junior engineers and mentorship opportunities for senior engineersCollaborating closely with key music industry stakeholders as well as colleagues in NYC, Los Angeles, and LondonHere You’ll Get ToReimagine and implement the future of tech for the music industry Work as part of a dynamic and highly effective team Own the creation and delivery of highly innovative products Learn and grow as a professional through close collaboration with your team members and engineering leaders, and by being part of culture of continuous improvement and learningAbout YouYou’re a curious learner with a desire to grow and contribute to a positive team environment You have a high sense of ownershipYou’re able to deal with ambiguity and working in a fast-paced, evolving environmentYour bias is towards action, and you always find ways to deliver better solutions more efficientlyYou’re an empathetic team member who works well in a team environment and communicates effectivelyYou’re excited about the music business: helping artists and songwriters grow and helping the world hear more great musicYou have a Bachelor’s degree in a relevant discipline or equivalent professional experienceAbout UsWith a legacy extending back over 200 years, Warner Music Group (WMG) today brings together artists, songwriters and entrepreneurs that are moving entertainment culture across the globe. Operating in more than 70 countries through a network of affiliates and licensees, WMG’s Recorded Music division includes renowned labels such as Atlantic, Elektra, and Warner Records. WMG’s music publishing arm, Warner Chappell Music, has a catalog of more than 1.4 million musical compositions spanning every musical genre, from the standards of the Great American Songbook to the biggest hits of the 21st century.Together, we are Warner Music Group: Music With Vision &amp; Voice.Love this job and want to apply?Click the “Apply” link at the top of the page, or apply directly with your LinkedIn. Applying with LinkedIn will import all of the information you put in your profile, but will still allow you to upload a resume and cover letter.Don’t be discouraged if you don’t hear from us right away. We’re taking our time to review all resumes, and to find the best people for WMG.Thanks for your interest in working for WMG. We love it here, and think you will, too.\n      "},
{"role": "Software Developer (All Levels Welcome)", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Description                            As a Software Developer at CBN you play an integral part in making the world a more secure place as you develop customized solutions that we design for governments around the globe. Problem solvers will thrive in this role as you will be continually challenged by the complexity and uniqueness of each customer’s system and its inherent requirements.  If you are looking for a challenge, you will find it at CBN as you work on high-profile, complex immigration, identity management and motor vehicle information systems. You’ll get to work on a variety of leading-edge secure technologies as well as be exposed to variety of contemporary languages and other development tools.  What We Can Offer You Compensation: We seek long term relationships with our employees and recognize and reward them with a competitive total compensation package that includes:An industry leading defined contribution pension plan with company matching contributions (up to 5%) and payment of service fees,Best-in-class health, medical and life insurance benefits.Access to virtual and telehealth services and apps; andVery progressive fertility, adoption, and surrogacy benefits to support all definitions of family. Career: As a knowledge-based organization we will provide you with a wealth of learning opportunities and challenging work that will grow your knowledge, skills and abilities. At CBN, we encourage and empower our employees to chart their own career path, putting you in control of your future. Culture: Personal character is the foundation of our culture. CBN’s 7 Core Principles shape and guide our behaviours and underpin the sense of community you will experience at CBN. Equality, diversity, and inclusivity are important to us as an organization, and we are committed to fostering and developing a work environment where every employee is treated with dignity and respect. What You Will DoAs part of a cross-functional team (DBA’s, Testers, Developers and Project Managers), you will participate in the creation of desktop and web application systems from conception to launch. Taking direction from a Project Lead, you will:         Participate and or design in the functionality (remember our customized systems) based on a systems requirement document.        Write code! Following design CBN coding standards during the development lifecycle.        Write automated unit tests to validate the code is doing what it’s designed for and saving effort for subsequent manual testing.        integrate code with 3rd party software or legacy systems, deploying components to a shared environment to ensure system interoperability.        Support and maintain release code by fixing bugs, as part of the long-term support of the systems Minimum Qualifications Skills and AbilitiesExperience developing on at least one of Windows or Linux (and both is preferable)Experience developing software systems using at least one of Java, C++, or C# (and all    three is preferable)Experience interacting with RDBMS environments using SQLKnowledge of SOAP, xmlrpc, and/or Spring frameworksExperience with source control and build tools, especially Git, Subversion, Maven, and the Atlassian suite (Bamboo, Jira, Confluence)Experience with Oracle and/or PostgreSQL RDBMSExperience with web UI frameworks, especially Angular and/or Vaadin Soft Skills        Self-directed learner        Attention to detail, with a flare of creativity        A passion for helping people        Expert organizational skills        Good judgement to know what is important Mandatory RequirementsTravel to some customer sites to install hardware and infrastructure (Of course only when it’s safe!)About Us CBN designs and develops industry leading solutions for the following domains: Border Security, Civil Identity, Driver Identification and Vehicle Information, Currency and Excise Control, and Lottery and Charitable Gaming. To learn more, visit www.cbnco.com. As an Equal Opportunity Employer, Canadian Bank Note Company, Limited is committed to achieving a skilled workforce that reflects the diversity of the Canadian population. We encourage applications from women, visible minorities, people with disabilities and Aboriginal people. Canadian Bank Note Company Limited is committed to developing inclusive, barrier-free selection processes and work environments. If contacted regarding this competition, please advise the interview coordinator of any accommodation measures you may require.   \n      "},
{"role": "Frontend Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        What we're looking forWe are looking for a front end developer! Phoenix is a Y Combinator backed startup based in downtown Toronto. You’ll work closely with the cofounders to continue to build out the patient side of our platform. We are looking for a passionate, mission-driven developer who takes pride in the products they build.QualificationsHave 3+ years of professional programming experienceCreating software features that are robust, reliable, and user-friendly for our customersExperience developing software for the Web platform, including cross-browser compatibilityCreating software features that are robust, reliable, and user-friendly for both internal teams and our customersExperience with modern tools like ES6, React, Redux, Apollo, Flux &amp; WebpackGood eye for design and ability to make product decisions.You care about men’s health and have a personal connection to the spaceWhy work with Phoenix?Impact &amp; autonomy. You’ll report directly to the founders who are both senior devs and you'll have a real opportunity to build Phoenix's productCool tools! We use some great software and platforms to deliver the best in care. Need something to make your job easier? We'll work with you to make it happen!Rewarding Mission. We're delivering the best healthcare experience to Canadians across the country.Fun team, local in Toronto! We are a small elite team in Downtown Toronto. Candidates must be located in the Toronto area.\n      "},
{"role": "Jr. Full Stack JavaScript developer (Ontario Branch)", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Position Title: Jr. Full Stack JavaScript developerReports to: Director, R&amp;DJob Type: Full time, permanentLocation: Brampton, ONAll successful candidates are required to reside within commuting distance of our Brampton, ON office location. Plexxis does not offer remote work opportunities.Salary Range: $61,500 - $148,500SummaryWe're looking for Junior Full Stack developers to mentor and grow into superstars.What You Will DoAs part of the Plexxis web development team, you will…use react + node/express to create user interfaces and backend API calls as part of the ongoing effort to modernize our primary product offeringlearn from more senior team members who direct your day-to-day activitiesmake meaningful contributions to a product that people rely on in their day-to-day business operationsgrow into a strong developer as you build your lifelong career at PlexxisRequirementsYou like peopleYou are focusedYou are supportiveYou are drivenYou like to work in a team but are fine working on your own when the occasion calls for itYou love coding and you love a good challengeYou know some JavaScript basicsYou know some ReactJS basics, AngularJS basics, or VueJS basicsYou know some NodeJS basicsNice to HavePersonal projects that demonstrate your love of developmentDeveloper training of some kind (boot-camp, college, university, etc.)TypescriptOracleDB or any relational database exposure (sql)What's it like working at Plexxis?As Such, We Make It a Point To Provide Each Of Our Employees With The Tools Needed To Do Their Job Well, IncludingThe dress is casual, but our commitment to quality is not. At Plexxis, the working environment is a social one - built on mutual respect and collaboration. We are a team of extremely hard-working individuals who have a steadfast dedication to delivering amazing results to our clients.Competitive SalaryBenefitsCompany gymA games roomPaid after hoursOur team genuinely appreciates each other and there is an authentic camaraderie and support network.About Plexxis SoftwareThe Plexxis Drywall Enterprise Resource Planning (ERP) software maximizes the profit and efficiency of wall &amp; ceiling contractors through expert consulting and a drywall estimating software that unites digital takeoff, costing, construction management, mobile applications and accounting solutions into a single, sophisticated - yet simple system.Since 1999, our sole focus has been dedicated to the wall and ceiling trade – a focus that has brought together an extraordinary wealth of knowledge, experience and expertise. From technology engineers, trainers and consultants, we have assembled the “right” people, the “right” product and the “right” service to deliver solutions unmatched in quality and customer focus.Are you the perfect fit? Do you wish to …Work with a small, tight-knit group of hard-working, dedicated and fun individualsEnjoy the atmosphere of a rapidly growing, high energy company with an entrepreneurial spiritBe on the winning team - poised to emerge as the global leaderBe challenged in the workspace, in the fitness room or even the billiards CaféLose the stuffy environment (and politics) of “big corporate” and focus on delivering what the competition calls “impossible”If you're ready for an exciting career with an industry leader, give us a call to explore your future. Growth. Learning. Opportunity.Disclaimer for all posting locations: We thank all applicants in advance for their interest but advise that only those selected for an interview will be contacted.Plexxis is committed to the principles of diversity and inclusion; encouraging applications from all well qualified applicants. Accommodation is available for applicants, including those with disabilities, throughout the recruitment process.Please Note: If you are offered a position at Plexxis Software, you may be required to agree to a background check.PLEXXIS IS AN EQUAL OPPORTUNITY EMPLOYER\n      "},
{"role": "Backend Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Our company is a rapidly growing technology firm that specializes in developing innovative software solutions for clients across various industries. We take pride in building software that is efficient, scalable, secure, and user-friendly. Our goal is to make a significant impact in the market through cutting-edge technology.We are looking for a Backend Developer to join our team. As a Backend Developer, you will be responsible for designing, developing, and maintaining applications using Nods.js and Google Cloud. The ideal candidate will have a strong background in software development, a solid understanding of web development principles, and a proven track record of working with Node.js / Typescript.Note: Only candidates located within a 3-hour time zone from Toronto, Canada will be considered for this role.What You’ll OwnWriting clean, maintainable, and well-documented code using Node.js/Typescript with express for API’s.Working with google cloud platform to integrate with Cloud services such as cloudSQL (postgres), cloud storage, and appengine. Design and develop new applications and features, ensuring scalability, performance, and security. Demonstrate high-quality software development practices. This includes participation in all aspects of the design and development of the applications: research, ideation, and strategy.Work closely with leadership to understand system requirements and find well-optimized software development solutions in alignment with the production deadlines and goals.Experience And Skills You’ll HaveProven work history of software development with Node.js/Typescript and Express.Strong understanding of Google Cloud Platform.Good understanding of API specifications and documentation.Strong understanding of web development principles, practices, and design patterns. Familiarity with databases and data modeling specifically postgreSQL with Prisma.Capability to write clean, correct, and efficient code.High-quality verbal and written communication skills.Sense of ownership, urgency, and pride in your work.\n      "},
{"role": "Full Stack Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Gadget is making development fun again. We’re building a best-in-class tool for developers to build, deploy, and scale backend applications wildly fast. There’s too much accidental complexity in software development, which means too much time is spent on boring, repetitive, or wasteful tasks. Our mission is to give devs that time back so they can use it to solve real world problems instead .To do this, we need amazing teammates. We're hiring truly incredible people and surrounding them with the right tools, processes, and culture to build, thrive and grow.Our product is different. We’re looking for a Full Stack Engineer who has a bit of experience, is eager to learn, and is drawn to complicated, technical challenges. We also need to be able to rely on each other as we grow this company together.You would:Be an early member of the Gadget team, which means lots of opportunity for helping define the vision and direction of the productPrimarily work with React, Node.js, TypeScript and PostgreSQLBe involved in the development of many core primitives as well as high level features to build out the platformReport directly to the foundersWork with and learn from a team of talented engineers who make developer experience their first priorityFrequently give and accept meaningful feedbackOwn solutions from end to end, managing complexity and engaging directly with stakeholdersDebug production issues across services and multiple levels of the stackUphold Gadget’s high standards for engineering and product qualityWe’re looking for someone who:Has a few years of software development experienceAlready knows or wants to learn deep skills across the entire stackTakes delight in crafting ergonomic abstractions that can scale to meet the needs of most developersWants to work with people who encourage you to do your best work and are invested in your growth and developmentTakes pride in working on projects from ideation to delivery, and enjoy seeing your products being used by customersThrives in an evolving, collaborative environment that values impact over outputWe're excited to meet you!This role is located on-site in Ottawa, Ontario.At Gadget, we value diversity and equity in everything we do. We strongly encourage applications from Indigenous peoples, racialized people, people with disabilities, members of the 2SLGBTQIA+ community, and/or people with intersectional identities. We believe that different perspectives make us better, so please consider applying even if your experience doesn't exactly match the job description. Gadget is committed to fostering an inclusive environment for everyone on our team, and we are happy to discuss any accommodations you may need throughout the hiring process.\n      "},
{"role": "Full Stack Developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Job DescriptionSpringbig is the leading SaaS marketing technology platform serving retailers and brands in the rapidly growing cannabis industry throughout the U.S. and Canada. We serve in excess of 1,000 clients across 2,300 locations and our clients communications using the Springbig platform access more than 37 million consumers making Springbig the leading company in our sector. We have been ranked in the top 100 fastest growing companies in the prestigious Inc.5000 list for two consecutive years, ranking 69th in the recently released 2021 list.Springbig also has its Brands platform - this is also a SaaS platform, and it allows cannabis brands to collaborate with our dispensary clients to send engaging SMS campaigns to the dispensary’s database of consumers. A brand can use this platform to place an advertisement on top of hundreds of thousands of text messages and drive their products’ sell-through like never before! This gives brands direct access to consumers in a way they’ve never had before and an unprecedented reporting on campaign attribution.Our headquarters are in Boca Raton, FL where the majority of our 130 employees are located, and we have additional office locations in Seattle, WA and Toronto, Canada.Position Overview:The Full Stack Developer’s job duties will include producing scalable software solutions as part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. You should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. You should also be a team player with a knack for visual design and utility. If you’re also familiar with Agile methodologies, we’d like to meet you.Roles and Responsibilities:Work with development teams and product managers to ideate software solutionsDesign client-side and server-side architectureBuild the front-end of applications through appealing visual designDevelop and manage well-functioning databases and applicationsWrite effective APIsTest software to ensure responsiveness and efficiencyTroubleshoot, debug and upgrade softwareCreate security and data protection settingsBuild features and applications with a mobile responsive designWrite technical documentationWork with data scientists and analysts to improve softwareRequirements:Proven experience as a Full Stack Developer or similar roleExperience developing web and mobile applicationsExpert knowledge of HTML, CSS, and JavaScript.Expert knowledge of a modern JavaScript Front-End Framework (Vue.JS or React.JS)Expert knowledge of Ruby on Rails or Node.JSExpert knowledge of GIT version control.Solid understanding of databases and fluent in SQL (we use PostgreSQL)Proficient with unit testing (experience with JS frameworks such as Jest or Mocha is preferred)Excellent communication and teamwork skillsGreat attention to detailOrganizational skillsAn analytical mindDegree in Computer Science, Statistics or relevant field preferredOur current stack: Rails, Backbone.js, RSpec, AWSWhat are we looking for in a team member?Your specialization is just as important as your ability to learn fast, communicate and adapt to shifting priorities.We’re especially fond of people who:Communicate well and articulate ideas clearly.Focus on project goals!Contribute ideas.Take initiative. What’s it like to work at springbig?It’s awesome! We’re a driven, passionate, responsible group who values professional growth and work life balance. Why you should work with us:We are a fun start-up, with a start-up culture.Our company is continually growing and always innovating and creating new features for ourselves and our clients.Company atmosphere is collaborative, passionate and fun.Casual dress codeWork with some of the best &amp; brightest technical minds in the industry! We learn from and share knowledge with each other every day.And infuse lightness and creativity into our days:Stocked coffee, snacks and candy “bar”Pizza parties and team lunchesLaser Tag in the officeSpontaneous games of tabletop cornhole or NERF warsCompany sponsored Fantasy Football league and March Madness bracket challenge.Ready to apply?Apply online atPowered by JazzHRjElEBD0tDg\n      "},
{"role": "Web Developer", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        Hey there! We’re Relish, and we create high quality, high value games, websites, and web applications, with a human touch. Check out some our recent projects here: https://reli.shWe’re looking for a Web Developer with full-time availability to support ongoing projects.Who are you?You have four (4) or more years of paid experience (i.e. not side-projects or school projects) as an Intermediate Web Developer building websites and/or web applications from the ground upYou have the ability to take an idea from inception to delivery, writing efficient, readable, well-tested code to accomplish tasks and solve technical problems. You have a proven track record of focusing on hitting deadlines and resolving customer concernsYou’re confident in your creativity and ability, willing to have your ideas built upon, and are pumped to work with design and product teams to create web experiences our clients will loveYou help increase the quality of our code through attention to detail in pull requests and refactoring, and you are a constant learningYou are primarily focused on front-end development (HTML, CSS, Javascript), but are comfortable working with PHP templates, getting into the database a little bit, working with or even creating basic REST api’s. You are full-stack, with a slant towards the presentation layerYou’ve worked extensively with React or Vue.js, you’ve build static websites, worked with a variety of CMS’, are comfortable with Node.jsYou’ve worked on Wordpress websites and know the in’s and out’s of building them - maybe you’ve even regularly used Advanced Custom Fields to build all kinds of custom post typesExperience with any of these is a bonus: Laravel, Typescript, Firebase, Next.js, Cypress/PlaywrightWhat would my day look like?You’ll report to a Project Producer, and work on all aspects of development from the frontend to the backend, in collaboration with designers, DevOps, and QAYou’ll work closely with Senior Web Developers and an Associate Technical Director to bring designs to life using the appropriate tech stack for the projectFrom concept through launch, you’ll dive in and support product development including task time estimation, coding, asset management, testing, and debuggingYou’ll support and help grow our people, processes, and frameworks in ways that benefit everyoneYou’ll participate in code reviews, pair-programming, project reviews, API design reviews, technical reviews of product stories with in-depth yet constructive criticism; and give and take feedbackYeah, I want in! How do we get started?We thought you would. We need to see or read some evidence of your development experience and how you’ve made an impact on other teams. Apply today and your application will be reviewed by a member of our team! Please be sure to include a link to your demo reel in your application!Important to know: This opportunity is only available to those eligible to work in Canada. Our entire team is working fully remotely, but we do have an office space in Toronto, ON &amp; Duncan, BC that you're able to work at if its preferred.\n      "},
{"role": "Full-Stack Software Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        This could be either a remote or hybrid position.eCapital supports small and mid-sized companies throughout the United States, Canada, and the United Kingdom by providing alternative financial solutions like invoice factoring, factoring lines of credit, and asset-based lending to accelerate their access to capital. Through its Commercial Finance and Freight Factoring divisions and its portfolio company Gerber Finance, Inc., eCapital offers capital solutions to 80+ industries. eCapital is an innovative leader in providing flexible, customized cash flow to businesses. We truly love to help our clients grow and this is a position where you can grow too!The Opportunity:eCapital is looking for aFull-Stack Software Developerto design, build and support cloud-native enterprise and consumer solutions. This is an excellent opportunity to be part of acollaborative, creative, and metrics-based team whose goal is to increase performance and revenue for the company.What you will do:Participate in a cross-functional Agile teamDesign system and software architecturesDevelop visually appealing front-end apps by translating UI/UX designs into front-end codeDevelop APIs and servicesDevelop large-scale solutions for data processing and storageDevelop and maintain CI/CD pipelinesAssist with the training and leveraging of custom AI modelsWhat you need:University Degree in Computer Science or Computer EngineeringExperience with end-to-end development of full-stack solutionsExperience with cloud servicesExperience with database technologies such as MSSQL, MySQL, or MongoDBExperience with back-end frameworks such as .NET Core or ExpressExcellent problem-solving skillsExcellent written and verbal communication skillsAbility to work under pressure while meeting deadlinesStrong organizational skillsExceptional attention to detailMust be a team player!What you will get:We are a growing organization that thrives on delivering trusted financial services to help our clients succeed. Joining us will allow you to:Work in a dynamic, collaborative, progressive, and high-performing teamOpportunities to do challenging work and growMake a difference and lasting impact\n      "},
{"role": "Full Stack Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        About SnapliiThe Digital Wallet Snaplii has architected a deep bond between Users and Merchants for more efficient communication. The value-added features include making payments with credit cards and exploring favourite merchants and cash-back cards along with the data-driven marketing solutions that allow us to deliver the best in-store and online shopping experience to Users. The interactive platform also benefits the Merchants with a higher level of brand loyalty. In order to serve more merchants and users, we are expanding our business and adding more new functions, so that Snaplii can become a digital wallet commonly used by people in North America.About The RoleWe are looking for Full Stack Developers to join our development team. You will be responsible for the development of the new product as well as the maintenance of and enhancements to the existing product. The role will effectively communicate with the team to uncover immediate/future needs, will convey those results to our clients in a meaningful way, and will deliver solutions in a proactive, fast-paced, client-service driven development environment.Job LocationOnsite job in MississaugaYou Will:Help execute the product development vision, and assist with the technical landscape for a large-scale constructionWrite maintainable, testable, and performant software in creating the entire platform, end-to-endBuild reusable code and libraries for future useParticipate in code review and performing extensive testing to ensure high-quality softwareImplement services using security mechanism such as OAuth, Single Sign On.Implement data security processes and methods.Clearly document the artifacts to ensure proper knowledge transfer within the team.Build and launch products rapidly and iteratively. We ship to production frequently and have a large, active user base.Integration of the front-end and back-end aspects of the applicationCommunicate clearly and effectively with all members of our teamQualifications And SkillsBachelor’s degree in Computer Science or Computer engineering.3+ years of software development experience, with a focus on NodeJS(Server-side), ReactJS(Client-side) and HTMLExperience both authoring and consuming RESTful APIsExperience with SQL and database designExperience with extensive unit testing experience (preferably using Mocha and Chai)Experience with Git/GitHub and GitHub ActionsExperience with unit/integration/end-to-end/performance testing.Experienced in Agile methodologies.Strong debugging and troubleshooting skillsHas a strong working ethic and obeys the code of conduct. Strictly follow the security and quality assurance procedure.Must be performance-driven and able to work in a fast-paced environment with tight deadlines.Nice to haveExperience with CSS3, SCSS, Flex Box, Bootstrap, Material UIExperience with Next.jsExperience with TypescriptExperience with in-memory cache (Redis)Experience building API using Microservices &amp; Serverless ArchitectureExperience in server management and AWS knowledgeExperience with Java/Spring BootA Fintech background is an asset\n      "},
{"role": "Software Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        There are people who say some ideas are impossible, unattainable, or unrealistic. Then there are those of us who work at Martin Rotary and Mission Systems. As a part of the Martin community, we take on the biggest, baddest challenges in the world and find solutions using creativity and collaboration. And where the solutions don’t exist? We invent them.So, if you’re looking for the challenge of a lifetime and a team of the brightest minds in the world, Rotary and Mission Systems Rotary and Mission Systems, is the place for you. If you’re looking for a place where learning is a way of life, Rotary and Mission Systems is the place for you. And if you’re looking for a career that’s just as fun as it is hard work, well…you know.Join us today and let’s make a difference together.Only here are you Mission Critical!These are just some of the exciting Software Engineering roles available: and/orFull Stack Engineer/Cloud InfrastructureSoftwareSoftware Test EngineerRMS Locations:Moorestown/Mt. Laurel, NJKing of Prussia, PALiverpool/Syracuse, NYOwego, NYOrlando/Palm Beach, FLHuntsville, ALLittleton/Colorado Springs, COManassas, VAAnnapolis Junction/Hanover, MDConnecticutBothell, WAWe Offer 4-Day Work Week Generous relocation packages to help with the move With locations across the US, Martin has endless career growth and development opportunities and your expertise can support the most important work in the nation Comprehensive benefits package that includes health, dental, vision, etc. starting Day 1 Lucrative 401k program Work/ Life Balance with a generous PTO program\n      "},
{"role": "Software Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        By applying for this role you will be considered for enterprise wide opportunities within Lockheed Martin for the same or similar skill set.There are people who say some ideas are impossible, unattainable, or unrealistic. Then there are those of us who work at Lockheed Martin Rotary and Mission Systems. As a part of the Lockheed Martin community, we take on the biggest, baddest challenges in the world and find solutions using creativity and collaboration. And where the solutions don’t exist? We invent them.So, if you’re looking for the challenge of a lifetime and a team of the brightest minds in the world, Rotary and Mission Systems Rotary and Mission Systems, is the place for you. If you’re looking for a place where learning is a way of life, Rotary and Mission Systems is the place for you. And if you’re looking for a career that’s just as fun as it is hard work, well…you know.Join us today and let’s make a difference together.Only here are you Mission Critical!These are just some of the exciting Software Engineering roles available: Java and/or C++ Developer Full Stack Engineer DevOps/DevSecOps Cloud Infrastructure Software Architect Software Test EngineerRMS Locations may include:Moorestown/Mt. Laurel, NJKing of Prussia, PALiverpool/Syracuse, NYOwego, NYOrlando/Palm Beach, FLHuntsville, ALLittleton/Colorado Springs, COManassas, VAAnnapolis Junction/Hanover, MDConnecticutBothel, WAWe Offer 4 Day Work Week Generous Relocation packages to help with the move With locations across the US, Lockheed Martin has endless career growth and development opportunities and your expertise can support the most important work in the nation Comprehensive benefits package that includes health, dental, vision, etc. starting Day 1 Lucrative 401k program Work/ Life Balance with generous PTO program\n      "},
{"role": "Web Developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Design Match is searching for a skilled Web Developer to join our team. As a Web Developer, you will play a crucial role in designing, developing, and maintaining our web presence, ensuring a seamless user experience and delivering high-quality web solutions.ResponsibilitiesCollaborate with cross-functional teams to gather requirements and understand project objectives.Design and implement user interfaces with a focus on aesthetics and functionality.Develop and maintain web applications with a strong emphasis on responsiveness and compatibility.Conduct rigorous testing to ensure optimal performance and identify areas for improvement.Stay updated with the latest web development trends and technologies.RequirementsProven experience as a Web Developer or related role.Proficiency in web development technologies such as HTML, CSS, JavaScript, and front-end frameworks.Understanding of back-end technologies and server-side development (e.g., Node.js, PHP, ASP.NET).Familiarity with content management systems (CMS) is a plus.Excellent problem-solving and communication skills.If you are enthusiastic about creating visually appealing and functional web experiences, we'd love to have you on our team!\n      "},
{"role": "Full stack Developer (React JS, Redux)-Canada", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Role: Full stack Developer (React JS, Redux)Location: Remote/CanadaDuration: 12+ MonthsThey're looking for Frontend heavy with backend experienceFront end: React JS, Redux, GraphQLBackend: Java, Spring bootDatabase: PostgreSQLConcepts: design systems, widgets, plugin, composition patterns, react hooks, caching, infrastructure, error handling, standards on error codes, performance, user interactionsNice to have: React Context (state management).\n      "},
{"role": "Software Engineer - Front End", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        We believe small businesses are at the heart of our communities, and championing them is worth fighting for. We empower small business owners to manage their finances fearlessly, by offering the simplest, all-in-one financial management solution they can't live without.About the Engineering Team:We aim to meaningfully improve the lives of small business owners, who are traditionally under-served and often struggle because of this. At Wave, you won’t just write code—you’ll build high-quality systems at scale. This means being involved in the research, design, and organizational and maintenance practices behind our wide range of applications, which are relied upon by tens of thousands of small business owners. You won’t find many hardcore specialists here. Most Wave engineers are willing and able to dive into different technologies to get the job done. This requires curiosity, openness to new ideas and perspectives, and a genuine interest in what makes software products tick.About The Role:As a Software Engineer in the Front-end domain, you will join one of the many cross-functional engineering teams to work alongside Product, Design and other developers to build software to solve exciting business challenges. You will work with some fantastic engineers to solve tough problems in delivering world-class financial products to our customers at scale. You will bring your front-end skills to bear on making our React and ReactNative apps scale better and stay ahead of these quickly evolving ecosystem, helping the teams around also contribute better code by laying good React/ReactNative standards and building solid interfaces and reusable utilities and libraries that make everyone's lives better. You will be exposed to a wide variety of technologies and help investigate new ones as we are constantly striving to keep our technology choices up to date. As an engineering team, we deeply care about being the best in our craft - Performance, Reliability, Reusability, Code Quality, Test Coverage, and Observability. You will help maintain the current bar we have but will hopefully go on to raise it to the next level.Here’s What You Should Know About Engineering at Wave:Our Technology: Wave is powered by several key technologies. Our web/mobile toolkit where you'll be working is primarily React and ReactNative with Typescript and Javascript. Our APIs are GraphQL and REST powered by services written in Python and Django, as well as Rails and Golang. We expect software developers working on the front-end to have enough familiarity with API development to be able to collaborate with back-end developers to devise solutions to product challenges, and to contribute to code on the API layer when neededYour Work Will Matter: Every engineer at Wave is tasked with solving meaty, meaningful challenges for a really important end-user - our small business owners. The code you write will make a difference, guaranteedWe Are a Community: Wave is about the size of a small neighbourhood. It is possible to get to know everyone on a personal basis. If you’re trying to solve a hard problem that has roots in some other part of the company, odds are pretty good that you’ll find someone close by who can help you outYou Will be Stretched: We’re big on transparency and we know Wave isn’t for everyone. However, if you’re ready to flex your creativity, excel at your craft, fuel your curiosity, and thrive in a dynamic environment, we’re confident you’ll love being a WaverWorking at Wave:Work From Where You Work Best: We will always have a welcoming, energizing, and world-class office (in Toronto) with a space for you. Or, if you’re more comfortable working from home, the choice is yoursWe Care About Future You: You will stretch yourself and you will grow at Wave. You will also be supported on this journey with diverse learning experiences, educational allowances, mentorship, and so much moreWe Support the Full You: We make a serious investment in your health &amp; wellness. When we think about benefits we think about body, mind, &amp; soul and we take this stuff very seriously. We Take Care of the Fundamentals: Fair compensation, all the office perks you’d want, and the various goodies you’d expect from a growing tech company. This is the obvious stuff, but we don’t want you to think we forgot!At Wave, you’re treated like the incredible human being you are.Work From Where You Work Best: We will always have a welcoming, energizing, and world-class office (in Toronto) with a space for you. Or, if you’re more comfortable working from home, the choice is yours.We Care About Future You: You will stretch yourself and you will grow at Wave. You will also be supported on this journey with diverse learning experiences, educational allowances, mentorship, and so much more.We Support the Full You: We make a serious investment in your health &amp; wellness. When we think about benefits we think about body, mind, &amp; soul and we take this stuff very seriously.We Take Care of the Fundamentals: Fair compensation, all the office perks you’d want, and the various goodies you’d expect from a growing tech company. This is the obvious stuff, but we don’t want you to think we forgot!We believe that a diverse and inclusive culture creates the best workplace. We embrace our differences, value individuality, and the broad spectrum of every Waver's skills and abilities. We challenge each other from a place of respect and pursuit of continuous growth. We trust each other and encourage everyone to bring their authentic selves to work, everyday. As Wavers, our voices matter, our opinions are met with an open mind. The best ideas win, no matter whose they are. Contributing to an inclusive culture is a part of all of our job descriptions.We’ve been continuously recognized as one of Canada's Top Ten Most Admired Corporate Cultures and one of Canada’s Great Places to Work in categories including Technology, Millennials, Mental Health, Inclusion and Women.Are you ready to be a Waver? Join us!\n      "},
{"role": "Full-stack developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Our client is looking for a Full-stack developer (front-end &amp; back-end) to join our digital team for designing user interactions on websites, developing servers and databases for website functionality and coding for mobile platforms.The primary responsibility of a Full Stack Developer includes designing user interactions on websites, developing servers and databases for website functionality and coding for mobile platforms.ResponsibilitiesDesign overall architecture of the web applicationDeveloping front end website architectureTranslate Wireframe responsive HTML/CSSBuild interactive web pagesIntegrate with App backendDesigning user interactions on web pagesDeveloping back-end website applicationsImplement authentication and authorizationSet-up backend storage (DynamoDB, RDS) to store user settingsDesign and implement API requests to Data science modelsEnsuring cross-platform optimization for mobile phonesWorking alongside graphic designers for web design featuresEnsuring responsiveness of applicationsExperience working with graphic designers and converting designs to visual elementsUnderstanding and implementation of security and data protection\n      "},
{"role": "Front-end Developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Are you a creative Front-end Developer with a passion for crafting captivating user interfaces? Design Match is searching for a talented individual to join our team. As a Front-end Developer, you will be instrumental in designing and implementing user interfaces for our web applications, ensuring seamless and delightful user experiences.ResponsibilitiesCollaborate with UX designers to translate wireframes and prototypes into interactive web interfaces.Implement responsive and intuitive designs that work seamlessly across various devices.Optimize front-end code for performance and efficiency.Stay updated with the latest front-end technologies and best practices.Conduct code reviews and provide valuable feedback to team members.RequirementsProven experience as a Front-end Developer or related role.Proficiency in HTML, CSS, JavaScript, and front-end frameworks (e.g., React, Angular, or Vue.js).Familiarity with design tools such as Sketch or Adobe XD.Strong understanding of responsive design principles.Excellent problem-solving and communication skills.If you are passionate about creating stunning user interfaces and want to be part of a dynamic team, we encourage you to apply at Design Match!\n      "},
{"role": "Full Stack Engineer", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        Greetings! I'm Bryan, the Chief Technology Officer at Boxhub, where we're building an exciting new online platform for shipping containers. As an engineer at heart, I relish the challenge of tackling complex technical problems. But as a seasoned leader, I also know that the best solutions are often the product of collaborative teamwork. That's why I'm focused on assembling a team of top-notch product squads who will work together to create a suite of innovative products that our customers will adore. And that's where you come in! We're currently seeking a passionate Full Stack Engineer to join our team and help us shape the future of shipping – one container at a time. Together, we can make a meaningful difference in creating a more sustainable world.Our Mission:Boxhub is an e-commerce &amp; logistics startup on a mission to revolutionize the way shipping containers are traded, transported, and used. Shipping containers are becoming the most sustainable and cheapest solution for many storage and building projects. We believe that by giving our customers better access to containers, while improving the inherently broken supply chain, we can generate a substantial positive impact and help save thousands of tons of CO2 per year.Boxhub is well funded by some of the most successful investors in the tech industry, founded by long-term shipping industry experts, and led by award-winning entrepreneurs. We were recently listed by VCs as one of the most promising marketplaces of 2022 and are looking for new team members who are equally passionate about changing an entire industry.Your MissionBuilding web applications using ReactJS, NextJS, NodeJS, Typescript and a MariaDB database on an AWS infrastructureCollaborating closely with Engineers, CTO and Product Management to integrate different systems through APIs and provide a coherent user experience across our sites and tools, adapting to each type of user we work withDesigning and developing back-end services using an API-first approach and REST, following clean code and hexagonal architecture principlesProducing reusable components, playbooks and libraries for future useParticipating in code reviews, sprint planning and retrospectives to develop and maintain a quality codebaseTranslating designs into beautiful user interfaces that offer a coherent and valuable experience for our customers and internal usersMentoring and knowledge sharing with other team members, learning from them tooWhat You Bring to the TableYou’re a Full Stack Engineer with experience shipping multiple features and productsYou have solid Javascript knowledge and are excited to adapt to new frameworks, technologies and toolsYou have the ability to work with distributed systems, APIs, and Relational DatabasesYou understand engineering principles and coding best practices, and you’re able to write clean code with scalability in mindYour communication style is concise, and you’re able to break down technical concepts to non-technical team membersThe Interview Process1: 30-minute Phone screen with Emma Hunt (Head of People and Culture)2: 60-minute Virtual Interview with Bryan McEire (CTO)3: Technical take-home exercise4: 60-minute exercise walkthrough and Q&amp;A with Alejandro Castillo (Head of Engineering) and Nick Chinsen (Senior Full Stack Engineer)5. 30-minute Cultural interview with Max Birner (CEO)5: Reference Check &amp; Offer 🥳 What Boxhub OffersHighly competitive salary depending on experienceStock OptionsFantastic opportunity to help build and grow with a funded company at an early stage4 weeks of annual vacationComprehensive healthcare benefits plan, including dental &amp; vision &amp; spending accountFree access to Maple and Headspace appsA monthly transportation allowanceFlexible working hours in a hybrid environment - we work remotely 2 days a weekJoin a multicultural team that has built successful startups around the worldBoxhub’s Commitment to Diversity, Equity and InclusionAt Boxhub, we believe diversity and representation are key to creating an exciting product and an amazing customer and employee experience. We strongly encourage applications from candidates of all backgrounds, experiences, and perspectives regardless of race, colour, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, Veteran status or any other aspect that makes you, you.Boxhub’s commitment to accessibilityBoxhub is committed to developing an inclusive, barrier-free recruitment process and work environment. Please inform us if you require any accommodation, and we will work with you to meet your accessibility needs. For any accessibility-related assistance, requests for information in accessible alternative formats, or to report any accessibility problems, don't hesitate to get in touch with us at accessibility@boxhub.com\n      "},
{"role": "React Front End Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        As one of Canada’s largest and fastest growing cryptocurrency trading platforms, NDAX has set the bar high for the country’s fintech industry and is constantly leading the way in terms of security and innovation. We are on a mission to empower more Canadians to unlock the full potential of digital finance. To address the various needs in the Canadian cryptocurrency space, NDAX has assembled a multidisciplinary team with diverse backgrounds, including finance, technology, engineering, compliance, marketing, and more.We are proud to have been recognized as one of Canada’s Best Workplaces by Great Place to Work®.We are looking for a React front end developer with headless CMS experience.Position Type: Full Time – PermanentKey Responsibilities (job Description)Developing new user-facing features using React and Headless CMS tools Building reusable components and front-end libraries for future use Translating designs and wireframes into high quality code Optimizing components for maximum performance across a vast array of web capable devices and browsers Creating, installing, and maintaining WP sites as a headless CMS Working closely with designers to push the boundaries of what is possible and help define best practices Integrating with a headless CMS and various APIs to deliver a combination of static and dynamic web experiences RequirementsA proven experience of scaling up products to hundreds of thousands of users while maintaining costs and security of infrastructureThorough understanding of React and its core principles Extensive experience in different web protocols RESTful, WSS, FIX, etc. Experience with different caching mechanisms Experience with different messaging systems/protocols Experience with Jamstack, nextjsAbility to work with common CMS systems and frameworks depending on the need – common platforms like WordPress or Squarespace Familiarity with the WordPress API and GraphQL plugins Knowledge of modern authorization mechanisms, such as JSON Web Token Experience with common front-end development tools such as Babel, Webpack, NPM Ability to understand business requirements and translate them into technical requirements Expert in the life cycle of web page/request Deep understanding of web concepts, requests, responses, headers, security, etc. Degree in computer science or equivalentBenefitsExtended Healthcare Plan (Medical, Disability, Dental &amp; Vision) Life Insurance Paid Time Off Training &amp; Development Opportunities Stock Option Plan Bonus – Awards – Gifts Work From Home – Flexible hour Free snacks and drinks at the office\n      "},
{"role": "Software Developer, New Graduate, 12 month Contract", "seniority_level": "Associate", "employment_type": "\n            Associate\n          ", "job_description": "\n        Change the future with us.Experience@Siemens is an exciting opportunity for new Graduates from college or university to transition from academic to the workplace. Siemens Canada will provide you with practical and meaningful work experience as you start your career journey and help you build business skills. Recent graduates enrolled in this program will be partnered with a mentor and receive one on one coaching and guidance in support of their development and to help navigate their early career. In addition, this program will help students establish contacts and widen their network to excel in their career journey.Why you’ll love working for Siemens!Freedom and a healthy work- life balance– Embrace our flexible work environment with flex hours, telecommuting and digital workspaces.Solve the world’s most significant problems – Be part of exciting and innovative projects.Engaging, challenging, and fast evolving, cutting edge technological environment.Opportunities to advance your career and mentorship programs on a local and global scale.Competitive total rewards package.Profit sharing available.Rewarding vacation entitlement with the opportunity to buy and sell your vacation depending on your lifestyle.Contribute to our social responsibility initiatives focused on access to education, access to technology and sustaining communities and make a positive impact on the community.Participate in our celebrations, social events and offsite business events.Opportunities to contribute your innovative ideas and get paid for them!Employee perks and discounts.Diversity and inclusivity focused.Siemens is proud to be an eight-time award winner of Canada’s Top 100 Employers, Canada’s Greenest Employers 2022, Canada’s Top Employers for Young People 2023 and Greater Toronto's Top Employers 2022.About Siemens RuggedcomRuggedcom is a leader in the development of rugged communication networking solutions designed for mission critical applications in harsh environments. We are an innovative, rapidly growing company where you'll find an exciting, dynamic work environment and significant opportunity for personal growth.What You Will DoWe are currently looking for a Software Developer/Engineer for our Concord office who would report directly to the Manager of Software Engineering; someone with good analytical skills, can multi-task on various projects, a good problem solver and has good organizational skills.More specifically you will:Contribute to the entire life cycle of product development including specifications, design, coding, test, production and maintenanceDevelop software codes in C/C++Participate actively in development projects, both hardware and software component selection and developing technology for future productsBe a part of a team that brings advanced telecommunications products to marketWhat You Will BringDegree in Computer Science/ Engineering/ Mathematics or related disciplinesExperience with Linux operating system and environmentProgramming skills in C / C++ and Bash programming in a Linux environment (user and kernel space)Experience in developing or modifying and integrating open-source projects (OSS)Experience developing with POSIX threadsExperience with TCP/IP and socket programmingSoftware source control tools such as Git, Subversion, etc.Assets:Experience working on Linux for embedded devicesExperience with AngularExposure to Databases/data modellingAbout Siemens Canada:We share our ideas and champion the people behind them.For over 110 years, Siemens Canada has stood for engineering excellence, innovation, quality and reliability. Siemens Canada is a technology leader providing comprehensive solutions for Smart Infrastructure and Digital Industries. We make real what matters by setting the benchmark in the way we electrify, automate and digitalize the world around us. Ingenuity drives us and what we create together in yours.Making a difference together we raised $$385,000 towards charitable contributions, support over 38 non-profit organizations and planted 660 trees in our local communities. Siemens Canada has 2,500 employees from coast-to-coast and 24 office and production facilities across Canada. Join our team of approximately 293,000 talented professionals in more than 190 countries/regions and help us tackle the most exciting challenges to build a successful future together. So, what are you waiting for? Take your next career step with us.To learn more about Siemens Canada, visit our website at www.siemens.caWhile we appreciate all applications we receive, we advise that only candidates under consideration will be contacted.Siemens is committed to creating a diverse environment and is proud to be an equal opportunity employer. Upon request, Siemens Canada will provide reasonable accommodation for disabilities to support participation of candidates in all aspects of the recruitment process. All qualified applicants will receive consideration for employment.By submitting personal information to Siemens Canada Limited or its affiliates, service providers and agents, you consent to our collection, use and disclosure of such information for the purposes described in our Privacy Code available at www.siemens.ca.Siemens s’engage à créer un environnement diversifié et est fière d’être un employeur souscrivant au principe de l’égalité d’accès à l’emploi. Sur demande, Siemens Canada prendra des mesures d’accommodement raisonnables pour les personnes handicapées, dans le but de soutenir la participation des candidats dans tous les aspects du processus de recrutement. Tous les candidats qualifiés seront pris en considération pour ce poste.En transmettant des renseignements personnels à Siemens Canada limitée ou à ses sociétés affiliées, à ses fournisseurs de services ou à ses agents, vous nous autorisez à recueillir, à utiliser et à divulguer ces renseignements aux fins prévues dans notre Code de protection de la confidentialité, que vous pouvez consulter au www.siemens.ca.\n      "},
{"role": "Software Developer", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        In the role of Software Developer, you’ll help create and build beautiful software that matters using modern JavaScript and software development best practices. As a developer for Rangle.io, you’ll be joining a diverse community of people who are passionate about modern software development and its ability to change the world. You’ll get to work on a wide range of projects, using the latest JavaScript frameworks and cloud solutions building for the web &amp; mobile, working with a tight-knit team of talented and passionate individuals.Your ImpactOpportunity to work with one of the most exciting modern software development companies in the worldPlay a big part in the success of Rangle.io. We’re helping shape the Tech scene in Toronto and Amsterdam ; modern web and mobile development across the worldYour GrowthIn the role of Software Developer, you’ll help create and build beautiful software that matters using modern software development best practices (Agile, TDD, Continuous Delivery). As a developer for Rangle.io, you’ll be joining a diverse community of people who are passionate about modern JavaScript and its ability to change the world. You’ll get to work on projects, using the latest JavaScript frameworks building for the web &amp; mobile, working with a tight-knit team of talented individualsHow We WorkWe work with modern JavaScript across a range of frameworks and technologies, on the client as well as on the server: Angular, React, Vue, NodeJS, TypeScript, ES6, Babel, ReduxOur approach to making software stresses teamwork and close interaction with our clients. We rely on a well thought-out process based on Scrum, continuous delivery, and test-driven development. This process allows us to build software in a way that sets you up for success, allowing you to exercise your creativity and building software that matters without all the red tape, hierarchy and politicsWe avoid sharply defined roles: everyone gets to partake in all aspects of their project and to try their hand at new things. Our developers do not just develop: they also help our clients think through product features, contribute to design, and testWe work for many clients in an exciting range of industries: social media, e-commerce, manufacturing, transportation, alternative energy, wellness. Any company that we feel helps make the world a better placeDetails About Your RoleSolid understanding of JavaScript. (Alternatively: really solid backend experience + some JavaScript + ability to learn JavaScript really fast.)5+ years experience in web application development, bonus points if you have experience working directly with clients or a product ownerExperience with Angular is preferred Bonus points if you have previous experience building apps in VueGreat interpersonal skills - we are a close knit team and work together to solve problemsA desire to follow a software development process that helps you sleep better at nightBonus points if you have server side experienceBonus points if you have an eye for design. (BTW, all our designers can code.)Great problem solver and ability to reinvent oneself - We are always looking at ways we can do things better, sometimes there is no path to followProactive and self starter - we hire folks that have a deep desire to do better and be better, you won’t be micromanaged in this role. (We want to hear your voice.)Passionate about learning - You’ll help identify new technologies and approaches to problems. (Web development and especially JS is always evolving.)Headquartered in Toronto, Canada, Rangle.io is changing how our clients innovate. We take great ideas and apply strategy, design, and technology to bring them to life. Rangle is a scale-up that began as a leading modern JavaScript shop, and has transformed into a digital consultancy that partners with enterprises to create modern digital experiences AND the digital engine to efficiently evolve and scale them. Working directly with clients’ teams, Rangle’s experts help shape the way leading companies deliver and evolve their digital products and experiences.While focusing on doing the right thing, we adopt an atmosphere of creativity, belonging, and fun. Ranglers are curious, brave, kind, and innovative. Together we build experiences that make an impact on the world. Come join us.Rangle is an equal opportunity employer committed to creating a safe, diverse and inclusive environment. We encourage qualified applicants of all backgrounds including ethnicity, religion, disability status, gender identity, sexual orientation, family status, age, nationality, and education levels to apply. If you are contacted for an interview and require accommodation during the interviewing process, please let us know.\n      "},
{"role": "Software Developer – JavaScript & Python", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        About Us:Messagepoint is a privately-owned, PE-funded software company headquartered in Toronto, Ontario. We enable large enterprises to deliver enhanced customer experiences and achieve a better bottom line by optimizing their omni-channel customer communications.Our award-winning platform gives non-technical business users such as marketers, CX teams and product owners intelligent control over the content in customer communications to achieve unparalleled personalization, relevancy, brand consistency, and compliance. Only Messagepoint harnesses AI-powered Content Intelligence to automate and simplify the process of migrating, optimizing, authoring and managing business-critical on-demand, interactive and batch communications across all platforms and channels.Founded in 1998 as Prinova, Messagepoint has grown from its beginnings as a top global Customer Communications Management (CCM) integrator, to become a leader in the space due to our unique ability to intelligently manage content.SummaryWe are currently looking for a highly skilled and motivated Software Developer to join our Healthcare team. As a key member of the team, you will be responsible for creating innovative solutions and working with data at scale. In addition to JavaScript and Python development, this role requires the ability to gather requirements, design and architect solutions, and take ownership of projects. You will collaborate with a highly technical team to deliver cutting-edge solutions in the Healthcare industry.Responsibilities:Gather requirements from stakeholders and translate them into technical specifications.Design and architect scalable and fault-tolerant solutions using AWS distributed computing and storage components.Develop new components and enhance existing functionality for our Healthcare Touchpoint Exchange.Design and implement software solutions using JavaScript and Python.Model and develop data structures using JSON, XML, and databases.Take ownership of projects, ensuring timely delivery and meeting project requirements.Collaborate with cross-functional teams to define overall concepts for new product features and components.Continuously optimize and improve the performance and scalability of the software solutions.Qualifications: Bachelor’s Degree in Computer Science, Computer Engineering, or a related field.3+ years of experience in JavaScript and Python development.Experience with other programming languages is a plus.Strong experience in gathering requirements, designing, and architecting software solutions.Proficient in using GitHub/Gitlab for project collaboration and managing source code.Experience with distributed computing and storage systems is required.Demonstrated ability to solve complex problems in fast-paced environments.Excellent communication skills and the ability to articulate complex ideas and concepts.Strong time management skills with a proven ability to prioritize and meet strict deadlines.Self-driven and motivated to learn and improve.Prior experience with Medicare Advantage benefits is a plus.Messagepoint is an Equal Opportunity Employer and encourages diversity and inclusion in the workplace.We thank you for your interest, however, only those who qualify for an interview will be contacted.Powered by JazzHRkoUHVECX2C\n      "},
{"role": "Frontend Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Nightfall makes safeguarding sensitive data for every application simple and seamless. Organizations, from startups to global brands, trust Nightfall's software platform and APIs to discover, classify, and protect sensitive data.As a Frontend Engineer at Nightfall, you will be leading interesting UI and visualization projects that are critical to the company and its mission to protect personal data.ResponsibilitiesBuild reliable, scalable and performant user experiences using modern tools like React, TypeScript, Jest and WebpackHelp define a scalable front-end architecture, advise other teams internally and also encourage best practicesProvide technical leadership to more junior engineers on your teamGet problem statements from designers and product managers, break projects into substantial tasks, and deliver the project with metrics and data with fellow engineersQualifications3+ years of industry web frontend development experience with modern JavaScript tooling (React, Redux or equivalent, and so on)Strong understanding of HTML, CSS, JavaScript, and related web technologiesExperience working with react or node.js applicationsExperience with unit and integration testingGood written, verbal communication skillsGreat team playerTools We UseGoGraphQLNode.jsReactPythonCassandraRedisTerraformDockerKubernetesAWSKafkaEnvoyAbout Nightfall:Nightfall is a cybersecurity startup dedicated to helping organizations secure and manage their sensitive data. As a leading enterprise technology company, our product affects the personal data that people entrust businesses to store &amp; process with care every day. Critical data in modern organizations is often sprayed across a broad set of cloud data silos, and it's a herculean task for security &amp; compliance teams to monitor, manage, and protect this highly sensitive data. Via machine learning, our product makes it easy for organizations to discover, classify, and protect this sensitive data across their cloud footprint - such as their corporate SaaS, data infrastructure, and even their own apps. In doing so, we prevent data leakage, provide unprecedented data visibility &amp; protection across the cloud, and enable compliance. We're a technology startup founded in San Francisco, well-funded by leading institutional investors like Bain and Venrock, and a cadre of security &amp; IT leaders from Okta, Salesforce, Atlassian, Splunk, FireEye, and more. Learn more on our website www.nightfall.ai or by reaching out via email at careers@nightfall.ai.\n      "},
{"role": "Junior React Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Our client a digital transformation technology company with a proven track record in solving complex problems for the finance, telecommunications, and construction industries is actively seeking to hire a fulltime permanent Junior React Developer to work in a hybrid role.Role OverviewWe are seeking a skilled and motivated Front-End React Developer to join our team and help us build engaging and intuitive web applications. As a Front-End React Developer, you will collaborate closely with our design and back-end teams to implement user interfaces that meet our clients' needs and elevate the overall user experience. You will play a crucial role in translating design mockups and wireframes into responsive and functional web interfaces.What Will You DoDevelop and implement user interfaces for web applications using React.js and related technologies.Collaborate with designers and back-end developers to ensure seamless integration of front-end and back-end components.Optimize web applications for maximum speed and scalability.Ensure the technical feasibility of UI/UX designs and provide input on design feasibility and potential enhancements.Participate in code reviews and provide constructive feedback to team members.Stay up-to-date with the latest industry trends and technologies to continually improve our development processes and outcomes.Troubleshoot and debug issues as they arise and propose solutions to maintain application quality.Actively participate in brainstorming sessions and contribute creative ideas to enhance the user experience. What Will You BringBachelors Degree in Computer Science with 1-2 years of industry experience Proficient in React.js and its core principles.Strong understanding of JavaScript (ES6+), HTML5, and CSS3.Experience with responsive and mobile-first web development.Familiarity with RESTful APIs and asynchronous request handling.Solid understanding of version control systems, preferably Git.Experience with front-end build tools and preprocessors such as Webpack, Babel, SASS/LESS.Ability to work collaboratively in a team environment.Excellent problem-solving skills and attention to detail.Strong communication skills and the ability to explain technical concepts to non-technical team members.Experience with testing and debugging tools.Bonus: Knowledge of UX/UI design principles and practices.Bonus: Familiarity with back-end technologies and frameworks.\n      "},
{"role": "Software Engineering, New Grad", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Who we areAbout StripeStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.About The TeamStripe offers an interesting middle ground between joining a small startup and going to work for a multinational company. We have systems and processes optimized for early-career professionals. You will be in an environment that prizes rigor, discipline, and reliability—from our products, from our ways of working, and from our colleagues. You will learn how the best teams put together extremely reliable systems, and you will be responsible for operating these systems, with adequate backup when things get tough.What you’ll doAs a company, we believe in end-to-end ownership of projects. For any given project, we have one person on point. While they don't necessarily have to do all the work themselves, it's their job to make sure all the work gets done. We launch betas and prototypes as early as we can. This helps ensure that we're building what users actually want. We contribute back to the community, often by building things we think are cool and by releasing open-source software.ResponsibilitiesWork on cross-functional projects, directly collaborating with other engineersGive meaningful feedback on code reviews and technical designsEnsure that the systems your team operates continue running well and can scale to meet the needs of our usersBuild the skills to own a project from beginning to end, learning project management and technical leadership skillsWho you areWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.Minimum RequirementsA Bachelor’s, Master’s, or PhD degree in computer science or a directly related field, obtained by summer 2024, or equivalent work experienceSome experience and familiarity with programming, either through side projects or classwork. We work mostly in Java, Ruby, JavaScript, Scala, and Go. We believe new programming languages can be learned if the fundamentals and general knowledge are presentExperience from either previous internships or working collaboratively on multi-person coding projects (in a university or professional setting)Ability to learn unfamiliar systems and form an understanding of those systems, through independent research and working with a mentor and subject matter expertsPreferred QualificationsOne or more areas of specialized knowledge balanced with general skills and knowledge, such as knowing more frontend technologies and, at a high level, how a service handles an HTTP requestExperience in code review practices, and an understanding of how to safely update production systemsFamiliarity with navigating and managing work in large code bases\n      "},
{"role": "Software Engineer ( All Levels)", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Job DescriptionAt Warner Music Group, we’re a global collective of music makers and music lovers, tech innovators and inspired entrepreneurs, game-changing creatives and passionate team members. Here, we know that each talent makes our collective bolder and brighter. We are guided by four core principles that underpin everything we do across all our diverse businesses:Music is Everything: Music is our passion, and we can never get enough. Tastes, trends, and tech will change, but great artists and songwriters will always be our driving force.Global Growth, Local Expertise: Music is a global language. Through communication and collaboration, our success can come from anywhere and translate everywhere.Innovation and Insight: Pushing the boundaries requires the best information and the boldest imagination. We use both to create the future.Empowered by People: Like the artists we serve and the music they make, our differences make us stronger. This is a place where every talent can belong and build a career.Technology is one of the most important parts of our business. Whether it’s signing up new artists; ensuring we provide the right data to Spotify, YouTube, and other digital service providers; or helping artists use the latest AI tools and make thoughtful decisions with data-driven insights – technology plays an invaluable role in our success. The engineering team at Warner Music Group makes all of it a reality.We are actively hiring for multiple engineering positions in Toronto, which include:Junior Engineers Senior Engineers Staff+ EngineersWe remain committed to Diversity, Equity, and Inclusion. We know it fosters a culture where you can truly belong, contribute, and grow. We encourage applications from people of any age, gender identity, sexual orientation, race, religion, ethnicity, disability, veteran status, and any other characteristic or identity.Job Title: Software Engineer (all levels) Your RoleOwning, defining the technical vision, and driving innovation for key technical systemsMentoring for junior engineers and mentorship opportunities for senior engineersCollaborating closely with key music industry stakeholders as well as colleagues in NYC, Los Angeles, and LondonHere You’ll Get ToReimagine and implement the future of tech for the music industry Work as part of a dynamic and highly effective team Own the creation and delivery of highly innovative products Learn and grow as a professional through close collaboration with your team members and engineering leaders, and by being part of culture of continuous improvement and learningAbout YouYou’re a curious learner with a desire to grow and contribute to a positive team environment You have a high sense of ownershipYou’re able to deal with ambiguity and working in a fast-paced, evolving environmentYour bias is towards action, and you always find ways to deliver better solutions more efficientlyYou’re an empathetic team member who works well in a team environment and communicates effectivelyYou’re excited about the music business: helping artists and songwriters grow and helping the world hear more great musicYou have a Bachelor’s degree in a relevant discipline or equivalent professional experienceAbout UsWith a legacy extending back over 200 years, Warner Music Group (WMG) today brings together artists, songwriters and entrepreneurs that are moving entertainment culture across the globe. Operating in more than 70 countries through a network of affiliates and licensees, WMG’s Recorded Music division includes renowned labels such as Atlantic, Elektra, and Warner Records. WMG’s music publishing arm, Warner Chappell Music, has a catalog of more than 1.4 million musical compositions spanning every musical genre, from the standards of the Great American Songbook to the biggest hits of the 21st century.Together, we are Warner Music Group: Music With Vision &amp; Voice.Love this job and want to apply?Click the “Apply” link at the top of the page, or apply directly with your LinkedIn. Applying with LinkedIn will import all of the information you put in your profile, but will still allow you to upload a resume and cover letter.Don’t be discouraged if you don’t hear from us right away. We’re taking our time to review all resumes, and to find the best people for WMG.Thanks for your interest in working for WMG. We love it here, and think you will, too.\n      "},
{"role": "Software Developer (All Levels Welcome)", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Description                            As a Software Developer at CBN you play an integral part in making the world a more secure place as you develop customized solutions that we design for governments around the globe. Problem solvers will thrive in this role as you will be continually challenged by the complexity and uniqueness of each customer’s system and its inherent requirements.  If you are looking for a challenge, you will find it at CBN as you work on high-profile, complex immigration, identity management and motor vehicle information systems. You’ll get to work on a variety of leading-edge secure technologies as well as be exposed to variety of contemporary languages and other development tools.  What We Can Offer You Compensation: We seek long term relationships with our employees and recognize and reward them with a competitive total compensation package that includes:An industry leading defined contribution pension plan with company matching contributions (up to 5%) and payment of service fees,Best-in-class health, medical and life insurance benefits.Access to virtual and telehealth services and apps; andVery progressive fertility, adoption, and surrogacy benefits to support all definitions of family. Career: As a knowledge-based organization we will provide you with a wealth of learning opportunities and challenging work that will grow your knowledge, skills and abilities. At CBN, we encourage and empower our employees to chart their own career path, putting you in control of your future. Culture: Personal character is the foundation of our culture. CBN’s 7 Core Principles shape and guide our behaviours and underpin the sense of community you will experience at CBN. Equality, diversity, and inclusivity are important to us as an organization, and we are committed to fostering and developing a work environment where every employee is treated with dignity and respect. What You Will DoAs part of a cross-functional team (DBA’s, Testers, Developers and Project Managers), you will participate in the creation of desktop and web application systems from conception to launch. Taking direction from a Project Lead, you will:         Participate and or design in the functionality (remember our customized systems) based on a systems requirement document.        Write code! Following design CBN coding standards during the development lifecycle.        Write automated unit tests to validate the code is doing what it’s designed for and saving effort for subsequent manual testing.        integrate code with 3rd party software or legacy systems, deploying components to a shared environment to ensure system interoperability.        Support and maintain release code by fixing bugs, as part of the long-term support of the systems Minimum Qualifications Skills and AbilitiesExperience developing on at least one of Windows or Linux (and both is preferable)Experience developing software systems using at least one of Java, C++, or C# (and all    three is preferable)Experience interacting with RDBMS environments using SQLKnowledge of SOAP, xmlrpc, and/or Spring frameworksExperience with source control and build tools, especially Git, Subversion, Maven, and the Atlassian suite (Bamboo, Jira, Confluence)Experience with Oracle and/or PostgreSQL RDBMSExperience with web UI frameworks, especially Angular and/or Vaadin Soft Skills        Self-directed learner        Attention to detail, with a flare of creativity        A passion for helping people        Expert organizational skills        Good judgement to know what is important Mandatory RequirementsTravel to some customer sites to install hardware and infrastructure (Of course only when it’s safe!)About Us CBN designs and develops industry leading solutions for the following domains: Border Security, Civil Identity, Driver Identification and Vehicle Information, Currency and Excise Control, and Lottery and Charitable Gaming. To learn more, visit www.cbnco.com. As an Equal Opportunity Employer, Canadian Bank Note Company, Limited is committed to achieving a skilled workforce that reflects the diversity of the Canadian population. We encourage applications from women, visible minorities, people with disabilities and Aboriginal people. Canadian Bank Note Company Limited is committed to developing inclusive, barrier-free selection processes and work environments. If contacted regarding this competition, please advise the interview coordinator of any accommodation measures you may require.   \n      "},
{"role": "Frontend Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        What we're looking forWe are looking for a front end developer! Phoenix is a Y Combinator backed startup based in downtown Toronto. You’ll work closely with the cofounders to continue to build out the patient side of our platform. We are looking for a passionate, mission-driven developer who takes pride in the products they build.QualificationsHave 3+ years of professional programming experienceCreating software features that are robust, reliable, and user-friendly for our customersExperience developing software for the Web platform, including cross-browser compatibilityCreating software features that are robust, reliable, and user-friendly for both internal teams and our customersExperience with modern tools like ES6, React, Redux, Apollo, Flux &amp; WebpackGood eye for design and ability to make product decisions.You care about men’s health and have a personal connection to the spaceWhy work with Phoenix?Impact &amp; autonomy. You’ll report directly to the founders who are both senior devs and you'll have a real opportunity to build Phoenix's productCool tools! We use some great software and platforms to deliver the best in care. Need something to make your job easier? We'll work with you to make it happen!Rewarding Mission. We're delivering the best healthcare experience to Canadians across the country.Fun team, local in Toronto! We are a small elite team in Downtown Toronto. Candidates must be located in the Toronto area.\n      "},
{"role": "Jr. Full Stack JavaScript developer (Ontario Branch)", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Position Title: Jr. Full Stack JavaScript developerReports to: Director, R&amp;DJob Type: Full time, permanentLocation: Brampton, ONAll successful candidates are required to reside within commuting distance of our Brampton, ON office location. Plexxis does not offer remote work opportunities.Salary Range: $61,500 - $148,500SummaryWe're looking for Junior Full Stack developers to mentor and grow into superstars.What You Will DoAs part of the Plexxis web development team, you will…use react + node/express to create user interfaces and backend API calls as part of the ongoing effort to modernize our primary product offeringlearn from more senior team members who direct your day-to-day activitiesmake meaningful contributions to a product that people rely on in their day-to-day business operationsgrow into a strong developer as you build your lifelong career at PlexxisRequirementsYou like peopleYou are focusedYou are supportiveYou are drivenYou like to work in a team but are fine working on your own when the occasion calls for itYou love coding and you love a good challengeYou know some JavaScript basicsYou know some ReactJS basics, AngularJS basics, or VueJS basicsYou know some NodeJS basicsNice to HavePersonal projects that demonstrate your love of developmentDeveloper training of some kind (boot-camp, college, university, etc.)TypescriptOracleDB or any relational database exposure (sql)What's it like working at Plexxis?As Such, We Make It a Point To Provide Each Of Our Employees With The Tools Needed To Do Their Job Well, IncludingThe dress is casual, but our commitment to quality is not. At Plexxis, the working environment is a social one - built on mutual respect and collaboration. We are a team of extremely hard-working individuals who have a steadfast dedication to delivering amazing results to our clients.Competitive SalaryBenefitsCompany gymA games roomPaid after hoursOur team genuinely appreciates each other and there is an authentic camaraderie and support network.About Plexxis SoftwareThe Plexxis Drywall Enterprise Resource Planning (ERP) software maximizes the profit and efficiency of wall &amp; ceiling contractors through expert consulting and a drywall estimating software that unites digital takeoff, costing, construction management, mobile applications and accounting solutions into a single, sophisticated - yet simple system.Since 1999, our sole focus has been dedicated to the wall and ceiling trade – a focus that has brought together an extraordinary wealth of knowledge, experience and expertise. From technology engineers, trainers and consultants, we have assembled the “right” people, the “right” product and the “right” service to deliver solutions unmatched in quality and customer focus.Are you the perfect fit? Do you wish to …Work with a small, tight-knit group of hard-working, dedicated and fun individualsEnjoy the atmosphere of a rapidly growing, high energy company with an entrepreneurial spiritBe on the winning team - poised to emerge as the global leaderBe challenged in the workspace, in the fitness room or even the billiards CaféLose the stuffy environment (and politics) of “big corporate” and focus on delivering what the competition calls “impossible”If you're ready for an exciting career with an industry leader, give us a call to explore your future. Growth. Learning. Opportunity.Disclaimer for all posting locations: We thank all applicants in advance for their interest but advise that only those selected for an interview will be contacted.Plexxis is committed to the principles of diversity and inclusion; encouraging applications from all well qualified applicants. Accommodation is available for applicants, including those with disabilities, throughout the recruitment process.Please Note: If you are offered a position at Plexxis Software, you may be required to agree to a background check.PLEXXIS IS AN EQUAL OPPORTUNITY EMPLOYER\n      "},
{"role": "Backend Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Our company is a rapidly growing technology firm that specializes in developing innovative software solutions for clients across various industries. We take pride in building software that is efficient, scalable, secure, and user-friendly. Our goal is to make a significant impact in the market through cutting-edge technology.We are looking for a Backend Developer to join our team. As a Backend Developer, you will be responsible for designing, developing, and maintaining applications using Nods.js and Google Cloud. The ideal candidate will have a strong background in software development, a solid understanding of web development principles, and a proven track record of working with Node.js / Typescript.Note: Only candidates located within a 3-hour time zone from Toronto, Canada will be considered for this role.What You’ll OwnWriting clean, maintainable, and well-documented code using Node.js/Typescript with express for API’s.Working with google cloud platform to integrate with Cloud services such as cloudSQL (postgres), cloud storage, and appengine. Design and develop new applications and features, ensuring scalability, performance, and security. Demonstrate high-quality software development practices. This includes participation in all aspects of the design and development of the applications: research, ideation, and strategy.Work closely with leadership to understand system requirements and find well-optimized software development solutions in alignment with the production deadlines and goals.Experience And Skills You’ll HaveProven work history of software development with Node.js/Typescript and Express.Strong understanding of Google Cloud Platform.Good understanding of API specifications and documentation.Strong understanding of web development principles, practices, and design patterns. Familiarity with databases and data modeling specifically postgreSQL with Prisma.Capability to write clean, correct, and efficient code.High-quality verbal and written communication skills.Sense of ownership, urgency, and pride in your work.\n      "},
{"role": "Full Stack Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        Gadget is making development fun again. We’re building a best-in-class tool for developers to build, deploy, and scale backend applications wildly fast. There’s too much accidental complexity in software development, which means too much time is spent on boring, repetitive, or wasteful tasks. Our mission is to give devs that time back so they can use it to solve real world problems instead .To do this, we need amazing teammates. We're hiring truly incredible people and surrounding them with the right tools, processes, and culture to build, thrive and grow.Our product is different. We’re looking for a Full Stack Engineer who has a bit of experience, is eager to learn, and is drawn to complicated, technical challenges. We also need to be able to rely on each other as we grow this company together.You would:Be an early member of the Gadget team, which means lots of opportunity for helping define the vision and direction of the productPrimarily work with React, Node.js, TypeScript and PostgreSQLBe involved in the development of many core primitives as well as high level features to build out the platformReport directly to the foundersWork with and learn from a team of talented engineers who make developer experience their first priorityFrequently give and accept meaningful feedbackOwn solutions from end to end, managing complexity and engaging directly with stakeholdersDebug production issues across services and multiple levels of the stackUphold Gadget’s high standards for engineering and product qualityWe’re looking for someone who:Has a few years of software development experienceAlready knows or wants to learn deep skills across the entire stackTakes delight in crafting ergonomic abstractions that can scale to meet the needs of most developersWants to work with people who encourage you to do your best work and are invested in your growth and developmentTakes pride in working on projects from ideation to delivery, and enjoy seeing your products being used by customersThrives in an evolving, collaborative environment that values impact over outputWe're excited to meet you!This role is located on-site in Ottawa, Ontario.At Gadget, we value diversity and equity in everything we do. We strongly encourage applications from Indigenous peoples, racialized people, people with disabilities, members of the 2SLGBTQIA+ community, and/or people with intersectional identities. We believe that different perspectives make us better, so please consider applying even if your experience doesn't exactly match the job description. Gadget is committed to fostering an inclusive environment for everyone on our team, and we are happy to discuss any accommodations you may need throughout the hiring process.\n      "},
{"role": "Full Stack Developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Job DescriptionSpringbig is the leading SaaS marketing technology platform serving retailers and brands in the rapidly growing cannabis industry throughout the U.S. and Canada. We serve in excess of 1,000 clients across 2,300 locations and our clients communications using the Springbig platform access more than 37 million consumers making Springbig the leading company in our sector. We have been ranked in the top 100 fastest growing companies in the prestigious Inc.5000 list for two consecutive years, ranking 69th in the recently released 2021 list.Springbig also has its Brands platform - this is also a SaaS platform, and it allows cannabis brands to collaborate with our dispensary clients to send engaging SMS campaigns to the dispensary’s database of consumers. A brand can use this platform to place an advertisement on top of hundreds of thousands of text messages and drive their products’ sell-through like never before! This gives brands direct access to consumers in a way they’ve never had before and an unprecedented reporting on campaign attribution.Our headquarters are in Boca Raton, FL where the majority of our 130 employees are located, and we have additional office locations in Seattle, WA and Toronto, Canada.Position Overview:The Full Stack Developer’s job duties will include producing scalable software solutions as part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. You should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. You should also be a team player with a knack for visual design and utility. If you’re also familiar with Agile methodologies, we’d like to meet you.Roles and Responsibilities:Work with development teams and product managers to ideate software solutionsDesign client-side and server-side architectureBuild the front-end of applications through appealing visual designDevelop and manage well-functioning databases and applicationsWrite effective APIsTest software to ensure responsiveness and efficiencyTroubleshoot, debug and upgrade softwareCreate security and data protection settingsBuild features and applications with a mobile responsive designWrite technical documentationWork with data scientists and analysts to improve softwareRequirements:Proven experience as a Full Stack Developer or similar roleExperience developing web and mobile applicationsExpert knowledge of HTML, CSS, and JavaScript.Expert knowledge of a modern JavaScript Front-End Framework (Vue.JS or React.JS)Expert knowledge of Ruby on Rails or Node.JSExpert knowledge of GIT version control.Solid understanding of databases and fluent in SQL (we use PostgreSQL)Proficient with unit testing (experience with JS frameworks such as Jest or Mocha is preferred)Excellent communication and teamwork skillsGreat attention to detailOrganizational skillsAn analytical mindDegree in Computer Science, Statistics or relevant field preferredOur current stack: Rails, Backbone.js, RSpec, AWSWhat are we looking for in a team member?Your specialization is just as important as your ability to learn fast, communicate and adapt to shifting priorities.We’re especially fond of people who:Communicate well and articulate ideas clearly.Focus on project goals!Contribute ideas.Take initiative. What’s it like to work at springbig?It’s awesome! We’re a driven, passionate, responsible group who values professional growth and work life balance. Why you should work with us:We are a fun start-up, with a start-up culture.Our company is continually growing and always innovating and creating new features for ourselves and our clients.Company atmosphere is collaborative, passionate and fun.Casual dress codeWork with some of the best &amp; brightest technical minds in the industry! We learn from and share knowledge with each other every day.And infuse lightness and creativity into our days:Stocked coffee, snacks and candy “bar”Pizza parties and team lunchesLaser Tag in the officeSpontaneous games of tabletop cornhole or NERF warsCompany sponsored Fantasy Football league and March Madness bracket challenge.Ready to apply?Apply online atPowered by JazzHRjElEBD0tDg\n      "},
{"role": "Web Developer", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        Hey there! We’re Relish, and we create high quality, high value games, websites, and web applications, with a human touch. Check out some our recent projects here: https://reli.shWe’re looking for a Web Developer with full-time availability to support ongoing projects.Who are you?You have four (4) or more years of paid experience (i.e. not side-projects or school projects) as an Intermediate Web Developer building websites and/or web applications from the ground upYou have the ability to take an idea from inception to delivery, writing efficient, readable, well-tested code to accomplish tasks and solve technical problems. You have a proven track record of focusing on hitting deadlines and resolving customer concernsYou’re confident in your creativity and ability, willing to have your ideas built upon, and are pumped to work with design and product teams to create web experiences our clients will loveYou help increase the quality of our code through attention to detail in pull requests and refactoring, and you are a constant learningYou are primarily focused on front-end development (HTML, CSS, Javascript), but are comfortable working with PHP templates, getting into the database a little bit, working with or even creating basic REST api’s. You are full-stack, with a slant towards the presentation layerYou’ve worked extensively with React or Vue.js, you’ve build static websites, worked with a variety of CMS’, are comfortable with Node.jsYou’ve worked on Wordpress websites and know the in’s and out’s of building them - maybe you’ve even regularly used Advanced Custom Fields to build all kinds of custom post typesExperience with any of these is a bonus: Laravel, Typescript, Firebase, Next.js, Cypress/PlaywrightWhat would my day look like?You’ll report to a Project Producer, and work on all aspects of development from the frontend to the backend, in collaboration with designers, DevOps, and QAYou’ll work closely with Senior Web Developers and an Associate Technical Director to bring designs to life using the appropriate tech stack for the projectFrom concept through launch, you’ll dive in and support product development including task time estimation, coding, asset management, testing, and debuggingYou’ll support and help grow our people, processes, and frameworks in ways that benefit everyoneYou’ll participate in code reviews, pair-programming, project reviews, API design reviews, technical reviews of product stories with in-depth yet constructive criticism; and give and take feedbackYeah, I want in! How do we get started?We thought you would. We need to see or read some evidence of your development experience and how you’ve made an impact on other teams. Apply today and your application will be reviewed by a member of our team! Please be sure to include a link to your demo reel in your application!Important to know: This opportunity is only available to those eligible to work in Canada. Our entire team is working fully remotely, but we do have an office space in Toronto, ON &amp; Duncan, BC that you're able to work at if its preferred.\n      "},
{"role": "Full-Stack Software Developer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        This could be either a remote or hybrid position.eCapital supports small and mid-sized companies throughout the United States, Canada, and the United Kingdom by providing alternative financial solutions like invoice factoring, factoring lines of credit, and asset-based lending to accelerate their access to capital. Through its Commercial Finance and Freight Factoring divisions and its portfolio company Gerber Finance, Inc., eCapital offers capital solutions to 80+ industries. eCapital is an innovative leader in providing flexible, customized cash flow to businesses. We truly love to help our clients grow and this is a position where you can grow too!The Opportunity:eCapital is looking for aFull-Stack Software Developerto design, build and support cloud-native enterprise and consumer solutions. This is an excellent opportunity to be part of acollaborative, creative, and metrics-based team whose goal is to increase performance and revenue for the company.What you will do:Participate in a cross-functional Agile teamDesign system and software architecturesDevelop visually appealing front-end apps by translating UI/UX designs into front-end codeDevelop APIs and servicesDevelop large-scale solutions for data processing and storageDevelop and maintain CI/CD pipelinesAssist with the training and leveraging of custom AI modelsWhat you need:University Degree in Computer Science or Computer EngineeringExperience with end-to-end development of full-stack solutionsExperience with cloud servicesExperience with database technologies such as MSSQL, MySQL, or MongoDBExperience with back-end frameworks such as .NET Core or ExpressExcellent problem-solving skillsExcellent written and verbal communication skillsAbility to work under pressure while meeting deadlinesStrong organizational skillsExceptional attention to detailMust be a team player!What you will get:We are a growing organization that thrives on delivering trusted financial services to help our clients succeed. Joining us will allow you to:Work in a dynamic, collaborative, progressive, and high-performing teamOpportunities to do challenging work and growMake a difference and lasting impact\n      "},
{"role": "Software Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        There are people who say some ideas are impossible, unattainable, or unrealistic. Then there are those of us who work at Martin Rotary and Mission Systems. As a part of the Martin community, we take on the biggest, baddest challenges in the world and find solutions using creativity and collaboration. And where the solutions don’t exist? We invent them.So, if you’re looking for the challenge of a lifetime and a team of the brightest minds in the world, Rotary and Mission Systems Rotary and Mission Systems, is the place for you. If you’re looking for a place where learning is a way of life, Rotary and Mission Systems is the place for you. And if you’re looking for a career that’s just as fun as it is hard work, well…you know.Join us today and let’s make a difference together.Only here are you Mission Critical!These are just some of the exciting Software Engineering roles available: and/orFull Stack Engineer/Cloud InfrastructureSoftwareSoftware Test EngineerRMS Locations:Moorestown/Mt. Laurel, NJKing of Prussia, PALiverpool/Syracuse, NYOwego, NYOrlando/Palm Beach, FLHuntsville, ALLittleton/Colorado Springs, COManassas, VAAnnapolis Junction/Hanover, MDConnecticutBothell, WAWe Offer 4-Day Work Week Generous relocation packages to help with the move With locations across the US, Martin has endless career growth and development opportunities and your expertise can support the most important work in the nation Comprehensive benefits package that includes health, dental, vision, etc. starting Day 1 Lucrative 401k program Work/ Life Balance with a generous PTO program\n      "},
{"role": "Software Engineer", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        By applying for this role you will be considered for enterprise wide opportunities within Lockheed Martin for the same or similar skill set.There are people who say some ideas are impossible, unattainable, or unrealistic. Then there are those of us who work at Lockheed Martin Rotary and Mission Systems. As a part of the Lockheed Martin community, we take on the biggest, baddest challenges in the world and find solutions using creativity and collaboration. And where the solutions don’t exist? We invent them.So, if you’re looking for the challenge of a lifetime and a team of the brightest minds in the world, Rotary and Mission Systems Rotary and Mission Systems, is the place for you. If you’re looking for a place where learning is a way of life, Rotary and Mission Systems is the place for you. And if you’re looking for a career that’s just as fun as it is hard work, well…you know.Join us today and let’s make a difference together.Only here are you Mission Critical!These are just some of the exciting Software Engineering roles available: Java and/or C++ Developer Full Stack Engineer DevOps/DevSecOps Cloud Infrastructure Software Architect Software Test EngineerRMS Locations may include:Moorestown/Mt. Laurel, NJKing of Prussia, PALiverpool/Syracuse, NYOwego, NYOrlando/Palm Beach, FLHuntsville, ALLittleton/Colorado Springs, COManassas, VAAnnapolis Junction/Hanover, MDConnecticutBothel, WAWe Offer 4 Day Work Week Generous Relocation packages to help with the move With locations across the US, Lockheed Martin has endless career growth and development opportunities and your expertise can support the most important work in the nation Comprehensive benefits package that includes health, dental, vision, etc. starting Day 1 Lucrative 401k program Work/ Life Balance with generous PTO program\n      "},
{"role": "Web Developer", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Design Match is searching for a skilled Web Developer to join our team. As a Web Developer, you will play a crucial role in designing, developing, and maintaining our web presence, ensuring a seamless user experience and delivering high-quality web solutions.ResponsibilitiesCollaborate with cross-functional teams to gather requirements and understand project objectives.Design and implement user interfaces with a focus on aesthetics and functionality.Develop and maintain web applications with a strong emphasis on responsiveness and compatibility.Conduct rigorous testing to ensure optimal performance and identify areas for improvement.Stay updated with the latest web development trends and technologies.RequirementsProven experience as a Web Developer or related role.Proficiency in web development technologies such as HTML, CSS, JavaScript, and front-end frameworks.Understanding of back-end technologies and server-side development (e.g., Node.js, PHP, ASP.NET).Familiarity with content management systems (CMS) is a plus.Excellent problem-solving and communication skills.If you are enthusiastic about creating visually appealing and functional web experiences, we'd love to have you on our team!\n      "},
{"role": "Full stack Developer (React JS, Redux)-Canada", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Role: Full stack Developer (React JS, Redux)Location: Remote/CanadaDuration: 12+ MonthsThey're looking for Frontend heavy with backend experienceFront end: React JS, Redux, GraphQLBackend: Java, Spring bootDatabase: PostgreSQLConcepts: design systems, widgets, plugin, composition patterns, react hooks, caching, infrastructure, error handling, standards on error codes, performance, user interactionsNice to have: React Context (state management).\n      "},
{"role": "Software Engineer - Front End", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        We believe small businesses are at the heart of our communities, and championing them is worth fighting for. We empower small business owners to manage their finances fearlessly, by offering the simplest, all-in-one financial management solution they can't live without.About the Engineering Team:We aim to meaningfully improve the lives of small business owners, who are traditionally under-served and often struggle because of this. At Wave, you won’t just write code—you’ll build high-quality systems at scale. This means being involved in the research, design, and organizational and maintenance practices behind our wide range of applications, which are relied upon by tens of thousands of small business owners. You won’t find many hardcore specialists here. Most Wave engineers are willing and able to dive into different technologies to get the job done. This requires curiosity, openness to new ideas and perspectives, and a genuine interest in what makes software products tick.About The Role:As a Software Engineer in the Front-end domain, you will join one of the many cross-functional engineering teams to work alongside Product, Design and other developers to build software to solve exciting business challenges. You will work with some fantastic engineers to solve tough problems in delivering world-class financial products to our customers at scale. You will bring your front-end skills to bear on making our React and ReactNative apps scale better and stay ahead of these quickly evolving ecosystem, helping the teams around also contribute better code by laying good React/ReactNative standards and building solid interfaces and reusable utilities and libraries that make everyone's lives better. You will be exposed to a wide variety of technologies and help investigate new ones as we are constantly striving to keep our technology choices up to date. As an engineering team, we deeply care about being the best in our craft - Performance, Reliability, Reusability, Code Quality, Test Coverage, and Observability. You will help maintain the current bar we have but will hopefully go on to raise it to the next level.Here’s What You Should Know About Engineering at Wave:Our Technology: Wave is powered by several key technologies. Our web/mobile toolkit where you'll be working is primarily React and ReactNative with Typescript and Javascript. Our APIs are GraphQL and REST powered by services written in Python and Django, as well as Rails and Golang. We expect software developers working on the front-end to have enough familiarity with API development to be able to collaborate with back-end developers to devise solutions to product challenges, and to contribute to code on the API layer when neededYour Work Will Matter: Every engineer at Wave is tasked with solving meaty, meaningful challenges for a really important end-user - our small business owners. The code you write will make a difference, guaranteedWe Are a Community: Wave is about the size of a small neighbourhood. It is possible to get to know everyone on a personal basis. If you’re trying to solve a hard problem that has roots in some other part of the company, odds are pretty good that you’ll find someone close by who can help you outYou Will be Stretched: We’re big on transparency and we know Wave isn’t for everyone. However, if you’re ready to flex your creativity, excel at your craft, fuel your curiosity, and thrive in a dynamic environment, we’re confident you’ll love being a WaverWorking at Wave:Work From Where You Work Best: We will always have a welcoming, energizing, and world-class office (in Toronto) with a space for you. Or, if you’re more comfortable working from home, the choice is yoursWe Care About Future You: You will stretch yourself and you will grow at Wave. You will also be supported on this journey with diverse learning experiences, educational allowances, mentorship, and so much moreWe Support the Full You: We make a serious investment in your health &amp; wellness. When we think about benefits we think about body, mind, &amp; soul and we take this stuff very seriously. We Take Care of the Fundamentals: Fair compensation, all the office perks you’d want, and the various goodies you’d expect from a growing tech company. This is the obvious stuff, but we don’t want you to think we forgot!At Wave, you’re treated like the incredible human being you are.Work From Where You Work Best: We will always have a welcoming, energizing, and world-class office (in Toronto) with a space for you. Or, if you’re more comfortable working from home, the choice is yours.We Care About Future You: You will stretch yourself and you will grow at Wave. You will also be supported on this journey with diverse learning experiences, educational allowances, mentorship, and so much more.We Support the Full You: We make a serious investment in your health &amp; wellness. When we think about benefits we think about body, mind, &amp; soul and we take this stuff very seriously.We Take Care of the Fundamentals: Fair compensation, all the office perks you’d want, and the various goodies you’d expect from a growing tech company. This is the obvious stuff, but we don’t want you to think we forgot!We believe that a diverse and inclusive culture creates the best workplace. We embrace our differences, value individuality, and the broad spectrum of every Waver's skills and abilities. We challenge each other from a place of respect and pursuit of continuous growth. We trust each other and encourage everyone to bring their authentic selves to work, everyday. As Wavers, our voices matter, our opinions are met with an open mind. The best ideas win, no matter whose they are. Contributing to an inclusive culture is a part of all of our job descriptions.We’ve been continuously recognized as one of Canada's Top Ten Most Admired Corporate Cultures and one of Canada’s Great Places to Work in categories including Technology, Millennials, Mental Health, Inclusion and Women.Are you ready to be a Waver? Join us!\n      "}