[
{"role": "Junior React Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 1, "job_description": ["Develop and implement user interfaces for web applications using React.js and related technologies.", "Collaborate with designers and back-end developers to ensure seamless integration of front-end and back-end components.", "Optimize web applications for maximum speed and scalability.", "Ensure the technical feasibility of UI/UX designs and provide input on design feasibility and potential enhancements.", "Participate in code reviews and provide constructive feedback to team members.", "Stay up-to-date with the latest industry trends and technologies to continually improve our development processes and outcomes.", "Troubleshoot and debug issues as they arise and propose solutions to maintain application quality.", "Actively participate in brainstorming sessions and contribute creative ideas to enhance the user experience.", "Bachelors Degree in Computer Science with 1-2 years of industry experience ", "Proficient in React.js and its core principles.", "Strong understanding of JavaScript (ES6+), HTML5, and CSS3.", "Experience with responsive and mobile-first web development.", "Familiarity with RESTful APIs and asynchronous request handling.", "Solid understanding of version control systems, preferably Git.", "Experience with front-end build tools and preprocessors such as Webpack, Babel, SASS/LESS.", "Ability to work collaboratively in a team environment.", "Excellent problem-solving skills and attention to detail.", "Strong communication skills and the ability to explain technical concepts to non-technical team members.", "Experience with testing and debugging tools.", "Bonus: Knowledge of UX/UI design principles and practices.", "Bonus: Familiarity with back-end technologies and frameworks."]},
{"role": "Software Engineering, New Grad", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Work on cross-functional projects, directly collaborating with other engineers", "Give meaningful feedback on code reviews and technical designs", "Ensure that the systems your team operates continue running well and can scale to meet the needs of our users", "Build the skills to own a project from beginning to end, learning project management and technical leadership skills", "A Bachelor’s, Master’s, or PhD degree in computer science or a directly related field, obtained by summer 2024, or equivalent work experience", "Some experience and familiarity with programming, either through side projects or classwork. We work mostly in Java, Ruby, JavaScript, Scala, and Go. We believe new programming languages can be learned if the fundamentals and general knowledge are present", "Experience from either previous internships or working collaboratively on multi-person coding projects (in a university or professional setting)", "Ability to learn unfamiliar systems and form an understanding of those systems, through independent research and working with a mentor and subject matter experts", "One or more areas of specialized knowledge balanced with general skills and knowledge, such as knowing more frontend technologies and, at a high level, how a service handles an HTTP request", "Experience in code review practices, and an understanding of how to safely update production systems", "Familiarity with navigating and managing work in large code bases"]},
{"role": "Software Engineer ( All Levels)", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Music is Everything: Music is our passion, and we can never get enough. Tastes, trends, and tech will change, but great artists and songwriters will always be our driving force.", "Global Growth, Local Expertise: Music is a global language. Through communication and collaboration, our success can come from anywhere and translate everywhere.", "Innovation and Insight: Pushing the boundaries requires the best information and the boldest imagination. We use both to create the future.", "Empowered by People: Like the artists we serve and the music they make, our differences make us stronger. This is a place where every talent can belong and build a career.", "Junior Engineers ", "Senior Engineers ", "Staff+ Engineers", "Owning, defining the technical vision, and driving innovation for key technical systems", "Mentoring for junior engineers and mentorship opportunities for senior engineers", "Collaborating closely with key music industry stakeholders as well as colleagues in NYC, Los Angeles, and London", "Reimagine and implement the future of tech for the music industry ", "Work as part of a dynamic and highly effective team ", "Own the creation and delivery of highly innovative products ", "Learn and grow as a professional through close collaboration with your team members and engineering leaders, and by being part of culture of continuous improvement and learning", "You’re a curious learner with a desire to grow and contribute to a positive team environment ", "You have a high sense of ownership", "You’re able to deal with ambiguity and working in a fast-paced, evolving environment", "Your bias is towards action, and you always find ways to deliver better solutions more efficiently", "You’re an empathetic team member who works well in a team environment and communicates effectively", "You’re excited about the music business: helping artists and songwriters grow and helping the world hear more great music", "You have a Bachelor’s degree in a relevant discipline or equivalent professional experience"]},
{"role": "Software Developer (All Levels Welcome)", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": []},
{"role": "Frontend Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Have 3+ years of professional programming experience", "Creating software features that are robust, reliable, and user-friendly for our customers", "Experience developing software for the Web platform, including cross-browser compatibility", "Creating software features that are robust, reliable, and user-friendly for both internal teams and our customers", "Experience with modern tools like ES6, React, Redux, Apollo, Flux & Webpack", "Good eye for design and ability to make product decisions.", "You care about men’s health and have a personal connection to the space", "Impact & autonomy. You’ll report directly to the founders who are both senior devs and you'll have a real opportunity to build Phoenix's product", "Cool tools! We use some great software and platforms to deliver the best in care. Need something to make your job easier? We'll work with you to make it happen!", "Rewarding Mission. We're delivering the best healthcare experience to Canadians across the country.", "Fun team, local in Toronto! We are a small elite team in Downtown Toronto. Candidates must be located in the Toronto area."]},
{"role": "Jr. Full Stack JavaScript developer (Ontario Branch)", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 2, "job_description": ["use react + node/express to create user interfaces and backend API calls as part of the ongoing effort to modernize our primary product offering", "learn from more senior team members who direct your day-to-day activities", "make meaningful contributions to a product that people rely on in their day-to-day business operations", "grow into a strong developer as you build your lifelong career at Plexxis", "You like people", "You are focused", "You are supportive", "You are driven", "You like to work in a team but are fine working on your own when the occasion calls for it", "You love coding and you love a good challenge", "You know some JavaScript basics", "You know some ReactJS basics, AngularJS basics, or VueJS basics", "You know some NodeJS basics", "Personal projects that demonstrate your love of development", "Developer training of some kind (boot-camp, college, university, etc.)", "Typescript", "OracleDB or any relational database exposure (sql)", "Competitive Salary", "Benefits", "Company gym", "A games room", "Paid after hours", "Work with a small, tight-knit group of hard-working, dedicated and fun individuals", "Enjoy the atmosphere of a rapidly growing, high energy company with an entrepreneurial spirit", "Be on the winning team - poised to emerge as the global leader", "Be challenged in the workspace, in the fitness room or even the billiards Café", "Lose the stuffy environment (and politics) of “big corporate” and focus on delivering what the competition calls “impossible”"]},
{"role": "Backend Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Writing clean, maintainable, and well-documented code using Node.js/Typescript with express for API’s.", "Working with google cloud platform to integrate with Cloud services such as cloudSQL (postgres), cloud storage, and appengine. ", "Design and develop new applications and features, ensuring scalability, performance, and security. ", "Demonstrate high-quality software development practices. This includes participation in all aspects of the design and development of the applications: research, ideation, and strategy.", "Work closely with leadership to understand system requirements and find well-optimized software development solutions in alignment with the production deadlines and goals.", "Proven work history of software development with Node.js/Typescript and Express.", "Strong understanding of Google Cloud Platform.", "Good understanding of API specifications and documentation.", "Strong understanding of web development principles, practices, and design patterns. ", "Familiarity with databases and data modeling specifically postgreSQL with Prisma.", "Capability to write clean, correct, and efficient code.", "High-quality verbal and written communication skills.", "Sense of ownership, urgency, and pride in your work."]},
{"role": "Full Stack Engineer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 1, "job_description": ["Be an early member of the Gadget team, which means lots of opportunity for helping define the vision and direction of the product", "Primarily work with React, Node.js, TypeScript and PostgreSQL", "Be involved in the development of many core primitives as well as high level features to build out the platform", "Report directly to the founders", "Work with and learn from a team of talented engineers who make developer experience their first priority", "Frequently give and accept meaningful feedback", "Own solutions from end to end, managing complexity and engaging directly with stakeholders", "Debug production issues across services and multiple levels of the stack", "Uphold Gadget’s high standards for engineering and product quality", "Has a few years of software development experience", "Already knows or wants to learn deep skills across the entire stack", "Takes delight in crafting ergonomic abstractions that can scale to meet the needs of most developers", "Wants to work with people who encourage you to do your best work and are invested in your growth and development", "Takes pride in working on projects from ideation to delivery, and enjoy seeing your products being used by customers", "Thrives in an evolving, collaborative environment that values impact over output"]},
{"role": "Full Stack Developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 2, "job_description": ["Work with development teams and product managers to ideate software solutions", "Design client-side and server-side architecture", "Build the front-end of applications through appealing visual design", "Develop and manage well-functioning databases and applications", "Write effective APIs", "Test software to ensure responsiveness and efficiency", "Troubleshoot, debug and upgrade software", "Create security and data protection settings", "Build features and applications with a mobile responsive design", "Write technical documentation", "Work with data scientists and analysts to improve software", "Proven experience as a Full Stack Developer or similar role", "Experience developing web and mobile applications", "Expert knowledge of HTML, CSS, and JavaScript.", "Expert knowledge of a modern JavaScript Front-End Framework (Vue.JS or React.JS)", "Expert knowledge of Ruby on Rails or Node.JS", "Expert knowledge of GIT version control.", "Solid understanding of databases and fluent in SQL (we use PostgreSQL)", "Proficient with unit testing (experience with JS frameworks such as Jest or Mocha is preferred)", "Excellent communication and teamwork skills", "Great attention to detail", "Organizational skills", "An analytical mind", "Degree in Computer Science, Statistics or relevant field preferred", "Your specialization is just as important as your ability to learn fast, communicate and adapt to shifting priorities.", "Communicate well and articulate ideas clearly.", "Focus on project goals!", "Contribute ideas.", "Take initiative.", "It’s awesome! We’re a driven, passionate, responsible group who values professional growth and work life balance. ", "We are a fun start-up, with a start-up culture.", "Our company is continually growing and always innovating and creating new features for ourselves and our clients.", "Company atmosphere is collaborative, passionate and fun.", "Casual dress code", "Work with some of the best & brightest technical minds in the industry! We learn from and share knowledge with each other every day.", "Stocked coffee, snacks and candy “bar”", "Pizza parties and team lunches", "Laser Tag in the office", "Spontaneous games of tabletop cornhole or NERF wars", "Company sponsored Fantasy Football league and March Madness bracket challenge."]},
{"role": "Web Developer", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 1, "job_description": ["You have four (4) or more years of paid experience (i.e. not side-projects or school projects) as an Intermediate Web Developer building websites and/or web applications from the ground up", "You have the ability to take an idea from inception to delivery, writing efficient, readable, well-tested code to accomplish tasks and solve technical problems. You have a proven track record of focusing on hitting deadlines and resolving customer concerns", "You’re confident in your creativity and ability, willing to have your ideas built upon, and are pumped to work with design and product teams to create web experiences our clients will love", "You help increase the quality of our code through attention to detail in pull requests and refactoring, and you are a constant learning", "You are primarily focused on front-end development (HTML, CSS, Javascript), but are comfortable working with PHP templates, getting into the database a little bit, working with or even creating basic REST api’s. You are full-stack, with a slant towards the presentation layer", "You’ve worked extensively with React or Vue.js, you’ve build static websites, worked with a variety of CMS’, are comfortable with Node.js", "You’ve worked on Wordpress websites and know the in’s and out’s of building them - maybe you’ve even regularly used Advanced Custom Fields to build all kinds of custom post types", "Experience with any of these is a bonus: Laravel, Typescript, Firebase, Next.js, Cypress/Playwright", "You’ll report to a Project Producer, and work on all aspects of development from the frontend to the backend, in collaboration with designers, DevOps, and QA", "You’ll work closely with Senior Web Developers and an Associate Technical Director to bring designs to life using the appropriate tech stack for the project", "From concept through launch, you’ll dive in and support product development including task time estimation, coding, asset management, testing, and debugging", "You’ll support and help grow our people, processes, and frameworks in ways that benefit everyone", "You’ll participate in code reviews, pair-programming, project reviews, API design reviews, technical reviews of product stories with in-depth yet constructive criticism; and give and take feedback"]},
{"role": "Full-Stack Software Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": []},
{"role": "Full Stack Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 1, "job_description": ["Help execute the product development vision, and assist with the technical landscape for a large-scale construction", "Write maintainable, testable, and performant software in creating the entire platform, end-to-end", "Build reusable code and libraries for future use", "Participate in code review and performing extensive testing to ensure high-quality software", "Implement services using security mechanism such as OAuth, Single Sign On.", "Implement data security processes and methods.", "Clearly document the artifacts to ensure proper knowledge transfer within the team.", "Build and launch products rapidly and iteratively. We ship to production frequently and have a large, active user base.", "Integration of the front-end and back-end aspects of the application", "Communicate clearly and effectively with all members of our team", "Bachelor’s degree in Computer Science or Computer engineering.", "3+ years of software development experience, with a focus on NodeJS(Server-side), ReactJS(Client-side) and HTML", "Experience both authoring and consuming RESTful APIs", "Experience with SQL and database design", "Experience with extensive unit testing experience (preferably using Mocha and Chai)", "Experience with Git/GitHub and GitHub Actions", "Experience with unit/integration/end-to-end/performance testing.", "Experienced in Agile methodologies.", "Strong debugging and troubleshooting skills", "Has a strong working ethic and obeys the code of conduct. Strictly follow the security and quality assurance procedure.", "Must be performance-driven and able to work in a fast-paced environment with tight deadlines.", "Experience with CSS3, SCSS, Flex Box, Bootstrap, Material UI", "Experience with Next.js", "Experience with Typescript", "Experience with in-memory cache (Redis)", "Experience building API using Microservices & Serverless Architecture", "Experience in server management and AWS knowledge", "Experience with Java/Spring Boot", "A Fintech background is an asset"]},
{"role": "Software Engineer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": [" and/or", "Full Stack Engineer", "/", "Cloud Infrastructure", "Software", "Software Test Engineer", " 4-Day Work Week", " Generous relocation packages to help with the move", " With locations across the US, Martin has endless career growth and development opportunities and your expertise can support the most important work in the nation", " Comprehensive benefits package that includes health, dental, vision, etc. starting Day 1", " Lucrative 401k program", " Work/ Life Balance with a generous PTO program"]},
{"role": "Web Developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["Collaborate with cross-functional teams to gather requirements and understand project objectives.", "Design and implement user interfaces with a focus on aesthetics and functionality.", "Develop and maintain web applications with a strong emphasis on responsiveness and compatibility.", "Conduct rigorous testing to ensure optimal performance and identify areas for improvement.", "Stay updated with the latest web development trends and technologies.", "Proven experience as a Web Developer or related role.", "Proficiency in web development technologies such as HTML, CSS, JavaScript, and front-end frameworks.", "Understanding of back-end technologies and server-side development (e.g., Node.js, PHP, ASP.NET).", "Familiarity with content management systems (CMS) is a plus.", "Excellent problem-solving and communication skills."]},
{"role": "Full stack Developer (React JS, Redux)-Canada", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["They're looking for Frontend heavy with backend experience", "Front end: React JS, Redux, GraphQL", "Backend: Java, Spring boot", "Database: PostgreSQL", "Concepts: design systems, widgets, plugin, composition patterns, react hooks, caching, infrastructure, error handling, standards on error codes, performance, user interactions", "Nice to have: React Context (state management)."]},
{"role": "Software Engineer - Front End", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 2, "job_description": ["Our Technology: Wave is powered by several key technologies. Our web/mobile toolkit where you'll be working is primarily React and ReactNative with Typescript and Javascript. Our APIs are GraphQL and REST powered by services written in Python and Django, as well as Rails and Golang. We expect software developers working on the front-end to have enough familiarity with API development to be able to collaborate with back-end developers to devise solutions to product challenges, and to contribute to code on the API layer when needed", "Your Work Will Matter: Every engineer at Wave is tasked with solving meaty, meaningful challenges for a really important end-user - our small business owners. The code you write will make a difference, guaranteed", "We Are a Community: Wave is about the size of a small neighbourhood. It is possible to get to know everyone on a personal basis. If you’re trying to solve a hard problem that has roots in some other part of the company, odds are pretty good that you’ll find someone close by who can help you out", "You Will be Stretched: We’re big on transparency and we know Wave isn’t for everyone. However, if you’re ready to flex your creativity, excel at your craft, fuel your curiosity, and thrive in a dynamic environment, we’re confident you’ll love being a Waver", "Work From Where You Work Best: We will always have a welcoming, energizing, and world-class office (in Toronto) with a space for you. Or, if you’re more comfortable working from home, the choice is yours", "We Care About Future You: You will stretch yourself and you will grow at Wave. You will also be supported on this journey with diverse learning experiences, educational allowances, mentorship, and so much more", "We Support the Full You: We make a serious investment in your health & wellness. When we think about benefits we think about body, mind, & soul and we take this stuff very seriously. ", "We Take Care of the Fundamentals: Fair compensation, all the office perks you’d want, and the various goodies you’d expect from a growing tech company. This is the obvious stuff, but we don’t want you to think we forgot!"]},
{"role": "Full-stack developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["Design overall architecture of the web application", "Developing front end website architecture", "Translate Wireframe responsive HTML/CSS", "Build interactive web pages", "Integrate with App backend", "Designing user interactions on web pages", "Developing back-end website applications", "Implement authentication and authorization", "Set-up backend storage (DynamoDB, RDS) to store user settings", "Design and implement API requests to Data science models", "Ensuring cross-platform optimization for mobile phones", "Working alongside graphic designers for web design features", "Ensuring responsiveness of applications", "Experience working with graphic designers and converting designs to visual elements", "Understanding and implementation of security and data protection"]},
{"role": "Front-end Developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["Collaborate with UX designers to translate wireframes and prototypes into interactive web interfaces.", "Implement responsive and intuitive designs that work seamlessly across various devices.", "Optimize front-end code for performance and efficiency.", "Stay updated with the latest front-end technologies and best practices.", "Conduct code reviews and provide valuable feedback to team members.", "Proven experience as a Front-end Developer or related role.", "Proficiency in HTML, CSS, JavaScript, and front-end frameworks (e.g., React, Angular, or Vue.js).", "Familiarity with design tools such as Sketch or Adobe XD.", "Strong understanding of responsive design principles.", "Excellent problem-solving and communication skills."]},
{"role": "React Front End Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Developing new user-facing features using React and Headless CMS tools ", "Building reusable components and front-end libraries for future use ", "Translating designs and wireframes into high quality code ", "Optimizing components for maximum performance across a vast array of web capable devices and browsers ", "Creating, installing, and maintaining WP sites as a headless CMS ", "Working closely with designers to push the boundaries of what is possible and help define best practices ", "Integrating with a headless CMS and various APIs to deliver a combination of static and dynamic web experiences ", "A proven experience of scaling up products to hundreds of thousands of users while maintaining costs and security of infrastructure", "Thorough understanding of React and its core principles ", "Extensive experience in different web protocols RESTful, WSS, FIX, etc. ", "Experience with different caching mechanisms ", "Experience with different messaging systems/protocols ", "Experience with Jamstack, nextjs", "Ability to work with common CMS systems and frameworks depending on the need – common platforms like WordPress or Squarespace ", "Familiarity with the WordPress API and GraphQL plugins ", "Knowledge of modern authorization mechanisms, such as JSON Web Token ", "Experience with common front-end development tools such as Babel, Webpack, NPM ", "Ability to understand business requirements and translate them into technical requirements ", "Expert in the life cycle of web page/request ", "Deep understanding of web concepts, requests, responses, headers, security, etc. ", "Degree in computer science or equivalent", "Extended Healthcare Plan (Medical, Disability, Dental & Vision) ", "Life Insurance ", "Paid Time Off ", "Training & Development Opportunities ", "Stock Option Plan ", "Bonus – Awards – Gifts ", "Work From Home – Flexible hour ", "Free snacks and drinks at the office"]},
{"role": "Web Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["An outstanding opportunity to drive revenue and break into new markets as you share the company's growth journey.", "A company with an excellent reputation and forward-thinking outlook.", "A fast-paced, dynamic role where no two days are ever the same.", "Ongoing professional training and development.", "A work environment where your initiative and innovation will be rewarded.", "A flexible workplace where work-life balance is actively promoted."]},
{"role": "Software Developer", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 5, "job_description": ["Opportunity to work with one of the most exciting modern software development companies in the world", "Play a big part in the success of Rangle.io. We’re helping shape the Tech scene in Toronto and Amsterdam ; modern web and mobile development across the world", "In the role of Software Developer, you’ll help create and build beautiful software that matters using modern software development best practices (Agile, TDD, Continuous Delivery). As a developer for Rangle.io, you’ll be joining a diverse community of people who are passionate about modern JavaScript and its ability to change the world. You’ll get to work on projects, using the latest JavaScript frameworks building for the web & mobile, working with a tight-knit team of talented individuals", "We work with modern JavaScript across a range of frameworks and technologies, on the client as well as on the server: Angular, React, Vue, NodeJS, TypeScript, ES6, Babel, Redux", "Our approach to making software stresses teamwork and close interaction with our clients. We rely on a well thought-out process based on Scrum, continuous delivery, and test-driven development. This process allows us to build software in a way that sets you up for success, allowing you to exercise your creativity and building software that matters without all the red tape, hierarchy and politics", "We avoid sharply defined roles: everyone gets to partake in all aspects of their project and to try their hand at new things. Our developers do not just develop: they also help our clients think through product features, contribute to design, and test", "We work for many clients in an exciting range of industries: social media, e-commerce, manufacturing, transportation, alternative energy, wellness. Any company that we feel helps make the world a better place", "Solid understanding of JavaScript. (Alternatively: really solid backend experience + some JavaScript + ability to learn JavaScript really fast.)", "5+ years experience in web application development, bonus points if you have experience working directly with clients or a product owner", "Experience with Angular is preferred ", "Bonus points if you have previous experience building apps in Vue", "Great interpersonal skills - we are a close knit team and work together to solve problems", "A desire to follow a software development process that helps you sleep better at night", "Bonus points if you have server side experience", "Bonus points if you have an eye for design. (BTW, all our designers can code.)", "Great problem solver and ability to reinvent oneself - We are always looking at ways we can do things better, sometimes there is no path to follow", "Proactive and self starter - we hire folks that have a deep desire to do better and be better, you won’t be micromanaged in this role. (We want to hear your voice.)", "Passionate about learning - You’ll help identify new technologies and approaches to problems. (Web development and especially JS is always evolving.)"]},
{"role": "Software Developer, New Graduate, 12 month Contract", "seniority_level": "Associate", "employment_type": "Associate", "keyword_count": 1, "job_description": ["Freedom and a healthy work- life balance– Embrace our flexible work environment with flex hours, telecommuting and digital workspaces.", "Solve the world’s most significant problems – Be part of exciting and innovative projects.", "Engaging, challenging, and fast evolving, cutting edge technological environment.", "Opportunities to advance your career and mentorship programs on a local and global scale.", "Competitive total rewards package.", "Profit sharing available.", "Rewarding vacation entitlement with the opportunity to buy and sell your vacation depending on your lifestyle.", "Contribute to our social responsibility initiatives focused on access to education, access to technology and sustaining communities and make a positive impact on the community.", "Participate in our celebrations, social events and offsite business events.", "Opportunities to contribute your innovative ideas and get paid for them!", "Employee perks and discounts.", "Diversity and inclusivity focused.", "Contribute to the entire life cycle of product development including specifications, design, coding, test, production and maintenance", "Develop software codes in C/C++", "Participate actively in development projects, both hardware and software component selection and developing technology for future products", "Be a part of a team that brings advanced telecommunications products to market", "Degree in Computer Science/ Engineering/ Mathematics or related disciplines", "Experience with Linux operating system and environment", "Programming skills in C / C++ and Bash programming in a Linux environment (user and kernel space)", "Experience in developing or modifying and integrating open-source projects (OSS)", "Experience developing with POSIX threads", "Experience with TCP/IP and socket programming", "Software source control tools such as Git, Subversion, etc.", "Experience working on Linux for embedded devices", "Experience with Angular", "Exposure to Databases/data modelling"]},
{"role": "Software Developer – JavaScript & Python", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 3, "job_description": ["Gather requirements from stakeholders and translate them into technical specifications.", "Design and architect scalable and fault-tolerant solutions using AWS distributed computing and storage components.", "Develop new components and enhance existing functionality for our Healthcare Touchpoint Exchange.", "Design and implement software solutions using JavaScript and Python.", "Model and develop data structures using JSON, XML, and databases.", "Take ownership of projects, ensuring timely delivery and meeting project requirements.", "Collaborate with cross-functional teams to define overall concepts for new product features and components.", "Continuously optimize and improve the performance and scalability of the software solutions.", "Bachelor’s Degree in Computer Science, Computer Engineering, or a related field.", "3+ years of experience in JavaScript and Python development.", "Experience with other programming languages is a plus.", "Strong experience in gathering requirements, designing, and architecting software solutions.", "Proficient in using GitHub/Gitlab for project collaboration and managing source code.", "Experience with distributed computing and storage systems is required.", "Demonstrated ability to solve complex problems in fast-paced environments.", "Excellent communication skills and the ability to articulate complex ideas and concepts.", "Strong time management skills with a proven ability to prioritize and meet strict deadlines.", "Self-driven and motivated to learn and improve.", "Prior experience with Medicare Advantage benefits is a plus."]},
{"role": "Full Stack Engineer", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 2, "job_description": ["Building web applications using ReactJS, NextJS, NodeJS, Typescript and a MariaDB database on an AWS infrastructure", "Collaborating closely with Engineers, CTO and Product Management to integrate different systems through APIs and provide a coherent user experience across our sites and tools, adapting to each type of user we work with", "Designing and developing back-end services using an API-first approach and REST, following clean code and hexagonal architecture principles", "Producing reusable components, playbooks and libraries for future use", "Participating in code reviews, sprint planning and retrospectives to develop and maintain a quality codebase", "Translating designs into beautiful user interfaces that offer a coherent and valuable experience for our customers and internal users", "Mentoring and knowledge sharing with other team members, learning from them too", "You’re a Full Stack Engineer with experience shipping multiple features and products", "You have solid Javascript knowledge and are excited to adapt to new frameworks, technologies and tools", "You have the ability to work with distributed systems, APIs, and Relational Databases", "You understand engineering principles and coding best practices, and you’re able to write clean code with scalability in mind", "Your communication style is concise, and you’re able to break down technical concepts to non-technical team members", "1: 30-minute Phone screen with Emma Hunt (Head of People and Culture)", "2: 60-minute Virtual Interview with Bryan McEire (CTO)", "3: Technical take-home exercise", "4: 60-minute exercise walkthrough and Q&A with Alejandro Castillo (Head of Engineering) and Nick Chinsen (Senior Full Stack Engineer)", "5. 30-minute Cultural interview with Max Birner (CEO)", "5: Reference Check & Offer 🥳 ", "Highly competitive salary depending on experience", "Stock Options", "Fantastic opportunity to help build and grow with a funded company at an early stage", "4 weeks of annual vacation", "Comprehensive healthcare benefits plan, including dental & vision & spending account", "Free access to Maple and Headspace apps", "A monthly transportation allowance", "Flexible working hours in a hybrid environment - we work remotely 2 days a week", "Join a multicultural team that has built successful startups around the world"]},
{"role": "Frontend Engineer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 2, "job_description": ["Build reliable, scalable and performant user experiences using modern tools like React, TypeScript, Jest and Webpack", "Help define a scalable front-end architecture, advise other teams internally and also encourage best practices", "Provide technical leadership to more junior engineers on your team", "Get problem statements from designers and product managers, break projects into substantial tasks, and deliver the project with metrics and data with fellow engineers", "3+ years of industry web frontend development experience with modern JavaScript tooling (React, Redux or equivalent, and so on)", "Strong understanding of HTML, CSS, JavaScript, and related web technologies", "Experience working with react or node.js applications", "Experience with unit and integration testing", "Good written, verbal communication skills", "Great team player", "Go", "GraphQL", "Node.js", "React", "Python", "Cassandra", "Redis", "Terraform", "Docker", "Kubernetes", "AWS", "Kafka", "Envoy"]},
{"role": "Junior React Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 1, "job_description": ["Develop and implement user interfaces for web applications using React.js and related technologies.", "Collaborate with designers and back-end developers to ensure seamless integration of front-end and back-end components.", "Optimize web applications for maximum speed and scalability.", "Ensure the technical feasibility of UI/UX designs and provide input on design feasibility and potential enhancements.", "Participate in code reviews and provide constructive feedback to team members.", "Stay up-to-date with the latest industry trends and technologies to continually improve our development processes and outcomes.", "Troubleshoot and debug issues as they arise and propose solutions to maintain application quality.", "Actively participate in brainstorming sessions and contribute creative ideas to enhance the user experience.", "Bachelors Degree in Computer Science with 1-2 years of industry experience ", "Proficient in React.js and its core principles.", "Strong understanding of JavaScript (ES6+), HTML5, and CSS3.", "Experience with responsive and mobile-first web development.", "Familiarity with RESTful APIs and asynchronous request handling.", "Solid understanding of version control systems, preferably Git.", "Experience with front-end build tools and preprocessors such as Webpack, Babel, SASS/LESS.", "Ability to work collaboratively in a team environment.", "Excellent problem-solving skills and attention to detail.", "Strong communication skills and the ability to explain technical concepts to non-technical team members.", "Experience with testing and debugging tools.", "Bonus: Knowledge of UX/UI design principles and practices.", "Bonus: Familiarity with back-end technologies and frameworks."]},
{"role": "Software Engineering, New Grad", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Work on cross-functional projects, directly collaborating with other engineers", "Give meaningful feedback on code reviews and technical designs", "Ensure that the systems your team operates continue running well and can scale to meet the needs of our users", "Build the skills to own a project from beginning to end, learning project management and technical leadership skills", "A Bachelor’s, Master’s, or PhD degree in computer science or a directly related field, obtained by summer 2024, or equivalent work experience", "Some experience and familiarity with programming, either through side projects or classwork. We work mostly in Java, Ruby, JavaScript, Scala, and Go. We believe new programming languages can be learned if the fundamentals and general knowledge are present", "Experience from either previous internships or working collaboratively on multi-person coding projects (in a university or professional setting)", "Ability to learn unfamiliar systems and form an understanding of those systems, through independent research and working with a mentor and subject matter experts", "One or more areas of specialized knowledge balanced with general skills and knowledge, such as knowing more frontend technologies and, at a high level, how a service handles an HTTP request", "Experience in code review practices, and an understanding of how to safely update production systems", "Familiarity with navigating and managing work in large code bases"]},
{"role": "Software Engineer ( All Levels)", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Music is Everything: Music is our passion, and we can never get enough. Tastes, trends, and tech will change, but great artists and songwriters will always be our driving force.", "Global Growth, Local Expertise: Music is a global language. Through communication and collaboration, our success can come from anywhere and translate everywhere.", "Innovation and Insight: Pushing the boundaries requires the best information and the boldest imagination. We use both to create the future.", "Empowered by People: Like the artists we serve and the music they make, our differences make us stronger. This is a place where every talent can belong and build a career.", "Junior Engineers ", "Senior Engineers ", "Staff+ Engineers", "Owning, defining the technical vision, and driving innovation for key technical systems", "Mentoring for junior engineers and mentorship opportunities for senior engineers", "Collaborating closely with key music industry stakeholders as well as colleagues in NYC, Los Angeles, and London", "Reimagine and implement the future of tech for the music industry ", "Work as part of a dynamic and highly effective team ", "Own the creation and delivery of highly innovative products ", "Learn and grow as a professional through close collaboration with your team members and engineering leaders, and by being part of culture of continuous improvement and learning", "You’re a curious learner with a desire to grow and contribute to a positive team environment ", "You have a high sense of ownership", "You’re able to deal with ambiguity and working in a fast-paced, evolving environment", "Your bias is towards action, and you always find ways to deliver better solutions more efficiently", "You’re an empathetic team member who works well in a team environment and communicates effectively", "You’re excited about the music business: helping artists and songwriters grow and helping the world hear more great music", "You have a Bachelor’s degree in a relevant discipline or equivalent professional experience"]},
{"role": "Software Developer (All Levels Welcome)", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": []},
{"role": "Frontend Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Have 3+ years of professional programming experience", "Creating software features that are robust, reliable, and user-friendly for our customers", "Experience developing software for the Web platform, including cross-browser compatibility", "Creating software features that are robust, reliable, and user-friendly for both internal teams and our customers", "Experience with modern tools like ES6, React, Redux, Apollo, Flux & Webpack", "Good eye for design and ability to make product decisions.", "You care about men’s health and have a personal connection to the space", "Impact & autonomy. You’ll report directly to the founders who are both senior devs and you'll have a real opportunity to build Phoenix's product", "Cool tools! We use some great software and platforms to deliver the best in care. Need something to make your job easier? We'll work with you to make it happen!", "Rewarding Mission. We're delivering the best healthcare experience to Canadians across the country.", "Fun team, local in Toronto! We are a small elite team in Downtown Toronto. Candidates must be located in the Toronto area."]},
{"role": "Jr. Full Stack JavaScript developer (Ontario Branch)", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 2, "job_description": ["use react + node/express to create user interfaces and backend API calls as part of the ongoing effort to modernize our primary product offering", "learn from more senior team members who direct your day-to-day activities", "make meaningful contributions to a product that people rely on in their day-to-day business operations", "grow into a strong developer as you build your lifelong career at Plexxis", "You like people", "You are focused", "You are supportive", "You are driven", "You like to work in a team but are fine working on your own when the occasion calls for it", "You love coding and you love a good challenge", "You know some JavaScript basics", "You know some ReactJS basics, AngularJS basics, or VueJS basics", "You know some NodeJS basics", "Personal projects that demonstrate your love of development", "Developer training of some kind (boot-camp, college, university, etc.)", "Typescript", "OracleDB or any relational database exposure (sql)", "Competitive Salary", "Benefits", "Company gym", "A games room", "Paid after hours", "Work with a small, tight-knit group of hard-working, dedicated and fun individuals", "Enjoy the atmosphere of a rapidly growing, high energy company with an entrepreneurial spirit", "Be on the winning team - poised to emerge as the global leader", "Be challenged in the workspace, in the fitness room or even the billiards Café", "Lose the stuffy environment (and politics) of “big corporate” and focus on delivering what the competition calls “impossible”"]},
{"role": "Backend Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Writing clean, maintainable, and well-documented code using Node.js/Typescript with express for API’s.", "Working with google cloud platform to integrate with Cloud services such as cloudSQL (postgres), cloud storage, and appengine. ", "Design and develop new applications and features, ensuring scalability, performance, and security. ", "Demonstrate high-quality software development practices. This includes participation in all aspects of the design and development of the applications: research, ideation, and strategy.", "Work closely with leadership to understand system requirements and find well-optimized software development solutions in alignment with the production deadlines and goals.", "Proven work history of software development with Node.js/Typescript and Express.", "Strong understanding of Google Cloud Platform.", "Good understanding of API specifications and documentation.", "Strong understanding of web development principles, practices, and design patterns. ", "Familiarity with databases and data modeling specifically postgreSQL with Prisma.", "Capability to write clean, correct, and efficient code.", "High-quality verbal and written communication skills.", "Sense of ownership, urgency, and pride in your work."]},
{"role": "Full Stack Engineer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 1, "job_description": ["Be an early member of the Gadget team, which means lots of opportunity for helping define the vision and direction of the product", "Primarily work with React, Node.js, TypeScript and PostgreSQL", "Be involved in the development of many core primitives as well as high level features to build out the platform", "Report directly to the founders", "Work with and learn from a team of talented engineers who make developer experience their first priority", "Frequently give and accept meaningful feedback", "Own solutions from end to end, managing complexity and engaging directly with stakeholders", "Debug production issues across services and multiple levels of the stack", "Uphold Gadget’s high standards for engineering and product quality", "Has a few years of software development experience", "Already knows or wants to learn deep skills across the entire stack", "Takes delight in crafting ergonomic abstractions that can scale to meet the needs of most developers", "Wants to work with people who encourage you to do your best work and are invested in your growth and development", "Takes pride in working on projects from ideation to delivery, and enjoy seeing your products being used by customers", "Thrives in an evolving, collaborative environment that values impact over output"]},
{"role": "Full Stack Developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 2, "job_description": ["Work with development teams and product managers to ideate software solutions", "Design client-side and server-side architecture", "Build the front-end of applications through appealing visual design", "Develop and manage well-functioning databases and applications", "Write effective APIs", "Test software to ensure responsiveness and efficiency", "Troubleshoot, debug and upgrade software", "Create security and data protection settings", "Build features and applications with a mobile responsive design", "Write technical documentation", "Work with data scientists and analysts to improve software", "Proven experience as a Full Stack Developer or similar role", "Experience developing web and mobile applications", "Expert knowledge of HTML, CSS, and JavaScript.", "Expert knowledge of a modern JavaScript Front-End Framework (Vue.JS or React.JS)", "Expert knowledge of Ruby on Rails or Node.JS", "Expert knowledge of GIT version control.", "Solid understanding of databases and fluent in SQL (we use PostgreSQL)", "Proficient with unit testing (experience with JS frameworks such as Jest or Mocha is preferred)", "Excellent communication and teamwork skills", "Great attention to detail", "Organizational skills", "An analytical mind", "Degree in Computer Science, Statistics or relevant field preferred", "Your specialization is just as important as your ability to learn fast, communicate and adapt to shifting priorities.", "Communicate well and articulate ideas clearly.", "Focus on project goals!", "Contribute ideas.", "Take initiative.", "It’s awesome! We’re a driven, passionate, responsible group who values professional growth and work life balance. ", "We are a fun start-up, with a start-up culture.", "Our company is continually growing and always innovating and creating new features for ourselves and our clients.", "Company atmosphere is collaborative, passionate and fun.", "Casual dress code", "Work with some of the best & brightest technical minds in the industry! We learn from and share knowledge with each other every day.", "Stocked coffee, snacks and candy “bar”", "Pizza parties and team lunches", "Laser Tag in the office", "Spontaneous games of tabletop cornhole or NERF wars", "Company sponsored Fantasy Football league and March Madness bracket challenge."]},
{"role": "Web Developer", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 1, "job_description": ["You have four (4) or more years of paid experience (i.e. not side-projects or school projects) as an Intermediate Web Developer building websites and/or web applications from the ground up", "You have the ability to take an idea from inception to delivery, writing efficient, readable, well-tested code to accomplish tasks and solve technical problems. You have a proven track record of focusing on hitting deadlines and resolving customer concerns", "You’re confident in your creativity and ability, willing to have your ideas built upon, and are pumped to work with design and product teams to create web experiences our clients will love", "You help increase the quality of our code through attention to detail in pull requests and refactoring, and you are a constant learning", "You are primarily focused on front-end development (HTML, CSS, Javascript), but are comfortable working with PHP templates, getting into the database a little bit, working with or even creating basic REST api’s. You are full-stack, with a slant towards the presentation layer", "You’ve worked extensively with React or Vue.js, you’ve build static websites, worked with a variety of CMS’, are comfortable with Node.js", "You’ve worked on Wordpress websites and know the in’s and out’s of building them - maybe you’ve even regularly used Advanced Custom Fields to build all kinds of custom post types", "Experience with any of these is a bonus: Laravel, Typescript, Firebase, Next.js, Cypress/Playwright", "You’ll report to a Project Producer, and work on all aspects of development from the frontend to the backend, in collaboration with designers, DevOps, and QA", "You’ll work closely with Senior Web Developers and an Associate Technical Director to bring designs to life using the appropriate tech stack for the project", "From concept through launch, you’ll dive in and support product development including task time estimation, coding, asset management, testing, and debugging", "You’ll support and help grow our people, processes, and frameworks in ways that benefit everyone", "You’ll participate in code reviews, pair-programming, project reviews, API design reviews, technical reviews of product stories with in-depth yet constructive criticism; and give and take feedback"]},
{"role": "Full-Stack Software Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": []},
{"role": "Full Stack Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 1, "job_description": ["Help execute the product development vision, and assist with the technical landscape for a large-scale construction", "Write maintainable, testable, and performant software in creating the entire platform, end-to-end", "Build reusable code and libraries for future use", "Participate in code review and performing extensive testing to ensure high-quality software", "Implement services using security mechanism such as OAuth, Single Sign On.", "Implement data security processes and methods.", "Clearly document the artifacts to ensure proper knowledge transfer within the team.", "Build and launch products rapidly and iteratively. We ship to production frequently and have a large, active user base.", "Integration of the front-end and back-end aspects of the application", "Communicate clearly and effectively with all members of our team", "Bachelor’s degree in Computer Science or Computer engineering.", "3+ years of software development experience, with a focus on NodeJS(Server-side), ReactJS(Client-side) and HTML", "Experience both authoring and consuming RESTful APIs", "Experience with SQL and database design", "Experience with extensive unit testing experience (preferably using Mocha and Chai)", "Experience with Git/GitHub and GitHub Actions", "Experience with unit/integration/end-to-end/performance testing.", "Experienced in Agile methodologies.", "Strong debugging and troubleshooting skills", "Has a strong working ethic and obeys the code of conduct. Strictly follow the security and quality assurance procedure.", "Must be performance-driven and able to work in a fast-paced environment with tight deadlines.", "Experience with CSS3, SCSS, Flex Box, Bootstrap, Material UI", "Experience with Next.js", "Experience with Typescript", "Experience with in-memory cache (Redis)", "Experience building API using Microservices & Serverless Architecture", "Experience in server management and AWS knowledge", "Experience with Java/Spring Boot", "A Fintech background is an asset"]},
{"role": "Software Engineer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": [" and/or", "Full Stack Engineer", "/", "Cloud Infrastructure", "Software", "Software Test Engineer", " 4-Day Work Week", " Generous relocation packages to help with the move", " With locations across the US, Martin has endless career growth and development opportunities and your expertise can support the most important work in the nation", " Comprehensive benefits package that includes health, dental, vision, etc. starting Day 1", " Lucrative 401k program", " Work/ Life Balance with a generous PTO program"]},
{"role": "Web Developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["Collaborate with cross-functional teams to gather requirements and understand project objectives.", "Design and implement user interfaces with a focus on aesthetics and functionality.", "Develop and maintain web applications with a strong emphasis on responsiveness and compatibility.", "Conduct rigorous testing to ensure optimal performance and identify areas for improvement.", "Stay updated with the latest web development trends and technologies.", "Proven experience as a Web Developer or related role.", "Proficiency in web development technologies such as HTML, CSS, JavaScript, and front-end frameworks.", "Understanding of back-end technologies and server-side development (e.g., Node.js, PHP, ASP.NET).", "Familiarity with content management systems (CMS) is a plus.", "Excellent problem-solving and communication skills."]},
{"role": "Full stack Developer (React JS, Redux)-Canada", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["They're looking for Frontend heavy with backend experience", "Front end: React JS, Redux, GraphQL", "Backend: Java, Spring boot", "Database: PostgreSQL", "Concepts: design systems, widgets, plugin, composition patterns, react hooks, caching, infrastructure, error handling, standards on error codes, performance, user interactions", "Nice to have: React Context (state management)."]},
{"role": "Software Engineer - Front End", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 2, "job_description": ["Our Technology: Wave is powered by several key technologies. Our web/mobile toolkit where you'll be working is primarily React and ReactNative with Typescript and Javascript. Our APIs are GraphQL and REST powered by services written in Python and Django, as well as Rails and Golang. We expect software developers working on the front-end to have enough familiarity with API development to be able to collaborate with back-end developers to devise solutions to product challenges, and to contribute to code on the API layer when needed", "Your Work Will Matter: Every engineer at Wave is tasked with solving meaty, meaningful challenges for a really important end-user - our small business owners. The code you write will make a difference, guaranteed", "We Are a Community: Wave is about the size of a small neighbourhood. It is possible to get to know everyone on a personal basis. If you’re trying to solve a hard problem that has roots in some other part of the company, odds are pretty good that you’ll find someone close by who can help you out", "You Will be Stretched: We’re big on transparency and we know Wave isn’t for everyone. However, if you’re ready to flex your creativity, excel at your craft, fuel your curiosity, and thrive in a dynamic environment, we’re confident you’ll love being a Waver", "Work From Where You Work Best: We will always have a welcoming, energizing, and world-class office (in Toronto) with a space for you. Or, if you’re more comfortable working from home, the choice is yours", "We Care About Future You: You will stretch yourself and you will grow at Wave. You will also be supported on this journey with diverse learning experiences, educational allowances, mentorship, and so much more", "We Support the Full You: We make a serious investment in your health & wellness. When we think about benefits we think about body, mind, & soul and we take this stuff very seriously. ", "We Take Care of the Fundamentals: Fair compensation, all the office perks you’d want, and the various goodies you’d expect from a growing tech company. This is the obvious stuff, but we don’t want you to think we forgot!"]},
{"role": "Full-stack developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["Design overall architecture of the web application", "Developing front end website architecture", "Translate Wireframe responsive HTML/CSS", "Build interactive web pages", "Integrate with App backend", "Designing user interactions on web pages", "Developing back-end website applications", "Implement authentication and authorization", "Set-up backend storage (DynamoDB, RDS) to store user settings", "Design and implement API requests to Data science models", "Ensuring cross-platform optimization for mobile phones", "Working alongside graphic designers for web design features", "Ensuring responsiveness of applications", "Experience working with graphic designers and converting designs to visual elements", "Understanding and implementation of security and data protection"]},
{"role": "Front-end Developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["Collaborate with UX designers to translate wireframes and prototypes into interactive web interfaces.", "Implement responsive and intuitive designs that work seamlessly across various devices.", "Optimize front-end code for performance and efficiency.", "Stay updated with the latest front-end technologies and best practices.", "Conduct code reviews and provide valuable feedback to team members.", "Proven experience as a Front-end Developer or related role.", "Proficiency in HTML, CSS, JavaScript, and front-end frameworks (e.g., React, Angular, or Vue.js).", "Familiarity with design tools such as Sketch or Adobe XD.", "Strong understanding of responsive design principles.", "Excellent problem-solving and communication skills."]},
{"role": "React Front End Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Developing new user-facing features using React and Headless CMS tools ", "Building reusable components and front-end libraries for future use ", "Translating designs and wireframes into high quality code ", "Optimizing components for maximum performance across a vast array of web capable devices and browsers ", "Creating, installing, and maintaining WP sites as a headless CMS ", "Working closely with designers to push the boundaries of what is possible and help define best practices ", "Integrating with a headless CMS and various APIs to deliver a combination of static and dynamic web experiences ", "A proven experience of scaling up products to hundreds of thousands of users while maintaining costs and security of infrastructure", "Thorough understanding of React and its core principles ", "Extensive experience in different web protocols RESTful, WSS, FIX, etc. ", "Experience with different caching mechanisms ", "Experience with different messaging systems/protocols ", "Experience with Jamstack, nextjs", "Ability to work with common CMS systems and frameworks depending on the need – common platforms like WordPress or Squarespace ", "Familiarity with the WordPress API and GraphQL plugins ", "Knowledge of modern authorization mechanisms, such as JSON Web Token ", "Experience with common front-end development tools such as Babel, Webpack, NPM ", "Ability to understand business requirements and translate them into technical requirements ", "Expert in the life cycle of web page/request ", "Deep understanding of web concepts, requests, responses, headers, security, etc. ", "Degree in computer science or equivalent", "Extended Healthcare Plan (Medical, Disability, Dental & Vision) ", "Life Insurance ", "Paid Time Off ", "Training & Development Opportunities ", "Stock Option Plan ", "Bonus – Awards – Gifts ", "Work From Home – Flexible hour ", "Free snacks and drinks at the office"]},
{"role": "Web Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["An outstanding opportunity to drive revenue and break into new markets as you share the company's growth journey.", "A company with an excellent reputation and forward-thinking outlook.", "A fast-paced, dynamic role where no two days are ever the same.", "Ongoing professional training and development.", "A work environment where your initiative and innovation will be rewarded.", "A flexible workplace where work-life balance is actively promoted."]},
{"role": "Software Developer", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 5, "job_description": ["Opportunity to work with one of the most exciting modern software development companies in the world", "Play a big part in the success of Rangle.io. We’re helping shape the Tech scene in Toronto and Amsterdam ; modern web and mobile development across the world", "In the role of Software Developer, you’ll help create and build beautiful software that matters using modern software development best practices (Agile, TDD, Continuous Delivery). As a developer for Rangle.io, you’ll be joining a diverse community of people who are passionate about modern JavaScript and its ability to change the world. You’ll get to work on projects, using the latest JavaScript frameworks building for the web & mobile, working with a tight-knit team of talented individuals", "We work with modern JavaScript across a range of frameworks and technologies, on the client as well as on the server: Angular, React, Vue, NodeJS, TypeScript, ES6, Babel, Redux", "Our approach to making software stresses teamwork and close interaction with our clients. We rely on a well thought-out process based on Scrum, continuous delivery, and test-driven development. This process allows us to build software in a way that sets you up for success, allowing you to exercise your creativity and building software that matters without all the red tape, hierarchy and politics", "We avoid sharply defined roles: everyone gets to partake in all aspects of their project and to try their hand at new things. Our developers do not just develop: they also help our clients think through product features, contribute to design, and test", "We work for many clients in an exciting range of industries: social media, e-commerce, manufacturing, transportation, alternative energy, wellness. Any company that we feel helps make the world a better place", "Solid understanding of JavaScript. (Alternatively: really solid backend experience + some JavaScript + ability to learn JavaScript really fast.)", "5+ years experience in web application development, bonus points if you have experience working directly with clients or a product owner", "Experience with Angular is preferred ", "Bonus points if you have previous experience building apps in Vue", "Great interpersonal skills - we are a close knit team and work together to solve problems", "A desire to follow a software development process that helps you sleep better at night", "Bonus points if you have server side experience", "Bonus points if you have an eye for design. (BTW, all our designers can code.)", "Great problem solver and ability to reinvent oneself - We are always looking at ways we can do things better, sometimes there is no path to follow", "Proactive and self starter - we hire folks that have a deep desire to do better and be better, you won’t be micromanaged in this role. (We want to hear your voice.)", "Passionate about learning - You’ll help identify new technologies and approaches to problems. (Web development and especially JS is always evolving.)"]},
{"role": "Software Developer, New Graduate, 12 month Contract", "seniority_level": "Associate", "employment_type": "Associate", "keyword_count": 1, "job_description": ["Freedom and a healthy work- life balance– Embrace our flexible work environment with flex hours, telecommuting and digital workspaces.", "Solve the world’s most significant problems – Be part of exciting and innovative projects.", "Engaging, challenging, and fast evolving, cutting edge technological environment.", "Opportunities to advance your career and mentorship programs on a local and global scale.", "Competitive total rewards package.", "Profit sharing available.", "Rewarding vacation entitlement with the opportunity to buy and sell your vacation depending on your lifestyle.", "Contribute to our social responsibility initiatives focused on access to education, access to technology and sustaining communities and make a positive impact on the community.", "Participate in our celebrations, social events and offsite business events.", "Opportunities to contribute your innovative ideas and get paid for them!", "Employee perks and discounts.", "Diversity and inclusivity focused.", "Contribute to the entire life cycle of product development including specifications, design, coding, test, production and maintenance", "Develop software codes in C/C++", "Participate actively in development projects, both hardware and software component selection and developing technology for future products", "Be a part of a team that brings advanced telecommunications products to market", "Degree in Computer Science/ Engineering/ Mathematics or related disciplines", "Experience with Linux operating system and environment", "Programming skills in C / C++ and Bash programming in a Linux environment (user and kernel space)", "Experience in developing or modifying and integrating open-source projects (OSS)", "Experience developing with POSIX threads", "Experience with TCP/IP and socket programming", "Software source control tools such as Git, Subversion, etc.", "Experience working on Linux for embedded devices", "Experience with Angular", "Exposure to Databases/data modelling"]},
{"role": "Software Developer – JavaScript & Python", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 3, "job_description": ["Gather requirements from stakeholders and translate them into technical specifications.", "Design and architect scalable and fault-tolerant solutions using AWS distributed computing and storage components.", "Develop new components and enhance existing functionality for our Healthcare Touchpoint Exchange.", "Design and implement software solutions using JavaScript and Python.", "Model and develop data structures using JSON, XML, and databases.", "Take ownership of projects, ensuring timely delivery and meeting project requirements.", "Collaborate with cross-functional teams to define overall concepts for new product features and components.", "Continuously optimize and improve the performance and scalability of the software solutions.", "Bachelor’s Degree in Computer Science, Computer Engineering, or a related field.", "3+ years of experience in JavaScript and Python development.", "Experience with other programming languages is a plus.", "Strong experience in gathering requirements, designing, and architecting software solutions.", "Proficient in using GitHub/Gitlab for project collaboration and managing source code.", "Experience with distributed computing and storage systems is required.", "Demonstrated ability to solve complex problems in fast-paced environments.", "Excellent communication skills and the ability to articulate complex ideas and concepts.", "Strong time management skills with a proven ability to prioritize and meet strict deadlines.", "Self-driven and motivated to learn and improve.", "Prior experience with Medicare Advantage benefits is a plus."]},
{"role": "Full Stack Engineer", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 2, "job_description": ["Building web applications using ReactJS, NextJS, NodeJS, Typescript and a MariaDB database on an AWS infrastructure", "Collaborating closely with Engineers, CTO and Product Management to integrate different systems through APIs and provide a coherent user experience across our sites and tools, adapting to each type of user we work with", "Designing and developing back-end services using an API-first approach and REST, following clean code and hexagonal architecture principles", "Producing reusable components, playbooks and libraries for future use", "Participating in code reviews, sprint planning and retrospectives to develop and maintain a quality codebase", "Translating designs into beautiful user interfaces that offer a coherent and valuable experience for our customers and internal users", "Mentoring and knowledge sharing with other team members, learning from them too", "You’re a Full Stack Engineer with experience shipping multiple features and products", "You have solid Javascript knowledge and are excited to adapt to new frameworks, technologies and tools", "You have the ability to work with distributed systems, APIs, and Relational Databases", "You understand engineering principles and coding best practices, and you’re able to write clean code with scalability in mind", "Your communication style is concise, and you’re able to break down technical concepts to non-technical team members", "1: 30-minute Phone screen with Emma Hunt (Head of People and Culture)", "2: 60-minute Virtual Interview with Bryan McEire (CTO)", "3: Technical take-home exercise", "4: 60-minute exercise walkthrough and Q&A with Alejandro Castillo (Head of Engineering) and Nick Chinsen (Senior Full Stack Engineer)", "5. 30-minute Cultural interview with Max Birner (CEO)", "5: Reference Check & Offer 🥳 ", "Highly competitive salary depending on experience", "Stock Options", "Fantastic opportunity to help build and grow with a funded company at an early stage", "4 weeks of annual vacation", "Comprehensive healthcare benefits plan, including dental & vision & spending account", "Free access to Maple and Headspace apps", "A monthly transportation allowance", "Flexible working hours in a hybrid environment - we work remotely 2 days a week", "Join a multicultural team that has built successful startups around the world"]},
{"role": "Frontend Engineer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 2, "job_description": ["Build reliable, scalable and performant user experiences using modern tools like React, TypeScript, Jest and Webpack", "Help define a scalable front-end architecture, advise other teams internally and also encourage best practices", "Provide technical leadership to more junior engineers on your team", "Get problem statements from designers and product managers, break projects into substantial tasks, and deliver the project with metrics and data with fellow engineers", "3+ years of industry web frontend development experience with modern JavaScript tooling (React, Redux or equivalent, and so on)", "Strong understanding of HTML, CSS, JavaScript, and related web technologies", "Experience working with react or node.js applications", "Experience with unit and integration testing", "Good written, verbal communication skills", "Great team player", "Go", "GraphQL", "Node.js", "React", "Python", "Cassandra", "Redis", "Terraform", "Docker", "Kubernetes", "AWS", "Kafka", "Envoy"]},
{"role": "Junior React Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 1, "job_description": ["Develop and implement user interfaces for web applications using React.js and related technologies.", "Collaborate with designers and back-end developers to ensure seamless integration of front-end and back-end components.", "Optimize web applications for maximum speed and scalability.", "Ensure the technical feasibility of UI/UX designs and provide input on design feasibility and potential enhancements.", "Participate in code reviews and provide constructive feedback to team members.", "Stay up-to-date with the latest industry trends and technologies to continually improve our development processes and outcomes.", "Troubleshoot and debug issues as they arise and propose solutions to maintain application quality.", "Actively participate in brainstorming sessions and contribute creative ideas to enhance the user experience.", "Bachelors Degree in Computer Science with 1-2 years of industry experience ", "Proficient in React.js and its core principles.", "Strong understanding of JavaScript (ES6+), HTML5, and CSS3.", "Experience with responsive and mobile-first web development.", "Familiarity with RESTful APIs and asynchronous request handling.", "Solid understanding of version control systems, preferably Git.", "Experience with front-end build tools and preprocessors such as Webpack, Babel, SASS/LESS.", "Ability to work collaboratively in a team environment.", "Excellent problem-solving skills and attention to detail.", "Strong communication skills and the ability to explain technical concepts to non-technical team members.", "Experience with testing and debugging tools.", "Bonus: Knowledge of UX/UI design principles and practices.", "Bonus: Familiarity with back-end technologies and frameworks."]},
{"role": "Software Engineering, New Grad", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Work on cross-functional projects, directly collaborating with other engineers", "Give meaningful feedback on code reviews and technical designs", "Ensure that the systems your team operates continue running well and can scale to meet the needs of our users", "Build the skills to own a project from beginning to end, learning project management and technical leadership skills", "A Bachelor’s, Master’s, or PhD degree in computer science or a directly related field, obtained by summer 2024, or equivalent work experience", "Some experience and familiarity with programming, either through side projects or classwork. We work mostly in Java, Ruby, JavaScript, Scala, and Go. We believe new programming languages can be learned if the fundamentals and general knowledge are present", "Experience from either previous internships or working collaboratively on multi-person coding projects (in a university or professional setting)", "Ability to learn unfamiliar systems and form an understanding of those systems, through independent research and working with a mentor and subject matter experts", "One or more areas of specialized knowledge balanced with general skills and knowledge, such as knowing more frontend technologies and, at a high level, how a service handles an HTTP request", "Experience in code review practices, and an understanding of how to safely update production systems", "Familiarity with navigating and managing work in large code bases"]},
{"role": "Software Engineer ( All Levels)", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Music is Everything: Music is our passion, and we can never get enough. Tastes, trends, and tech will change, but great artists and songwriters will always be our driving force.", "Global Growth, Local Expertise: Music is a global language. Through communication and collaboration, our success can come from anywhere and translate everywhere.", "Innovation and Insight: Pushing the boundaries requires the best information and the boldest imagination. We use both to create the future.", "Empowered by People: Like the artists we serve and the music they make, our differences make us stronger. This is a place where every talent can belong and build a career.", "Junior Engineers ", "Senior Engineers ", "Staff+ Engineers", "Owning, defining the technical vision, and driving innovation for key technical systems", "Mentoring for junior engineers and mentorship opportunities for senior engineers", "Collaborating closely with key music industry stakeholders as well as colleagues in NYC, Los Angeles, and London", "Reimagine and implement the future of tech for the music industry ", "Work as part of a dynamic and highly effective team ", "Own the creation and delivery of highly innovative products ", "Learn and grow as a professional through close collaboration with your team members and engineering leaders, and by being part of culture of continuous improvement and learning", "You’re a curious learner with a desire to grow and contribute to a positive team environment ", "You have a high sense of ownership", "You’re able to deal with ambiguity and working in a fast-paced, evolving environment", "Your bias is towards action, and you always find ways to deliver better solutions more efficiently", "You’re an empathetic team member who works well in a team environment and communicates effectively", "You’re excited about the music business: helping artists and songwriters grow and helping the world hear more great music", "You have a Bachelor’s degree in a relevant discipline or equivalent professional experience"]},
{"role": "Software Developer (All Levels Welcome)", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": []},
{"role": "Frontend Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Have 3+ years of professional programming experience", "Creating software features that are robust, reliable, and user-friendly for our customers", "Experience developing software for the Web platform, including cross-browser compatibility", "Creating software features that are robust, reliable, and user-friendly for both internal teams and our customers", "Experience with modern tools like ES6, React, Redux, Apollo, Flux & Webpack", "Good eye for design and ability to make product decisions.", "You care about men’s health and have a personal connection to the space", "Impact & autonomy. You’ll report directly to the founders who are both senior devs and you'll have a real opportunity to build Phoenix's product", "Cool tools! We use some great software and platforms to deliver the best in care. Need something to make your job easier? We'll work with you to make it happen!", "Rewarding Mission. We're delivering the best healthcare experience to Canadians across the country.", "Fun team, local in Toronto! We are a small elite team in Downtown Toronto. Candidates must be located in the Toronto area."]},
{"role": "Jr. Full Stack JavaScript developer (Ontario Branch)", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 2, "job_description": ["use react + node/express to create user interfaces and backend API calls as part of the ongoing effort to modernize our primary product offering", "learn from more senior team members who direct your day-to-day activities", "make meaningful contributions to a product that people rely on in their day-to-day business operations", "grow into a strong developer as you build your lifelong career at Plexxis", "You like people", "You are focused", "You are supportive", "You are driven", "You like to work in a team but are fine working on your own when the occasion calls for it", "You love coding and you love a good challenge", "You know some JavaScript basics", "You know some ReactJS basics, AngularJS basics, or VueJS basics", "You know some NodeJS basics", "Personal projects that demonstrate your love of development", "Developer training of some kind (boot-camp, college, university, etc.)", "Typescript", "OracleDB or any relational database exposure (sql)", "Competitive Salary", "Benefits", "Company gym", "A games room", "Paid after hours", "Work with a small, tight-knit group of hard-working, dedicated and fun individuals", "Enjoy the atmosphere of a rapidly growing, high energy company with an entrepreneurial spirit", "Be on the winning team - poised to emerge as the global leader", "Be challenged in the workspace, in the fitness room or even the billiards Café", "Lose the stuffy environment (and politics) of “big corporate” and focus on delivering what the competition calls “impossible”"]},
{"role": "Backend Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": ["Writing clean, maintainable, and well-documented code using Node.js/Typescript with express for API’s.", "Working with google cloud platform to integrate with Cloud services such as cloudSQL (postgres), cloud storage, and appengine. ", "Design and develop new applications and features, ensuring scalability, performance, and security. ", "Demonstrate high-quality software development practices. This includes participation in all aspects of the design and development of the applications: research, ideation, and strategy.", "Work closely with leadership to understand system requirements and find well-optimized software development solutions in alignment with the production deadlines and goals.", "Proven work history of software development with Node.js/Typescript and Express.", "Strong understanding of Google Cloud Platform.", "Good understanding of API specifications and documentation.", "Strong understanding of web development principles, practices, and design patterns. ", "Familiarity with databases and data modeling specifically postgreSQL with Prisma.", "Capability to write clean, correct, and efficient code.", "High-quality verbal and written communication skills.", "Sense of ownership, urgency, and pride in your work."]},
{"role": "Full Stack Engineer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 1, "job_description": ["Be an early member of the Gadget team, which means lots of opportunity for helping define the vision and direction of the product", "Primarily work with React, Node.js, TypeScript and PostgreSQL", "Be involved in the development of many core primitives as well as high level features to build out the platform", "Report directly to the founders", "Work with and learn from a team of talented engineers who make developer experience their first priority", "Frequently give and accept meaningful feedback", "Own solutions from end to end, managing complexity and engaging directly with stakeholders", "Debug production issues across services and multiple levels of the stack", "Uphold Gadget’s high standards for engineering and product quality", "Has a few years of software development experience", "Already knows or wants to learn deep skills across the entire stack", "Takes delight in crafting ergonomic abstractions that can scale to meet the needs of most developers", "Wants to work with people who encourage you to do your best work and are invested in your growth and development", "Takes pride in working on projects from ideation to delivery, and enjoy seeing your products being used by customers", "Thrives in an evolving, collaborative environment that values impact over output"]},
{"role": "Full Stack Developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 2, "job_description": ["Work with development teams and product managers to ideate software solutions", "Design client-side and server-side architecture", "Build the front-end of applications through appealing visual design", "Develop and manage well-functioning databases and applications", "Write effective APIs", "Test software to ensure responsiveness and efficiency", "Troubleshoot, debug and upgrade software", "Create security and data protection settings", "Build features and applications with a mobile responsive design", "Write technical documentation", "Work with data scientists and analysts to improve software", "Proven experience as a Full Stack Developer or similar role", "Experience developing web and mobile applications", "Expert knowledge of HTML, CSS, and JavaScript.", "Expert knowledge of a modern JavaScript Front-End Framework (Vue.JS or React.JS)", "Expert knowledge of Ruby on Rails or Node.JS", "Expert knowledge of GIT version control.", "Solid understanding of databases and fluent in SQL (we use PostgreSQL)", "Proficient with unit testing (experience with JS frameworks such as Jest or Mocha is preferred)", "Excellent communication and teamwork skills", "Great attention to detail", "Organizational skills", "An analytical mind", "Degree in Computer Science, Statistics or relevant field preferred", "Your specialization is just as important as your ability to learn fast, communicate and adapt to shifting priorities.", "Communicate well and articulate ideas clearly.", "Focus on project goals!", "Contribute ideas.", "Take initiative.", "It’s awesome! We’re a driven, passionate, responsible group who values professional growth and work life balance. ", "We are a fun start-up, with a start-up culture.", "Our company is continually growing and always innovating and creating new features for ourselves and our clients.", "Company atmosphere is collaborative, passionate and fun.", "Casual dress code", "Work with some of the best & brightest technical minds in the industry! We learn from and share knowledge with each other every day.", "Stocked coffee, snacks and candy “bar”", "Pizza parties and team lunches", "Laser Tag in the office", "Spontaneous games of tabletop cornhole or NERF wars", "Company sponsored Fantasy Football league and March Madness bracket challenge."]},
{"role": "Web Developer", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 1, "job_description": ["You have four (4) or more years of paid experience (i.e. not side-projects or school projects) as an Intermediate Web Developer building websites and/or web applications from the ground up", "You have the ability to take an idea from inception to delivery, writing efficient, readable, well-tested code to accomplish tasks and solve technical problems. You have a proven track record of focusing on hitting deadlines and resolving customer concerns", "You’re confident in your creativity and ability, willing to have your ideas built upon, and are pumped to work with design and product teams to create web experiences our clients will love", "You help increase the quality of our code through attention to detail in pull requests and refactoring, and you are a constant learning", "You are primarily focused on front-end development (HTML, CSS, Javascript), but are comfortable working with PHP templates, getting into the database a little bit, working with or even creating basic REST api’s. You are full-stack, with a slant towards the presentation layer", "You’ve worked extensively with React or Vue.js, you’ve build static websites, worked with a variety of CMS’, are comfortable with Node.js", "You’ve worked on Wordpress websites and know the in’s and out’s of building them - maybe you’ve even regularly used Advanced Custom Fields to build all kinds of custom post types", "Experience with any of these is a bonus: Laravel, Typescript, Firebase, Next.js, Cypress/Playwright", "You’ll report to a Project Producer, and work on all aspects of development from the frontend to the backend, in collaboration with designers, DevOps, and QA", "You’ll work closely with Senior Web Developers and an Associate Technical Director to bring designs to life using the appropriate tech stack for the project", "From concept through launch, you’ll dive in and support product development including task time estimation, coding, asset management, testing, and debugging", "You’ll support and help grow our people, processes, and frameworks in ways that benefit everyone", "You’ll participate in code reviews, pair-programming, project reviews, API design reviews, technical reviews of product stories with in-depth yet constructive criticism; and give and take feedback"]},
{"role": "Full-Stack Software Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": []},
{"role": "Full Stack Developer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 1, "job_description": ["Help execute the product development vision, and assist with the technical landscape for a large-scale construction", "Write maintainable, testable, and performant software in creating the entire platform, end-to-end", "Build reusable code and libraries for future use", "Participate in code review and performing extensive testing to ensure high-quality software", "Implement services using security mechanism such as OAuth, Single Sign On.", "Implement data security processes and methods.", "Clearly document the artifacts to ensure proper knowledge transfer within the team.", "Build and launch products rapidly and iteratively. We ship to production frequently and have a large, active user base.", "Integration of the front-end and back-end aspects of the application", "Communicate clearly and effectively with all members of our team", "Bachelor’s degree in Computer Science or Computer engineering.", "3+ years of software development experience, with a focus on NodeJS(Server-side), ReactJS(Client-side) and HTML", "Experience both authoring and consuming RESTful APIs", "Experience with SQL and database design", "Experience with extensive unit testing experience (preferably using Mocha and Chai)", "Experience with Git/GitHub and GitHub Actions", "Experience with unit/integration/end-to-end/performance testing.", "Experienced in Agile methodologies.", "Strong debugging and troubleshooting skills", "Has a strong working ethic and obeys the code of conduct. Strictly follow the security and quality assurance procedure.", "Must be performance-driven and able to work in a fast-paced environment with tight deadlines.", "Experience with CSS3, SCSS, Flex Box, Bootstrap, Material UI", "Experience with Next.js", "Experience with Typescript", "Experience with in-memory cache (Redis)", "Experience building API using Microservices & Serverless Architecture", "Experience in server management and AWS knowledge", "Experience with Java/Spring Boot", "A Fintech background is an asset"]},
{"role": "Software Engineer", "seniority_level": "Entry level", "employment_type": "Entry level", "keyword_count": 0, "job_description": [" and/or", "Full Stack Engineer", "/", "Cloud Infrastructure", "Software", "Software Test Engineer", " 4-Day Work Week", " Generous relocation packages to help with the move", " With locations across the US, Martin has endless career growth and development opportunities and your expertise can support the most important work in the nation", " Comprehensive benefits package that includes health, dental, vision, etc. starting Day 1", " Lucrative 401k program", " Work/ Life Balance with a generous PTO program"]},
{"role": "Web Developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["Collaborate with cross-functional teams to gather requirements and understand project objectives.", "Design and implement user interfaces with a focus on aesthetics and functionality.", "Develop and maintain web applications with a strong emphasis on responsiveness and compatibility.", "Conduct rigorous testing to ensure optimal performance and identify areas for improvement.", "Stay updated with the latest web development trends and technologies.", "Proven experience as a Web Developer or related role.", "Proficiency in web development technologies such as HTML, CSS, JavaScript, and front-end frameworks.", "Understanding of back-end technologies and server-side development (e.g., Node.js, PHP, ASP.NET).", "Familiarity with content management systems (CMS) is a plus.", "Excellent problem-solving and communication skills."]},
{"role": "Full stack Developer (React JS, Redux)-Canada", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["They're looking for Frontend heavy with backend experience", "Front end: React JS, Redux, GraphQL", "Backend: Java, Spring boot", "Database: PostgreSQL", "Concepts: design systems, widgets, plugin, composition patterns, react hooks, caching, infrastructure, error handling, standards on error codes, performance, user interactions", "Nice to have: React Context (state management)."]},
{"role": "Software Engineer - Front End", "seniority_level": "Not Applicable", "employment_type": "Not Applicable", "keyword_count": 2, "job_description": ["Our Technology: Wave is powered by several key technologies. Our web/mobile toolkit where you'll be working is primarily React and ReactNative with Typescript and Javascript. Our APIs are GraphQL and REST powered by services written in Python and Django, as well as Rails and Golang. We expect software developers working on the front-end to have enough familiarity with API development to be able to collaborate with back-end developers to devise solutions to product challenges, and to contribute to code on the API layer when needed", "Your Work Will Matter: Every engineer at Wave is tasked with solving meaty, meaningful challenges for a really important end-user - our small business owners. The code you write will make a difference, guaranteed", "We Are a Community: Wave is about the size of a small neighbourhood. It is possible to get to know everyone on a personal basis. If you’re trying to solve a hard problem that has roots in some other part of the company, odds are pretty good that you’ll find someone close by who can help you out", "You Will be Stretched: We’re big on transparency and we know Wave isn’t for everyone. However, if you’re ready to flex your creativity, excel at your craft, fuel your curiosity, and thrive in a dynamic environment, we’re confident you’ll love being a Waver", "Work From Where You Work Best: We will always have a welcoming, energizing, and world-class office (in Toronto) with a space for you. Or, if you’re more comfortable working from home, the choice is yours", "We Care About Future You: You will stretch yourself and you will grow at Wave. You will also be supported on this journey with diverse learning experiences, educational allowances, mentorship, and so much more", "We Support the Full You: We make a serious investment in your health & wellness. When we think about benefits we think about body, mind, & soul and we take this stuff very seriously. ", "We Take Care of the Fundamentals: Fair compensation, all the office perks you’d want, and the various goodies you’d expect from a growing tech company. This is the obvious stuff, but we don’t want you to think we forgot!"]},
{"role": "Full-stack developer", "seniority_level": "Mid-Senior level", "employment_type": "Mid-Senior level", "keyword_count": 0, "job_description": ["Design overall architecture of the web application", "Developing front end website architecture", "Translate Wireframe responsive HTML/CSS", "Build interactive web pages", "Integrate with App backend", "Designing user interactions on web pages", "Developing back-end website applications", "Implement authentication and authorization", "Set-up backend storage (DynamoDB, RDS) to store user settings", "Design and implement API requests to Data science models", "Ensuring cross-platform optimization for mobile phones", "Working alongside graphic designers for web design features", "Ensuring responsiveness of applications", "Experience working with graphic designers and converting designs to visual elements", "Understanding and implementation of security and data protection"]},
