[
{"role": "Junior Data Analyst - Full Time", "seniority_level": "Entry level", "employment_type": "\n            Entry level\n          ", "job_description": "\n        We are looking for people passionate about data and motivated by solving problems in a dynamic, fast-paced work environment. Aventas is a fast-growing technology company, where Research Analysts have abundant opportunities for learning and career advancement. As an early member of our team, you will play a vital role in shaping Aventas Data and Research team and be part of an exciting journey to modernize the $10 trillion dollar global real estate investment industry.Here are some of the things you'll spend your time doing:Analyze, interpret and extract data from financial models (Excel and Argus), Offering Memorandums and/or any other documentsCollect, normalize, validate and structure incoming dataSupport the Customer Success team with data migration when onboarding new clientsAd-hoc data and research projectsRequirementsRequirementsStrong analytical skills and attention to detailAdvanced proficiency with ExcelGreat communication and time management skillsAbility to work independently and proactively in a fast-paced, relatively unstructured environmentAccurate typing and data entry skillsBenefitsThe salary for this role is between $35,000 to $45,000 depending on experience level - we will assess this during the interview process. In addition, we offer health coverage (with a health care spending account) and an annual education stipend.Employment Type: Full-TimeSalary: $ 35,000.00 45,000.00\n      "},
{"role": "Data Analyst - Canada", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        ReVisionz, a leader in asset &amp; process safety information management, is seeking an experienced Data Analyst to join our team. The primary objective of this role is to utilize advanced programming expertise to efficiently handle substantial volumes of client asset data. This involves analyzing the data to uncover significant insights following predefined criteria and recognizing areas that require attention. Ultimately, the goal is to align this information with the organization's intended information framework. This alignment will facilitate various actions, including enhancing data quality, transitioning to novel solutions, and ensuring seamless integration across diverse systems Our company culture fosters growth and development, making us the ideal place for you to do your best work and grow your career. Here's how you add value:Work with the Content Analysts to establish rules-based processes to extract details from engineering information content and data sources. Analyze plant specifications and engineering content to identify tag and document naming patterns. Analyze quality of existing plant engineering content to identify loading issues (file quality, naming inconsistencies, specification compliance, etc.)Based on the rules apply regex, parsing and other data processing based on interrogation of the sources to provide necessary outcomesUse SQL skills further enabled through such formal computing languages as .NET, Java, Python, etc. to conduct such extraction and data interrogationAlign the findings with defined rules to identify compliance and gaps. Address processing of data off the source databases and fileshares with multiple complex inter-relationshipsAddress the normalization of inconsistent data across multiple sources where naming conventions were not applied consistentlyPrepare XL and dashboard reports with which to effectively present findingsCollaborate with the Content Analysts/ Consultants and business subject matter experts to rigorously interrogate the extracted asset information and assess its state against the business rulesParticipate in Content Analyst/Consultant workshops to provide asset information data expertise to enable methods to uncover findings based on the data extractions performedMaintain the plant configuration level tag and document ENS elements. Develop load sheets based on Plant Document and Tag Data sets and load them into SDXTrack record in the formalization of findings for developing the path forward for enrichment of data in support of migration processesSupport the technical Extract/Transform/Load team members who codify process and enrichment rules that are established to address the compliance and gap findings from the analysis and assessmentsRequirements  Bachelor’s Computer Science, Engineering or Management Information Systems, or related fieldStrong experience gained through repeated lead data role in sophisticated data analysis projects involving:applying SQL to datasets upon which to extract, parse and assess the information,extending SQL with .NET programming skills or other such as Java, Python, etc. for addressing specialized extraction, scraping and analysis skills (with .NET is preferred), andexperience with source control of coding used in processing (e.g., Git, SVN, or similar)5+ years domain experience in Engineering Document and Information Management Systems for Owner/Operators or EPC’s, including for Tags/Controlled Documentation and the lifecycle of such across project/operations use in facilitiesDirect domain experience working for Owner / Operators or EPC’s, including:engineering information standards (e.g., tag and document classification, tag and document metadata, tag and document states)engineering information management processesunderstanding of the engineering information lifecycle and how this supports Engineering, Construction, C&amp;SU, Operations, Maintenance &amp; Reliability, etcA background in existing engineering information management system(s) and databases from such solutions as Hexagon, Bentley, Aveva, etc. will be an assetHighly variable sources and data is the norm, as is poor data quality. The candidate must have a proven and demonstrable track record in developing data interrogation automation solutions with which to process large volume sets with high accuracy and efficiencySources vary from strong metadata in sophisticated databases through to fileshares/other sources with only folder/filename without such metadata. Strong background to establish findings in both situations is necessary including folder paths and filenamesSkills in creatively establishing coded rules with which to interrogate source data so as to establish compliance and gap findings. Interaction with SMEs to guide them in being able to express the rules is importantVolume varies significantly. Background is needed for up to high volume data setsExperience in the migration of files from sources to destinations in relation to the document objects. Experience with key role in engagements for engineering and asset information migration as part of solution implementationPrimary focus on extremely high rates of success on the migration of data/documents and their related metadata**Applicants must have Permanent Resident status or hold an open work permit in Canada. USA applicants must provide proof of eligibility to work if you are not a US citizen or a Green Card holder.**We value diversity in our business and encourage responses from all qualified applicants. While we are appreciative of every application we receive, we advise that only candidates under consideration will be contacted.\n      "},
{"role": "Data Analyst", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        Company DescriptionWe are Dentsu. We innovate the way brands are built. That means we do things differently so they’re better than before. In this way, we make our clients’ most important marketing assets—their brands—win in a changing world. Dentsu is Innovating the Way Brands Are Built for its clients through its best-in-class expertise and capabilities in Media, CRM, and creative communications services. Dentsu is headquartered in London and operates in 145 countries worldwide with more than 50,000 dedicated specialists.Job DescriptionWe are seeking a highly skilled and detail-oriented Data Analyst to join our team. As a Data Analyst, you will be expected to work diligently to meet our client’s data &amp; reporting needs and assist across on-boarding, data Integration, reporting, measurement, advanced analytics, insight development, forecasting and partner identification. The Data Analyst will also be responsible for designing and developing interactive dashboards using tools such as Data Studio or Tableau. Your primary focus will be on extracting, transforming, and loading data, as well as leveraging your expertise in SQL and Google BigQuery to analyze large datasets and generate actionable insights.Additionally, we prefer candidates with experience working with Demand-Side Platforms (DSPs) such as Facebook Ads, Google Ads, LinkedIn Ads, Snapchat Ads, and other advertising platforms. Familiarity with these platforms will be valuable in understanding and analyzing marketing performance data.Work with executives an and other business leaders to identify opportunities for improvement Ownership of the end-to-end data warehousing and extraction process for clients through Google Big Query Leveraging insights, collaborate with various account teams on strategy and growth opportunities; consult on experimentation approaches and translate results into actionable Build backend data connection and manage data warehouse in the ETL process Lead the creation of post campaign reports/presentations through data visualization and story-telling, on an ad hoc/monthly/quarterly/yearly basis Establish KPIs to measure the effectiveness of business decisions Create presentations and reports based on recommendations and findings QualificationsExcellent communication and presentation skills, with the ability to effectively convey complex concepts to both technical and non-technical stakeholders. Bachelor's degree in Business, Computer Science, Statistics, Mathematics, or a related field. Proven experience in designing and building interactive dashboards using Data Studio or Tableau. Strong knowledge of ETL processes and experience in data extraction, transformation, and loading. Proficiency in SQL and experience with relational databases, preferably Google BigQuery. Solid understanding of data modeling, data warehousing, and database design principles. Ability to analyze complex data sets and derive actionable insights using SQL queries and statistical techniques. Familiarity with Demand-Side Platforms (DSPs) such as Facebook Ads, Google Ads, LinkedIn Ads, Snapchat Ads, etc., and experience analyzing marketing performance data from these platforms. Experience in server-side tagging and GA4 implementation preferred Basic knowledge of cloud computing concepts and experience in Google CloudAdditional InformationWe know through experience that different ideas, perspectives and backgrounds foster a stronger and more creative work environment that delivers better business results. We strive to create workplaces that reflect the clients we serve and where everyone feels empowered to bring their full, authentic selves to work. We are committed to working with our candidates from all ability levels throughout the recruitment process to ensure that they have what they need to be at their best. If you need accommodation during the application or interview process, please contact Canada.Recruitment@dentsuaegis.com or to begin a conversation about your individual accessibility needs throughout the hiring process.\n      "},
{"role": "Data Analyst - QA Tester", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Our client is looking for a Data Analyst to join our digital data team to ensure that the data available as-a-service in global data warehouses meets business requirement, with the right quality for enabling enterprise data and analytics and insights initiatives. Maintains the data catalog and ensure compliance of data manipulation with industry standard practices. The bulk of the work covers partnering with data engineers, data scientists and product owners for data analysis and integration requirements and guiding solution design and architecture.ToolsGood knowledge of cloud computing. Knowing AWS is a plusSQL, Excel, PowerPoint, WordTableau and Power BI for data exploration is plusETL tools knowledge is plusSnowflake datamart knowledge is plusProject management &amp; support: JIRA projects &amp; service desk, Confluence, TeamsSkillsExpert in Data manipulation techniques (esp. querying tables with SQL)Strong capacity to develop consistent, clear analysis and report potential issuesData quality audit techniques (Electronic Data Discovery)Expert in applications and product testingFamiliarity with data science methods and scaling data science methodsSoft SkillsPragmatic and capable of solving complex issuesAbility to understand business needsGood communicationService-oriented, flexible, positive team playerSelf-motivated, takes initiativeRigorous, attention to detail to map data systemsCurious to understand what is behind each data fieldExperience3 to 5 years of experience as Business Analyst/QA Tester (performed data manipulation, data analysis, master data management, application/product testing)Experience in a healthcare company is a strong plusPreferred QualificationsMaster’s Degree in Mathematics, Economics, Computer Science, Information Management or StatisticsRequirementsResponsibilities Understand business data requirements and translate them into technical needs, and deliver prompt, efficient, quality serviceBuild and maintain the data model used in global data warehouses and solutionsDefine the concepts and attributes of the data and manage the data dictionary of the tablesKeep up to date data catalog with relevant data available and their attributesValidate quality of data and steer data quality improvement action plansEnsure and assess data quality on global data warehouses, building KPIs (incident management, completeness of data, etc.) and setting up and automate consistency checksIdentify root causes of potential malfunctions and allocate actions to the right stakeholdersPartner with Product Owners and Data Engineers to prioritize the pipeline implementation planPartner with Data Engineers and Data scientists to ensure pipelines meets business requirementsPartner with data domain owner and procurement team in case of need to buy or sell dataPartner with legal team regarding GDPR and other legal requirementsActively contribute to Data governance communityGuide solution design to meet data and integration requirementsIdentify new opportunities to leverage data and to integrate data or applications to enhance business valueCoordinate with data owners to ensure data accessibility and qualityCreate detailed, comprehensive, and well-structured test plans and test casesCollaborate with Digital Quality Operations team to ensure that test plans meet regulatory/compliance requirements where applicableEstimate, prioritize, plan and coordinate testing activities – Unit, SIT, Regression, and UATDesign, develop and execute testingDevelop and apply testing processes for new and existing products to meet client needs\n      "},
{"role": "Data Analyst (GTM)", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        About UsLuxury Presence is a rapidly growing Bessemer-backed SaaS startup that enables real estate agents to manage their online presence. We are moving fast to build the next generation SaaS platform in the rapidly growing PropTech industry. Now we’re looking to bring on our first Data Analysts to take our data game to the next level. It’s time that we take the entirety of our operational, financial, and product data and start driving insights, predictions, and better decisions across the entire company.Why Now?We’ve enjoyed tremendous growth over the last 5 years. With that growth comes a treasure trove of data that is valuable to us, and our customers. We need experienced and passionate data analysts to help us realize that value and unlock the insights that exist at the intersection of our operational, financial, and product data. This is a unique opportunity to join a fast growing startup and build our data team, culture, and processes from the ground up.What You'll DoEvaluate and implement a BI tech stack to support the democratization of data and analytics through dashboards, reports, and analyticsBuild production-ready data models and schemas using DBT to support downstream analyticsBuild dashboards, data products, and ad hoc report studies to analyze and present data associated with GTM analytics, product performance, business operations, and strategic decision makingWork with key stakeholders and the leadership team to define and monitor KPIs across the companySupport development of predictive models to support strategic and operational initiativesMust HavesAdvanced knowledge of SQLProficiency in any statistical programming language (i.e, Python or R)3+ years in doing analytics with a robust understanding of statistical conceptsExperience working with BI tools (Tableau, SiSense, Sigma, or Looker etc)Ability to communicate technical concepts to both technical and non-technical audiences through visualizations and presentationsExperience with cloud data warehouse and transformation tools (e.g.,, snowflake, DBT etc)Ability to partner with leadership and stakeholders across the company to understand business needs and how these can be addressed through analyticsNice to HavesM.S. or phD in Math, Statistics, or closely related quantitative fieldExperience working closely with data engineering building and managing ETL and rETL workflowsExperience building supervised and unsupervised learning modelsExperience working in a B2B or SaaS environment support sales, marketing, product and/or customer successApplicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time.Who we are: Luxury Presence is the real estate industry's most powerful marketing platform, providing award winning websites and cutting edge tech to the world’s top agents.Founded in 2016 by Stanford Business School alumni Malte Kramer, Luxury Presence currently serves over 8,000 clients in the U.S. and Canada with its SaaS model — including over 20 of the top 100 WSJ real estate agents and teams. In addition, Luxury Presence is the official website partner to some of the industry's most powerful brokerages.The Los Angeles-based SaaS company raised $25.9 million for its Series B round. Bessemer Venture Partners led the round alongside fellow existing investors Toba Capital and Switch Ventures. Former Dallas Mavericks basketball player Dirk Nowitzki also participated in the round, along with other angel investors.Its solutions include stunning website design, an engaging home search tool, an agent-to-agent listing referral network, powerful content &amp; SEO strategies, expert-lead social media management, and digital advertising for lead generation. In 2020, Luxury Presence was recognized as a Best Place to Work by BuiltinLA and by Inc. as the 322nd fastest growing private company in America and then again in 2021 — LP ranked 598th.Luxury Presence is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin.\n      "},
{"role": "Data Analyst Co-op", "seniority_level": "Internship", "employment_type": "\n            Internship\n          ", "job_description": "\n        Responsibilities and Duties:General / Administrative Assist in collecting, cleaning, and preparing data from various sources for analysisSupport the creation of dashboards, reports, and visualizationsCollaborate with the Business Analyst and other team members to understand data requirements for specific business problemsContribute to maintaining and updating existing databases, ensuring data quality and integrityParticipate in team meetings and contribute ideas to improve data management and analytical processesGain exposure to industry trends, competitor activities, and best practices in data analysisProvide general support to other team members as required in data-related tasksOther duties as assignedRequirementsQualifications:Pursuing or recently completed a Bachelor’s degree in Computer Science, Statistics, Mathematics, or a related fieldBasic knowledge of data visualization tools like Tableau, Power BI, or similar is a plusInterest in data analysis methodologies and data-driven decision-makingDesire to learn and grow analytical skills, with an interest in interpreting complex dataFamiliarity with or willingness to learn SQL and other data manipulation languagesGood communication skills, with an eagerness to collaborate with both technical and non-technical team membersNo previous professional experience required, but any relevant academic projects or coursework is a plusWorking Conditions:Working remotely and in office as required at the sole discretion of the companyIntensive computer work and extended use of the computer keyboard and mouseSitting for prolonged periods of time - up to 8 hours per dayOccasional lifting of objects up to 20 lbsWork area may have fluorescent lighting and air conditioningNoise level is usually moderate to loudExposure to ink and chemical fumes, and airborne particles such as paper dust and drying powderAppearance at all times must represent the company imageFast-paced environment: subject to numerous schedule and priority changes and short notice activityOccasional additional hours may be required due to operational requirements.\n      "},
{"role": "Jr. Data Analyst / Full-time (Remote)", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        The Jr Data Analyst is responsible for providing key technical and financial insights to plan and effectively operate the business, through data analytics, reporting and analysis. They will serve as the central report contact for multiple business units.Essential Functions Of The Jr Data Analyst Role Include Advanced analysis, utilizing large datasets and complex business requirements to drive meaningful change on KPIs and objectives. SQL querying across multiple platforms and scripting to return relevant data while tuning queries &amp; utilizing best practices. Validation check execution, including data element inconsistencies. Align with leadership to design and implement solutions; also checking against standard business trends to identify outliers. Produce reports, graphs, summaries and presentations that convey analytic results in an easy to understand and storied manner. Maintain a focus on flow and context, ensuring analysis provides insights that tie to visuals and speaks to drivers and business strategy shifts where appropriate. Demonstrate the ability to clearly identify key points and callout deeper insights, or tie to other visuals, and how it relates to business performance through written communication within analysis. Review and polish analysis through iterative development. Understand the importance, and basic elements, of project planning, and can create plan independently. Follow project plan and communicates progress/roadblocks proactively. Respect project timelines and maintain clear/concise documentation on requirements, project goals, methodology and output. Understand operational systems and work with IT &amp; Business teams to create reporting governance using our BI tools. Benefits Complimentary Boarding (30 non-holidays per year) Discounted Veterinary Care On-demand pay (DailyPay) Dog/Cat Adoption Assistance Fitness Reimbursement Paid Time Off 401(k) Plan with Company Match Health, Dental and Vision Insurance Community Perks (Discount Program)\n      "},
{"role": "Data Analyst II (Canada Remote)", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        Founded in 2011, Fullscript supports 70,000 health practitioners across North America committed to delivering better patient care.Fullscript provides the ability to prescribe and manage the use of healthcare’s best supplements all in one place. Fullscript's online prescribing platform provides access to over 20,000 practitioner-grade products from over 300 brands, enabling practitioners to create fully personalized plans for their patients. With an unrelenting focus on quality and convenience, Fullscript delivers a patient experience that can't be found anywhere else.Fullscript is a company where teammates embrace a growth mindset, have their talents celebrated, are given the tools to Grow Faster Than The Company, and are inspired to put their wellness at the forefront of their everyday lives. As a result, Fullscript has been consistently recognized for its culture and leadership. Check out our Culture Guide here.The Data team is a key strategic partner at Fullscript, responsible for providing analytical support for all internal functions to drive effective planning and decision making. Reporting to a Technical Lead, the Data Analyst will perform in-depth exploration and analysis of company data in order to guide goals, improve processes, and help our leaders understand and track key metrics.What you'll doDefine, design, and develop dashboards and artifacts for key metrics and KPIs using various data languages and Business Intelligence systemsPartner with key stakeholders to dive deep into the business challenges and identify insights to drive product and company strategiesImprove data availability and data literacy across the organizationCollaborate with the Analytics Engineering team to improve the availability of reliable data and automation of recurring business needsPartner with stakeholders to create meaningful goals and targets for both team and company-level initiativesSupport, facilitate, and monitor strategic objectives through the creation of models, segmentation, and analytical testingGuide and advise business functions on the collection of data to broaden our visibility into company activitiesProactively contribute to our shared documentation store and self-serve Business Intelligence artifactsProactively watch for opportunities to improve code quality and scalability within our codebaseOther duties may be assigned as determined by the Company from time to timeWhat you bring to the tableMinimum Bachelor’s Degree in a quantitative, analytical, or similar field with 2+ years of relevant experience successfully working in a data role using relational databasesExperience working with Business Intelligence systems and tools (BI tooling, databases, spreadsheets)Proficiency in SQL including basic transformationsProficiency in Python for analytical use and common librariesCreative problem-solving skills with a passion for uncovering strategic opportunitiesProven ability to work independently in a fast-paced environment, managing competing priorities on multiple simultaneous projectsDemonstrated attention to detailStrong written and verbal communication skills with the ability to effectively communicate complex ideas and concepts to both technical and non-technical teamsBonus if you have:Experience with Snowflake, MySQLExperience with LookerExperience with PythonExperience with HTML/CSSExperience in B2B or SaaS, working in a high-growth environmentInterest or experience in Health Tech, Integrative Medicine, or supplementsWhat we can offer youGenerous PTO and competitive pay Fullscript’s RRSP match program for financial health Flexible benefits package and workplace wellness programTraining budget and company-wide learning initiatives Discount on Fullscript catalog of products Ability to work Wherever You Work Well**Our Wherever You Work Well philosophy means Fullscript teammates get to pick their own office — whether that’s in-office, at home, or a bit of both.Fullscript is committed to diversity in its workforce and is proud to be an equal opportunity employer. We are excited to work with talented people, period. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, color, religion or belief, national or ethnic origin, gender, age, disability, sexual orientation, gender identity and/or expression, marital or civil status, political affiliation, family or parental status, or any other status protected by the laws or regulations in the jurisdictions in which we operate.Accommodations are available on request for candidates taking part in all aspects of the selection process. Please send an email to accessibility@fullscript.com and let us know the nature of your request and your contact information.Our team handles both personal information and personal health information, which means candidates that receive and accept employment offers must undergo a background check.Want to learn more? Check us out at www.fullscript.com/careers, find us on social media, or check out our culture guide.\n      "},
{"role": "Data Analyst, Growth", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Who we areAbout StripeStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.About The TeamAt Stripe, we’re dedicated to helping millions of companies worldwide to find the financial products they need to grow their businesses. That’s why our Growth Data Science team creates intelligent data products and insights to help us deliver the right message to the right user at the right time. We collaborate with Marketing and Sales to influence the go-to-market strategy, boost product adoption, and increase user retention by making data-driven decisions at scale.What you’ll doWe’re looking for a Data Analyst to partner with the Marketing team to measure and improve the marketing performance across channels (e.g. email, website, events, paid search) and across funnels (e.g. self-serve, sold), and generate insights to inform data-driven go-to-market strategy.ResponsibilitiesDefine, implement and maintain the key success metrics and operational metrics for marketing campaign performance across channels (e.g. email, website, events, paid search).Generate insights on key trends on marketing campaign performance.Conduct ROI analyses, and generate insights into what campaigns and channels are most effective.Design and analyze experiments to improve user acquisition, product adoption, and spend efficiency of marketing campaigns.Design and develop datasets that enable better understanding of marketing campaign performance, and user engagement.Partner closely with Marketing, Sales, Finance, Engineering and Product teams to identify and address the most impactful challenges with data and analyses.Who you areWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.Minimum Requirements3+ years of experience in analytical roles working with large datasets.Bachelor’s degree in a quantitative field (e.g., Statistics, Economics, Sciences, Engineering).Proficiency in SQL and Python.Experience with writing and debugging data pipelines using a distributed data framework (e.g. Hadoop, Spark)Strong knowledge of statistics.Expertise in visualization, and using data insights to deliver actionable recommendations and drive business goals.A demonstrated ability to manage and deliver on multiple projects with a high attention to detail.Ability to communicate results clearly and a focus on driving impact.Experience working with cross-functional teams to deliver results.Preferred QualificationsMaster’s degree in Mathematics, Statistics, Engineering, or a related technical field.Experience working with Marketing and/or Growth teams.Experience with experiment design and analysis.\n      "},
{"role": "Data Analyst, Growth", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Who we areAbout StripeStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.About The TeamAt Stripe, we’re dedicated to helping millions of companies worldwide to find the financial products they need to grow their businesses. That’s why our Growth Data Science team creates intelligent data products and insights to help us deliver the right message to the right user at the right time. We collaborate with Marketing and Sales to influence the go-to-market strategy, boost product adoption, and increase user retention by making data-driven decisions at scale.What you’ll doWe’re looking for a Data Analyst to partner with the Marketing team to measure and improve the marketing performance across channels (e.g. email, website, events, paid search) and across funnels (e.g. self-serve, sold), and generate insights to inform data-driven go-to-market strategy.ResponsibilitiesDefine, implement and maintain the key success metrics and operational metrics for marketing campaign performance across channels (e.g. email, website, events, paid search).Generate insights on key trends on marketing campaign performance.Conduct ROI analyses, and generate insights into what campaigns and channels are most effective.Design and analyze experiments to improve user acquisition, product adoption, and spend efficiency of marketing campaigns.Design and develop datasets that enable better understanding of marketing campaign performance, and user engagement.Partner closely with Marketing, Sales, Finance, Engineering and Product teams to identify and address the most impactful challenges with data and analyses.Who you areWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.Minimum Requirements3+ years of experience in analytical roles working with large datasets.Bachelor’s degree in a quantitative field (e.g., Statistics, Economics, Sciences, Engineering).Proficiency in SQL and Python.Experience with writing and debugging data pipelines using a distributed data framework (e.g. Hadoop, Spark)Strong knowledge of statistics.Expertise in visualization, and using data insights to deliver actionable recommendations and drive business goals.A demonstrated ability to manage and deliver on multiple projects with a high attention to detail.Ability to communicate results clearly and a focus on driving impact.Experience working with cross-functional teams to deliver results.Preferred QualificationsMaster’s degree in Mathematics, Statistics, Engineering, or a related technical field.Experience working with Marketing and/or Growth teams.Experience with experiment design and analysis.\n      "},
{"role": "Business Data Analyst", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        Candidate Requirements/Must Have Skills:5+ years of experience with VBA (extract/export data, create code)3+ years of experience with SQL (extract/join data)Proficiency with MS tools (excel, word)8+ years of experience with Data Analysis (data flows, data reconciliation)Nice-To-Have Skills:Python ExperienceFamiliarity with Accounting Principles (General Ledgers, GLs, etc.)Capital Markets product knowledge\n      "},
{"role": "Data Analyst - Freelance [Remote]", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        ABOUT US:Braintrust is a user-owned talent network that connects you with great jobs with no fees or membership costs—so you keep 100% of what you earn.ABOUT THE HIRING PROCESS:When you join Braintrust, you will be invited to a screening process for Braintrust to learn more about your previous work experiences. Once completed, you will have access to the employer for this role and other top companies that seek high-quality talent. Apply to this job to kick off the process.JOB TYPE: Freelance, Contract Position (no agencies/C2C - see notes below)LOCATION: Remote - North America only (TimeZone: CST | Partial overlap)HOURLY RANGE: Our client is looking to pay $90– $110/hr ESTIMATED DURATION: 40h/week - Short term EXPERIENCE: 3-5 yearsBRAINTRUST JOB ID: 7961  THE OPPORTUNITYRequirementsRole and ResponsibilitiesProject lead, administration, and business requirements for 3 rd party integrations with Salesforce.com (SFDC) including complex configuration, customization, and implementation of applications.Experience with Data uploading on Enablon application or any cloud based application before.Experience with at least one Data Migration or Data Maintaining project.Experience with development and maintenance of .net applications including system interfaces.Experience developing business analytics dashboards and reports including integration with SAP data.Participate in application assessment, design, configuration, testing and deployment.Participate in efforts to develop and execute testing, training, and documentationUtilize best practices to perform operational support, enhancements, bug fixes as needed to the Specright platformFollow all standard operating procedures (SOP) and maintain updated ticketing for events, incidents, requests, changes, problems, etc.Proactively engage on continuous improvement efforts for application design, support, and practice development effortsProvide technical assistance and end user troubleshooting for bug fixes, enhancements, and “how-to” assistanceWhat You’ll Be Working OnQualifications and Education RequirementsBachelor’s/associate degree preferred or equivalent experience3 years of experience with SQL, Web Services a plusAt least 3 years of experience with Salesforce Lightning platform including LWC, which should include: Lightning Components using the Lightning Design System framework, Apex, and declarative platform tools. (Process Builder, Visual Workflow, Lightning App Builder, etc.Ability to clearly communicate with users, development team, and subject matter expertsUploading and modifying large datasets with SQL server is a mustClear documentation for data manipulation while doing data migration is a must. Strong analytical aptitude and problem-solving skills in a technical environmentMulti-task across several ongoing tasks of varying priorities as requiredMust have excellent documentation skillsExcellent verbal and written communication skillsExperience in solution designFamiliarity with Software development life cycle (SDLC)Strong analytical skills and ability to interpret and communicate key performance indicators to all levels of the companyExperience with custom ApplicationsAbility to work in a fast-paced, dynamic, team-oriented environmentAbility to work independentlyStrong attention to detailStrong trouble shooting and problem-solving skillsApply Now!C2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.Braintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.\n      "},
{"role": "Data Analyst (GTM)", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        About UsLuxury Presence is a rapidly growing Bessemer-backed SaaS startup that enables real estate agents to manage their online presence. We are moving fast to build the next generation SaaS platform in the rapidly growing PropTech industry. Now we’re looking to bring on our first Data Analysts to take our data game to the next level. It’s time that we take the entirety of our operational, financial, and product data and start driving insights, predictions, and better decisions across the entire company.Why Now?We’ve enjoyed tremendous growth over the last 5 years. With that growth comes a treasure trove of data that is valuable to us, and our customers. We need experienced and passionate data analysts to help us realize that value and unlock the insights that exist at the intersection of our operational, financial, and product data. This is a unique opportunity to join a fast growing startup and build our data team, culture, and processes from the ground up.What You'll DoEvaluate and implement a BI tech stack to support the democratization of data and analytics through dashboards, reports, and analyticsBuild production-ready data models and schemas using DBT to support downstream analyticsBuild dashboards, data products, and ad hoc report studies to analyze and present data associated with GTM analytics, product performance, business operations, and strategic decision makingWork with key stakeholders and the leadership team to define and monitor KPIs across the companySupport development of predictive models to support strategic and operational initiativesMust HavesAdvanced knowledge of SQLProficiency in any statistical programming language (i.e, Python or R)3+ years in doing analytics with a robust understanding of statistical conceptsExperience working with BI tools (Tableau, SiSense, Sigma, or Looker etc)Ability to communicate technical concepts to both technical and non-technical audiences through visualizations and presentationsExperience with cloud data warehouse and transformation tools (e.g.,, snowflake, DBT etc)Ability to partner with leadership and stakeholders across the company to understand business needs and how these can be addressed through analyticsNice to HavesM.S. or phD in Math, Statistics, or closely related quantitative fieldExperience working closely with data engineering building and managing ETL and rETL workflowsExperience building supervised and unsupervised learning modelsExperience working in a B2B or SaaS environment support sales, marketing, product and/or customer successApplicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time.Who we are: Luxury Presence is the real estate industry's most powerful marketing platform, providing award winning websites and cutting edge tech to the world’s top agents.Founded in 2016 by Stanford Business School alumni Malte Kramer, Luxury Presence currently serves over 8,000 clients in the U.S. and Canada with its SaaS model — including over 20 of the top 100 WSJ real estate agents and teams. In addition, Luxury Presence is the official website partner to some of the industry's most powerful brokerages.The Los Angeles-based SaaS company raised $25.9 million for its Series B round. Bessemer Venture Partners led the round alongside fellow existing investors Toba Capital and Switch Ventures. Former Dallas Mavericks basketball player Dirk Nowitzki also participated in the round, along with other angel investors.Its solutions include stunning website design, an engaging home search tool, an agent-to-agent listing referral network, powerful content &amp; SEO strategies, expert-lead social media management, and digital advertising for lead generation. In 2020, Luxury Presence was recognized as a Best Place to Work by BuiltinLA and by Inc. as the 322nd fastest growing private company in America and then again in 2021 — LP ranked 598th.Luxury Presence is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin.\n      "},
{"role": "Data Analyst Co-op", "seniority_level": "Internship", "employment_type": "\n            Internship\n          ", "job_description": "\n        Responsibilities and Duties:General / Administrative Assist in collecting, cleaning, and preparing data from various sources for analysisSupport the creation of dashboards, reports, and visualizationsCollaborate with the Business Analyst and other team members to understand data requirements for specific business problemsContribute to maintaining and updating existing databases, ensuring data quality and integrityParticipate in team meetings and contribute ideas to improve data management and analytical processesGain exposure to industry trends, competitor activities, and best practices in data analysisProvide general support to other team members as required in data-related tasksOther duties as assignedRequirementsQualifications:Pursuing or recently completed a Bachelor’s degree in Computer Science, Statistics, Mathematics, or a related fieldBasic knowledge of data visualization tools like Tableau, Power BI, or similar is a plusInterest in data analysis methodologies and data-driven decision-makingDesire to learn and grow analytical skills, with an interest in interpreting complex dataFamiliarity with or willingness to learn SQL and other data manipulation languagesGood communication skills, with an eagerness to collaborate with both technical and non-technical team membersNo previous professional experience required, but any relevant academic projects or coursework is a plusWorking Conditions:Working remotely and in office as required at the sole discretion of the companyIntensive computer work and extended use of the computer keyboard and mouseSitting for prolonged periods of time - up to 8 hours per dayOccasional lifting of objects up to 20 lbsWork area may have fluorescent lighting and air conditioningNoise level is usually moderate to loudExposure to ink and chemical fumes, and airborne particles such as paper dust and drying powderAppearance at all times must represent the company imageFast-paced environment: subject to numerous schedule and priority changes and short notice activityOccasional additional hours may be required due to operational requirements.\n      "},
{"role": "Jr. Data Analyst / Full-time (Remote)", "seniority_level": "Not Applicable", "employment_type": "\n            Not Applicable\n          ", "job_description": "\n        The Jr Data Analyst is responsible for providing key technical and financial insights to plan and effectively operate the business, through data analytics, reporting and analysis. They will serve as the central report contact for multiple business units.Essential Functions Of The Jr Data Analyst Role Include Advanced analysis, utilizing large datasets and complex business requirements to drive meaningful change on KPIs and objectives. SQL querying across multiple platforms and scripting to return relevant data while tuning queries &amp; utilizing best practices. Validation check execution, including data element inconsistencies. Align with leadership to design and implement solutions; also checking against standard business trends to identify outliers. Produce reports, graphs, summaries and presentations that convey analytic results in an easy to understand and storied manner. Maintain a focus on flow and context, ensuring analysis provides insights that tie to visuals and speaks to drivers and business strategy shifts where appropriate. Demonstrate the ability to clearly identify key points and callout deeper insights, or tie to other visuals, and how it relates to business performance through written communication within analysis. Review and polish analysis through iterative development. Understand the importance, and basic elements, of project planning, and can create plan independently. Follow project plan and communicates progress/roadblocks proactively. Respect project timelines and maintain clear/concise documentation on requirements, project goals, methodology and output. Understand operational systems and work with IT &amp; Business teams to create reporting governance using our BI tools. Benefits Complimentary Boarding (30 non-holidays per year) Discounted Veterinary Care On-demand pay (DailyPay) Dog/Cat Adoption Assistance Fitness Reimbursement Paid Time Off 401(k) Plan with Company Match Health, Dental and Vision Insurance Community Perks (Discount Program)\n      "},
{"role": "Data Analyst - Canada", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        ReVisionz, a leader in asset &amp; process safety information management, is seeking an experienced Data Analyst to join our team. The primary objective of this role is to utilize advanced programming expertise to efficiently handle substantial volumes of client asset data. This involves analyzing the data to uncover significant insights following predefined criteria and recognizing areas that require attention. Ultimately, the goal is to align this information with the organization's intended information framework. This alignment will facilitate various actions, including enhancing data quality, transitioning to novel solutions, and ensuring seamless integration across diverse systems Our company culture fosters growth and development, making us the ideal place for you to do your best work and grow your career. Here's how you add value:Work with the Content Analysts to establish rules-based processes to extract details from engineering information content and data sources. Analyze plant specifications and engineering content to identify tag and document naming patterns. Analyze quality of existing plant engineering content to identify loading issues (file quality, naming inconsistencies, specification compliance, etc.)Based on the rules apply regex, parsing and other data processing based on interrogation of the sources to provide necessary outcomesUse SQL skills further enabled through such formal computing languages as .NET, Java, Python, etc. to conduct such extraction and data interrogationAlign the findings with defined rules to identify compliance and gaps. Address processing of data off the source databases and fileshares with multiple complex inter-relationshipsAddress the normalization of inconsistent data across multiple sources where naming conventions were not applied consistentlyPrepare XL and dashboard reports with which to effectively present findingsCollaborate with the Content Analysts/ Consultants and business subject matter experts to rigorously interrogate the extracted asset information and assess its state against the business rulesParticipate in Content Analyst/Consultant workshops to provide asset information data expertise to enable methods to uncover findings based on the data extractions performedMaintain the plant configuration level tag and document ENS elements. Develop load sheets based on Plant Document and Tag Data sets and load them into SDXTrack record in the formalization of findings for developing the path forward for enrichment of data in support of migration processesSupport the technical Extract/Transform/Load team members who codify process and enrichment rules that are established to address the compliance and gap findings from the analysis and assessmentsRequirements  Bachelor’s Computer Science, Engineering or Management Information Systems, or related fieldStrong experience gained through repeated lead data role in sophisticated data analysis projects involving:applying SQL to datasets upon which to extract, parse and assess the information,extending SQL with .NET programming skills or other such as Java, Python, etc. for addressing specialized extraction, scraping and analysis skills (with .NET is preferred), andexperience with source control of coding used in processing (e.g., Git, SVN, or similar)5+ years domain experience in Engineering Document and Information Management Systems for Owner/Operators or EPC’s, including for Tags/Controlled Documentation and the lifecycle of such across project/operations use in facilitiesDirect domain experience working for Owner / Operators or EPC’s, including:engineering information standards (e.g., tag and document classification, tag and document metadata, tag and document states)engineering information management processesunderstanding of the engineering information lifecycle and how this supports Engineering, Construction, C&amp;SU, Operations, Maintenance &amp; Reliability, etcA background in existing engineering information management system(s) and databases from such solutions as Hexagon, Bentley, Aveva, etc. will be an assetHighly variable sources and data is the norm, as is poor data quality. The candidate must have a proven and demonstrable track record in developing data interrogation automation solutions with which to process large volume sets with high accuracy and efficiencySources vary from strong metadata in sophisticated databases through to fileshares/other sources with only folder/filename without such metadata. Strong background to establish findings in both situations is necessary including folder paths and filenamesSkills in creatively establishing coded rules with which to interrogate source data so as to establish compliance and gap findings. Interaction with SMEs to guide them in being able to express the rules is importantVolume varies significantly. Background is needed for up to high volume data setsExperience in the migration of files from sources to destinations in relation to the document objects. Experience with key role in engagements for engineering and asset information migration as part of solution implementationPrimary focus on extremely high rates of success on the migration of data/documents and their related metadata**Applicants must have Permanent Resident status or hold an open work permit in Canada. USA applicants must provide proof of eligibility to work if you are not a US citizen or a Green Card holder.**We value diversity in our business and encourage responses from all qualified applicants. While we are appreciative of every application we receive, we advise that only candidates under consideration will be contacted.\n      "},
{"role": "Data Analyst", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        About Novi ConnectAt Novi, we believe brands should have complete data transparency for their raw materials and there is a better way for suppliers to provide raw material data and share it with product developers making sourcing decisions. Novi is built on the premise that a technology-driven network solution is the right way to scale transparent product development. Novi makes it easy for brands to have access to information about raw materials to evaluate existing products and to develop new products, and efficient for suppliers to upload information to the Novi platform to get discovered by brands. Founded by technologists and consumer product experts, Novi has a diverse team around the globe that is revolutionizing the way products are developed through the democratization of data.About The RoleNovi is building a data platform to help brands and formulators understand their products and ingredients, and a marketplace to help them purchase transparent and more sustainable ingredients from suppliers. This industry we're tackling is fragmented and complicated, so we are looking for someone who is excited about fundamentally changing the way this industry works today and the early stages of company building.This is a high-impact role. We're a small, early-stage company so you'll be working closely with the many different stakeholders and be an integral part of both our product development process as well as Novi's business. Reporting directly to our CEO, you will be the primary point point person for all things data at Novi - collecting, analyzing, synthesizing, and disseminating to the rest of the team to ensure we are always laser-focused and data-driven.What you'll doHelp build on our existing data warehouse to ensure that we’re capturing all of the important data points in well-structured &amp; logical ways - and help ensure our warehouse &amp; infrastructure keeps up with our rapid pace of growth and iterationLeverage a suite of analytics tools (including dbt, BigQuery, Mixpanel &amp; more) to develop and implement data analyses and maintain data integrityEnsure our data is accessible to all team members, including creating reports and visualizations, maintaining dashboards, and transforming data into flattened tables to unlock insights across the companyLead our data strategy and influence key product and engineering decisions around the development and maintenance of data collection and infrastructureWork closely with the Product team to make actionable recommendations about product strategy and prioritization based on a deep understanding of customer engagement and behaviorWork closely with the Leadership team to measure business health and growth and make actionable recommendations on business strategyWhat you bring3+ years of experience in a quantitative or analytical role (eg. analytics, consulting, data science, or an equivalent role conducting analysis on large datasets)Advanced proficiency in SQL to query large datasets and experience with dimensional modelingExpertise in data visualization and creating interactive dashboards that give business users the tools they need to answer business or product related questionsStrong understanding of product &amp; business metricsStrong attention to detailAn entrepreneurial spirit: you roll up your sleeves with hands-on hustle and are excited about meeting the demands of a fast-paced startup environmentLow ego, high confidence: you have a love of learning and finding the best solution, regardless of who comes up with you. You are good at holding a high bar and challenging yourself and others in an open, team oriented wayKind &amp; caring: you genuinely care about the well being of your teammates and support one anotherStrong collaboration &amp; communication skills: you form trusting relationships with your cross-functional teammates and can communicate complex analyses clearly &amp; quickly across all audiencesExperience with tools for product and business analytics (eg. Mixpanel, Amplitude) and visualization software (eg. Google Data Studio, Looker)Conviction and passion about sustainability and our mission to change the way consumer products are developed - you’re here to serve our planet, our customers and your team.\n      "},
{"role": "Data Analyst - Freelance [Remote]", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        ABOUT US:Braintrust is a user-owned talent network that connects you with great jobs with no fees or membership costs—so you keep 100% of what you earn.ABOUT THE HIRING PROCESS:When you join Braintrust, you will be invited to a screening process for Braintrust to learn more about your previous work experiences. Once completed, you will have access to the employer for this role and other top companies that seek high-quality talent. Apply to this job to kick off the process.JOB TYPE: Freelance, Contract Position (no agencies/C2C - see notes below)LOCATION: Remote - North America only (TimeZone: CST | Partial overlap)HOURLY RANGE: Our client is looking to pay $90– $110/hr ESTIMATED DURATION: 40h/week - Short term EXPERIENCE: 3-5 yearsBRAINTRUST JOB ID: 7961  THE OPPORTUNITYRequirementsRole and ResponsibilitiesProject lead, administration, and business requirements for 3 rd party integrations with Salesforce.com (SFDC) including complex configuration, customization, and implementation of applications.Experience with Data uploading on Enablon application or any cloud based application before.Experience with at least one Data Migration or Data Maintaining project.Experience with development and maintenance of .net applications including system interfaces.Experience developing business analytics dashboards and reports including integration with SAP data.Participate in application assessment, design, configuration, testing and deployment.Participate in efforts to develop and execute testing, training, and documentationUtilize best practices to perform operational support, enhancements, bug fixes as needed to the Specright platformFollow all standard operating procedures (SOP) and maintain updated ticketing for events, incidents, requests, changes, problems, etc.Proactively engage on continuous improvement efforts for application design, support, and practice development effortsProvide technical assistance and end user troubleshooting for bug fixes, enhancements, and “how-to” assistanceWhat You’ll Be Working OnQualifications and Education RequirementsBachelor’s/associate degree preferred or equivalent experience3 years of experience with SQL, Web Services a plusAt least 3 years of experience with Salesforce Lightning platform including LWC, which should include: Lightning Components using the Lightning Design System framework, Apex, and declarative platform tools. (Process Builder, Visual Workflow, Lightning App Builder, etc.Ability to clearly communicate with users, development team, and subject matter expertsUploading and modifying large datasets with SQL server is a mustClear documentation for data manipulation while doing data migration is a must. Strong analytical aptitude and problem-solving skills in a technical environmentMulti-task across several ongoing tasks of varying priorities as requiredMust have excellent documentation skillsExcellent verbal and written communication skillsExperience in solution designFamiliarity with Software development life cycle (SDLC)Strong analytical skills and ability to interpret and communicate key performance indicators to all levels of the companyExperience with custom ApplicationsAbility to work in a fast-paced, dynamic, team-oriented environmentAbility to work independentlyStrong attention to detailStrong trouble shooting and problem-solving skillsApply Now!C2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.Braintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.\n      "},
{"role": "Data Analyst - Freelance [Remote]", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        ABOUT US:Braintrust is a user-owned talent network that connects you with great jobs with no fees or membership costs—so you keep 100% of what you earn.ABOUT THE HIRING PROCESS:When you join Braintrust, you will be invited to a screening process for Braintrust to learn more about your previous work experiences. Once completed, you will have access to the employer for this role and other top companies that seek high-quality talent. Apply to this job to kick off the process.JOB TYPE: Freelance, Contract Position (no agencies/C2C - see notes below)LOCATION: Remote - North America only (TimeZone: CST | Partial overlap)HOURLY RANGE: Our client is looking to pay $90– $110/hr ESTIMATED DURATION: 40h/week - Short term EXPERIENCE: 3-5 yearsBRAINTRUST JOB ID: 7961  THE OPPORTUNITYRequirementsRole and ResponsibilitiesProject lead, administration, and business requirements for 3 rd party integrations with Salesforce.com (SFDC) including complex configuration, customization, and implementation of applications.Experience with Data uploading on Enablon application or any cloud based application before.Experience with at least one Data Migration or Data Maintaining project.Experience with development and maintenance of .net applications including system interfaces.Experience developing business analytics dashboards and reports including integration with SAP data.Participate in application assessment, design, configuration, testing and deployment.Participate in efforts to develop and execute testing, training, and documentationUtilize best practices to perform operational support, enhancements, bug fixes as needed to the Specright platformFollow all standard operating procedures (SOP) and maintain updated ticketing for events, incidents, requests, changes, problems, etc.Proactively engage on continuous improvement efforts for application design, support, and practice development effortsProvide technical assistance and end user troubleshooting for bug fixes, enhancements, and “how-to” assistanceWhat You’ll Be Working OnQualifications and Education RequirementsBachelor’s/associate degree preferred or equivalent experience3 years of experience with SQL, Web Services a plusAt least 3 years of experience with Salesforce Lightning platform including LWC, which should include: Lightning Components using the Lightning Design System framework, Apex, and declarative platform tools. (Process Builder, Visual Workflow, Lightning App Builder, etc.Ability to clearly communicate with users, development team, and subject matter expertsUploading and modifying large datasets with SQL server is a mustClear documentation for data manipulation while doing data migration is a must. Strong analytical aptitude and problem-solving skills in a technical environmentMulti-task across several ongoing tasks of varying priorities as requiredMust have excellent documentation skillsExcellent verbal and written communication skillsExperience in solution designFamiliarity with Software development life cycle (SDLC)Strong analytical skills and ability to interpret and communicate key performance indicators to all levels of the companyExperience with custom ApplicationsAbility to work in a fast-paced, dynamic, team-oriented environmentAbility to work independentlyStrong attention to detailStrong trouble shooting and problem-solving skillsApply Now!C2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.Braintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.\n      "},
{"role": "Data Analyst - Freelance [Remote]", "seniority_level": "Mid-Senior level", "employment_type": "\n            Mid-Senior level\n          ", "job_description": "\n        ABOUT US:Braintrust is a user-owned talent network that connects you with great jobs with no fees or membership costs—so you keep 100% of what you earn.ABOUT THE HIRING PROCESS:When you join Braintrust, you will be invited to a screening process for Braintrust to learn more about your previous work experiences. Once completed, you will have access to the employer for this role and other top companies that seek high-quality talent. Apply to this job to kick off the process.JOB TYPE: Freelance, Contract Position (no agencies/C2C - see notes below)LOCATION: Remote - North America only (TimeZone: CST | Partial overlap)HOURLY RANGE: Our client is looking to pay $90– $110/hr ESTIMATED DURATION: 40h/week - Short term EXPERIENCE: 3-5 yearsBRAINTRUST JOB ID: 7961  THE OPPORTUNITYRequirementsRole and ResponsibilitiesProject lead, administration, and business requirements for 3 rd party integrations with Salesforce.com (SFDC) including complex configuration, customization, and implementation of applications.Experience with Data uploading on Enablon application or any cloud based application before.Experience with at least one Data Migration or Data Maintaining project.Experience with development and maintenance of .net applications including system interfaces.Experience developing business analytics dashboards and reports including integration with SAP data.Participate in application assessment, design, configuration, testing and deployment.Participate in efforts to develop and execute testing, training, and documentationUtilize best practices to perform operational support, enhancements, bug fixes as needed to the Specright platformFollow all standard operating procedures (SOP) and maintain updated ticketing for events, incidents, requests, changes, problems, etc.Proactively engage on continuous improvement efforts for application design, support, and practice development effortsProvide technical assistance and end user troubleshooting for bug fixes, enhancements, and “how-to” assistanceWhat You’ll Be Working OnQualifications and Education RequirementsBachelor’s/associate degree preferred or equivalent experience3 years of experience with SQL, Web Services a plusAt least 3 years of experience with Salesforce Lightning platform including LWC, which should include: Lightning Components using the Lightning Design System framework, Apex, and declarative platform tools. (Process Builder, Visual Workflow, Lightning App Builder, etc.Ability to clearly communicate with users, development team, and subject matter expertsUploading and modifying large datasets with SQL server is a mustClear documentation for data manipulation while doing data migration is a must. Strong analytical aptitude and problem-solving skills in a technical environmentMulti-task across several ongoing tasks of varying priorities as requiredMust have excellent documentation skillsExcellent verbal and written communication skillsExperience in solution designFamiliarity with Software development life cycle (SDLC)Strong analytical skills and ability to interpret and communicate key performance indicators to all levels of the companyExperience with custom ApplicationsAbility to work in a fast-paced, dynamic, team-oriented environmentAbility to work independentlyStrong attention to detailStrong trouble shooting and problem-solving skillsApply Now!C2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.Braintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.\n      "}